{
  "backend/main.mo": "Motoko canister with health check, event logging with access control, and feature specification queries for planned UI pages.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing various frontend components, hooks, pages, and documentation files.",
  "frontend/docs/data-architecture.md": "Explains authentication, role handling, admin bootstrap, and React Query–based data flows in the frontend.",
  "frontend/docs/design-direction.md": "Design guidelines detailing the dark‑fantasy theme, colors, typography, spacing, and interactive styles.",
  "frontend/docs/local-storage-strategy.md": "Describes local storage categories, canister‑backed data, React Query invalidation, and offline support.",
  "frontend/docs/phase1-features-by-page.md": "Lists Phase 1 page structures and future enhancements for all site pages including shop, dashboard, and admin.",
  "frontend/docs/phase1-planning.md": "Outlines project architecture, site map, access levels, and Phase 1 scope for the application.",
  "frontend/docs/phase6-qa-test-plan.md": "Provides detailed manual QA test cases for authentication, access control, and shop behaviors across devices.",
  "frontend/docs/phase7-iteration-playbook.md": "Describes the workflow for feedback collection, offline support, admin review, and iterative feature updates.",
  "frontend/docs/production-deployment.md": "Covers backend and frontend deployment steps for IC, Vercel, and Netlify along with required environment variables.",
  "frontend/index.css": "Defines Tailwind CSS layers and app-wide light/dark theme design tokens using CSS variables.",
  "frontend/index.html": "Base HTML template loading the React app with metadata, favicon, and root mounting point.",
  "frontend/src/App.tsx": "Sets up the main React app with routing, lazy‑loaded pages, analytics init, React Query, theming, and global error handling.",
  "frontend/src/components/about/TeamSection.tsx": "Renders a grid of flip‑card profiles for team members with bios, roles, and expertise.",
  "frontend/src/components/about/TimelineSection.tsx": "Displays a vertical timeline of company milestones using styled cards and icons.",
  "frontend/src/components/admin/AdminFeedbackTab.tsx": "Fetches and displays user feedback with search and category filters, status badges, and error/loading states.",
  "frontend/src/components/admin/AdminOrdersTab.tsx": "Shows all orders with filters for order ID and user principal, handling loading and empty states.",
  "frontend/src/components/admin/AdminProductsTab.tsx": "Manages product CRUD operations including creation, editing, and stock updates with dialogs, validation, and queued mutations.",
  "frontend/src/components/admin/AdminUsersTab.tsx": "Provides UI and logic for granting and revoking admin roles using principal validation and queued mutations with toast feedback.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles login/logout via Internet Identity, clearing caches on logout and showing appropriate button states.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Displays a modal form for collecting and saving a user's name and email before continuing.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Protects admin-only content by checking authentication and admin role, showing access or login prompts when needed.",
  "frontend/src/components/auth/RequireAuth.tsx": "Restricts access to authenticated users, prompting login when identity is missing or initializing.",
  "frontend/src/components/contact/ContactPageFAQ.tsx": "Renders a FAQ accordion with predefined questions and answers about shipping, returns, and artifact care.",
  "frontend/src/components/dashboard/GuildOrdersPanel.tsx": "Fetches and displays guild orders with loading, error, and empty states, listing quests with status and rewards.",
  "frontend/src/components/dashboard/InventoryPanel.tsx": "Manages and displays the shopping cart, mapping products, calculating totals, and handling checkout via queued orders.",
  "frontend/src/components/effects/FadeInSection.tsx": "Fades in child content when scrolled into view, respecting reduced-motion settings.",
  "frontend/src/components/effects/FlipCard.tsx": "Interactive flip card component with keyboard support and motion-reduction handling.",
  "frontend/src/components/effects/ParallaxLayer.tsx": "Applies a scroll-based parallax transform using requestAnimationFrame with reduced-motion support.",
  "frontend/src/components/feedback/FeedbackDialog.tsx": "Feedback form dialog with draft persistence, identity checks, and queued offline submission.",
  "frontend/src/components/feedback/FeedbackLauncher.tsx": "Small launcher button that opens the feedback dialog.",
  "frontend/src/components/home/Announcements.tsx": "Displays a list of static announcement cards with badges and dates.",
  "frontend/src/components/home/FeaturedCarousel.tsx": "Carousel for featured shop items with navigation and indicator controls.",
  "frontend/src/components/home/QuickLinksGrid.tsx": "Grid of navigational cards linking to major site sections.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines main app layout with background, header, footer, quotes, routing outlet, analytics, and offline status.",
  "frontend/src/components/layout/Footer.tsx": "Footer with navigation links, support links, legal links, and attribution.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header navigation with desktop and mobile menus, route-based menu closing, and scroll locking.",
  "frontend/src/components/layout/PageLayout.tsx": "Simple layout wrapper that renders an optional title and description above page content.",
  "frontend/src/components/quotes/RandomQuotes.tsx": "Displays up to three random quotes using a custom hook and styled cards.",
  "frontend/src/components/services/ServiceDetailsAccordion.tsx": "Accordion component listing detailed service descriptions with icons, summaries, and feature lists.",
  "frontend/src/components/shop/ProductDetailsModal.tsx": "Product detail modal with price, stock status, description, save/unsave logic, and add-to-cart actions.",
  "frontend/src/components/shop/useShopFilters.ts": "Hook providing search query state and memoized product filtering by name or description.",
  "frontend/src/components/system/AnalyticsProvider.tsx": "Tracks initial and subsequent page views using router navigation events and user actor info.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "Top-level error boundary that logs errors, displays a recovery UI, and allows reload or troubleshooting.",
  "frontend/src/components/system/ErrorState.tsx": "Reusable error display showing offline or generic errors with an optional retry button.",
  "frontend/src/components/system/OfflineSyncQueueDialog.tsx": "Dialog UI for viewing, retrying, and managing queued offline mutations with support for removing and clearing failed actions.",
  "frontend/src/components/system/OfflineSyncStatus.tsx": "Floating status indicator showing offline sync progress, errors, and access to the queue dialog.",
  "frontend/src/components/system/TroubleshootingDialog.tsx": "Dialog for displaying, inspecting, and clearing locally stored error logs with timestamps and stack traces.",
  "frontend/src/data/quotes.ts": "Exports a list of static themed quotes used throughout the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useGlobalErrorCapture.ts": "Registers global handlers to log runtime errors and unhandled promise rejections to local storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and identity persistence via a React context.",
  "frontend/src/hooks/useInView.ts": "Custom hook using IntersectionObserver to track when an element enters the viewport.",
  "frontend/src/hooks/useLocalCart.ts": "Manages a persistent local cart with add, remove, quantity updates, and total calculations stored in localStorage.",
  "frontend/src/hooks/useOfflineDrafts.ts": "Manages saving, loading, and clearing form drafts in localStorage with expiry handling.",
  "frontend/src/hooks/useOfflineMutationReplay.ts": "Replays queued offline mutations when online, with retry logic, error tracking, and query invalidation.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects user reduced‑motion preference with cross‑browser media query support.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, roles, products, and related backend data.",
  "frontend/src/hooks/useQueuedMutations.ts": "Queues mutations for offline use and executes them when online, falling back to local storage.",
  "frontend/src/hooks/useRandomQuotes.ts": "Returns random quotes that refresh when the route changes.",
  "frontend/src/hooks/useRecentlyViewed.ts": "Tracks recently viewed products in localStorage with automatic pruning and expiry.",
  "frontend/src/hooks/useSessionState.ts": "Persists component state across a session using localStorage with session ID and expiry.",
  "frontend/src/index.css": "Defines global styles, color schemes, typography, animations, and utility classes using Tailwind and OKLCH colors.",
  "frontend/src/lib/analytics.ts": "Implements configurable analytics with first‑party logging or Google Analytics, including script injection and event/pageview tracking.",
  "frontend/src/lib/errorLogging.ts": "Provides local client-side error logging with sanitization, size limits, and utilities to read, write, and clear logs.",
  "frontend/src/lib/localStorage.ts": "Defines versioned, fault‑tolerant localStorage utilities with expiry handling and cleanup helpers.",
  "frontend/src/lib/offlineMutationQueue.ts": "Manages a versioned offline mutation queue with enqueue, update, retry, and clear operations stored in localStorage.",
  "frontend/src/lib/randomQuotes.ts": "Selects 2–3 unique random quotes from a predefined list without repetition.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity context providers.",
  "frontend/src/pages/About.tsx": "Renders an About page describing the creator, mission, and values using styled sections and animations.",
  "frontend/src/pages/Admin.tsx": "Displays an admin panel with tabs for managing products, orders, users, and feedback, gated by admin access.",
  "frontend/src/pages/BlogLore.tsx": "Shows a list of styled lore-themed blog post cards with metadata and fade-in effects.",
  "frontend/src/pages/Contact.tsx": "Renders a contact form with input fields and handles simulated submission with toast feedback.",
  "frontend/src/pages/Dashboard.tsx": "Displays a user dashboard with tabs for profile, orders, saved items, cart, and quests using various data queries.",
  "frontend/src/pages/FAQ.tsx": "Shows a searchable FAQ list with categorized questions and answers in an accordion layout.",
  "frontend/src/pages/Homepage.tsx": "Builds the homepage with a hero section, featured carousel, quick links, and feature highlights.",
  "frontend/src/pages/Privacy.tsx": "Presents the site's privacy policy with sectioned explanations of data practices and user rights.",
  "frontend/src/pages/Services.tsx": "Displays available services via an accordion and includes a call-to-action for custom service inquiries.",
  "frontend/src/pages/Shop.tsx": "Implements the Shop page with product fetching, filtering, view toggling, and a memoized product card component with modal details.",
  "frontend/src/pages/Terms.tsx": "Renders the Terms of Service page using styled sections inside a PageLayout with fade-in effects.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors, animations, and plugins for the project's fantasy-themed UI.",
  "project_state.json": "Describes current project state, scope changes, architecture notes, and known issues including backend conflicts and deployment errors."
}