{
  "backend/main.mo": "Main canister actor defining authorization mixins, persistent stores for users, products, orders, events, and feature specs, plus admin-gated event logging and health checks.",
  "backend/migration.mo": "Migration module that maps old actor state to the new schema, adding default product fields and ensuring persistence compatibility during upgrades.",
  "feature_evidence.json": "Feature evidence report mapping high-level features to frontend files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "List of summarized descriptions for various frontend files including pages, hooks, components, and documentation.",
  "frontend/docs/data-architecture.md": "Documentation outlining frontend-visible data model, authentication flow, and role-based access control behavior.",
  "frontend/docs/design-direction.md": "Design spec describing the dark fantasy theme including colors, typography, spacing, and UI interaction patterns.",
  "frontend/docs/local-storage-strategy.md": "Describes local-only storage keys, canister-backed data caching, and offline support mechanisms including drafts and mutation queue.",
  "frontend/docs/phase1-features-by-page.md": "Lists Phase 1 page features and outlines future enhancements for each site section.",
  "frontend/docs/phase1-planning.md": "Covers project scope, site map, navigation, access levels, and Phase 1 architecture goals.",
  "frontend/docs/phase6-qa-test-plan.md": "Provides manual QA test cases for authentication, access control, and core shop features across browsers and devices.",
  "frontend/docs/phase7-iteration-playbook.md": "Defines iteration workflow, offline-first mechanisms, feedback submission flow, and admin review process.",
  "frontend/docs/production-deployment.md": "Explains deployment steps for backend and frontend, including IC canister setup and hosting options with required env vars.",
  "frontend/index.css": "Tailwind setup defining light and dark theme CSS variables and applying global background, text, and border styles.",
  "frontend/index.html": "Base HTML template that loads the React app and sets metadata and favicon.",
  "frontend/src/App.tsx": "Main React app setup with routing, lazy-loaded pages, react-query client, theme provider, and global error handling.",
  "frontend/src/components/about/TeamSection.tsx": "Renders a team grid with flip cards showing member bios and expertise.",
  "frontend/src/components/about/TimelineSection.tsx": "Displays a vertical milestone timeline with years, titles, and descriptions.",
  "frontend/src/components/admin/AdminFeedbackTab.tsx": "Empty placeholder component.",
  "frontend/src/components/admin/AdminOrdersTab.tsx": "Admin interface for viewing, filtering, and listing all orders with loading and empty states.",
  "frontend/src/components/admin/AdminProductsTab.tsx": "Empty placeholder component.",
  "frontend/src/components/admin/AdminTestimoniesTab.tsx": "Empty placeholder component.",
  "frontend/src/components/admin/AdminUsersTab.tsx": "Empty placeholder component.",
  "frontend/src/components/adminplus/AdminPasswordResetSection.tsx": "Form allowing admins to validate principals and reset admin passwords with mutation handling and validation.",
  "frontend/src/components/adminplus/AdminRegistrySection.tsx": "UI section for listing admins and promoting or demoting principals with validation and mutation hooks.",
  "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx": "Admin controls for toggling shop availability, overriding product prices, and adjusting product visibility.",
  "frontend/src/components/adminplus/AnalyticsSnapshotSection.tsx": "Displays a snapshot of analytics data with loading states and a refresh mechanism.",
  "frontend/src/components/adminplus/CouponManagerSection.tsx": "Provides a global switch to enable or disable coupon usage with status indicators and alerts.",
  "frontend/src/components/adminplus/PortfolioManagerSection.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/adminplus/QuoteRequestManagerSection.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/adminplus/TestimonyManagerSection.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and session clearing on logout.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Modal form for collecting and saving a user's name and email during initial profile setup.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Gatekeeper component that restricts access to admin content based on authentication and user role.",
  "frontend/src/components/auth/RequireAuth.tsx": "Guards routes by checking Internet Identity authentication and displays a login prompt if unauthenticated.",
  "frontend/src/components/auth/RequireOwner.tsx": "Restricts access to owner-only areas by verifying identity and owner status, showing errors when unauthorized.",
  "frontend/src/components/contact/ContactPageFAQ.tsx": "Renders a list of FAQ items using an accordion component.",
  "frontend/src/components/dashboard/GuildOrdersPanel.tsx": "Empty placeholder file for a future guild orders dashboard panel.",
  "frontend/src/components/dashboard/InventoryPanel.tsx": "Empty placeholder file for a future inventory dashboard panel.",
  "frontend/src/components/effects/FadeInSection.tsx": "Applies a fade‑in animation when content enters the viewport with reduced‑motion support.",
  "frontend/src/components/effects/FlipCard.tsx": "Interactive flip card component toggling front/back views with keyboard and reduced‑motion support.",
  "frontend/src/components/effects/ParallaxLayer.tsx": "Implements a parallax scrolling layer using requestAnimationFrame and reduced‑motion handling.",
  "frontend/src/components/feedback/FeedbackDialog.tsx": "Empty placeholder file for a feedback dialog component.",
  "frontend/src/components/feedback/FeedbackLauncher.tsx": "Empty placeholder file for a feedback launcher component.",
  "frontend/src/components/home/Announcements.tsx": "Displays a list of recent announcements in styled cards.",
  "frontend/src/components/home/FeaturedCarousel.tsx": "A carousel cycling through featured items with navigation controls and detail links.",
  "frontend/src/components/home/QuickLinksGrid.tsx": "Shows a grid of shortcut links to main site sections with icons.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the global app layout with header, footer, background, random quotes, and analytics.",
  "frontend/src/components/layout/Footer.tsx": "Footer with site links, legal info, branding, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with navigation links, auth buttons, and conditional admin links using mobile and desktop layouts.",
  "frontend/src/components/layout/PageLayout.tsx": "Wrapper component that displays an optional title and description above page content.",
  "frontend/src/components/portfolio/PortfolioDetailsModal.tsx": "Empty placeholder file for a portfolio details modal component.",
  "frontend/src/components/portfolio/PortfolioWidgetSection.tsx": "Empty placeholder file for a portfolio widget section component.",
  "frontend/src/components/quotes/RandomQuotes.tsx": "Fetches and displays 2–3 random quotes in styled cards on each navigation.",
  "frontend/src/components/services/ServiceDetailsAccordion.tsx": "Accordion listing service offerings with icons, summaries, and detailed feature lists.",
  "frontend/src/components/shop/ProductDetailsModal.tsx": "Modal showing full product details with images, pricing, stock, availability, and add‑to‑cart actions.",
  "frontend/src/components/shop/ProductFlipCard.tsx": "Flip‑card product display showing image, price, stock, and a back side with summary and view‑details button.",
  "frontend/src/components/shop/ShopCartDrawer.tsx": "Slide‑out cart drawer handling cart items, coupons, checkout, and order creation logic.",
  "frontend/src/components/shop/useShopFilters.ts": "Hook providing text search, stock filtering, and sorting logic for shop product lists.",
  "frontend/src/components/system/AnalyticsProvider.tsx": "Tracks page views on initial load and route changes using an analytics utility.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "A React error boundary that logs errors locally and displays a recovery UI with reload and troubleshooting options.",
  "frontend/src/components/system/ErrorState.tsx": "Displays an error alert with network/offline detection and an optional retry button.",
  "frontend/src/components/system/OfflineSyncQueueDialog.tsx": "Empty placeholder file for an offline sync queue dialog.",
  "frontend/src/components/system/OfflineSyncStatus.tsx": "Empty placeholder file for offline sync status UI.",
  "frontend/src/components/system/TroubleshootingDialog.tsx": "A dialog that shows locally stored error logs with options to view details and clear the log.",
  "frontend/src/components/testimonies/CreateTestimonyDialog.tsx": "Empty placeholder file for a testimony creation dialog.",
  "frontend/src/components/testimonies/StarRating.tsx": "Renders a star-based rating component with filled and unfilled stars.",
  "frontend/src/components/testimonies/TestimoniesWidgetSection.tsx": "Empty placeholder file for a testimonies widget section.",
  "frontend/src/data/quotes.ts": "Exports a list of themed quotes used for random display across pages.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the authenticated identity and refreshes dependent queries.",
  "frontend/src/hooks/useGlobalErrorCapture.ts": "Registers global handlers to log runtime errors and unhandled promise rejections to local storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for authentication, identity loading, and login/logout handling.",
  "frontend/src/hooks/useInView.ts": "Provides an IntersectionObserver-based hook that reports when an element enters the viewport.",
  "frontend/src/hooks/useLocalCart.ts": "Manages a versioned localStorage-backed shopping cart with add, remove, update, and quantity helper functions.",
  "frontend/src/hooks/useOfflineDrafts.ts": "Manages form drafts in localStorage with load, save, expiry handling, and clearing for a given form ID.",
  "frontend/src/hooks/useOfflineMutationReplay.ts": "Empty file placeholder for offline mutation replay logic.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced-motion preference with cross-browser media query support.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user, role, admin, and backend interactions using an actor-based API.",
  "frontend/src/hooks/useQueuedMutations.ts": "Empty file placeholder for queued mutation functionality.",
  "frontend/src/hooks/useRandomQuotes.ts": "Returns 2–3 random quotes that refresh on route changes.",
  "frontend/src/hooks/useRecentlyViewed.ts": "Tracks and stores recently viewed products in localStorage with capping and expiry.",
  "frontend/src/hooks/useSessionState.ts": "Persists component state across a user session using a generated session ID in localStorage.",
  "frontend/src/index.css": "Defines app-wide fonts, Tailwind layers, OKLCH color themes, dark mode variables, and utility animations.",
  "frontend/src/lib/analytics.ts": "Implements first‑party and Google Analytics tracking with script injection and page/event logging.",
  "frontend/src/lib/errorLogging.ts": "Provides local error logging with sanitization, capped storage, and utilities to read, write, and clear logs.",
  "frontend/src/lib/localStorage.ts": "Provides versioned, expiring, and safely handled localStorage utilities including get, set, remove, and cleanup helpers.",
  "frontend/src/lib/offlineMutationQueue.ts": "Implements a persistent offline mutation queue with enqueue, dequeue, retry tracking, failure marking, and clearing via localStorage.",
  "frontend/src/lib/randomQuotes.ts": "Selects 2–3 non-repeating random quotes from a predefined list.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/About.tsx": "Renders the About page with creator background, mission content, and animated sections.",
  "frontend/src/pages/Admin.tsx": "Displays an admin-only panel with placeholders for product, order, and user management.",
  "frontend/src/pages/AdminPlus.tsx": "Renders the owner-only Admin+ panel with analytics, shop controls, coupon management, admin registry, and password tools.",
  "frontend/src/pages/BlogLore.tsx": "Shows a grid of stylized lore-themed blog post previews with animations.",
  "frontend/src/pages/Contact.tsx": "Renders a contact form with input fields, simulated submission, and success toast within a styled layout.",
  "frontend/src/pages/Dashboard.tsx": "Displays user dashboard with profile setup, orders, and product data using various queries and conditional UI states.",
  "frontend/src/pages/FAQ.tsx": "Shows a searchable FAQ list with categories using an accordion layout.",
  "frontend/src/pages/Homepage.tsx": "Builds the homepage with hero content, featured carousel, quick links, and feature highlights.",
  "frontend/src/pages/Portfolio.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/Privacy.tsx": "Presents a static privacy policy divided into titled sections within a styled card.",
  "frontend/src/pages/Services.tsx": "Displays service details via an accordion and includes a call‑to‑action for custom service inquiries.",
  "frontend/src/pages/Shop.tsx": "Main shop page that loads products, applies filters, handles loading/error/maintenance states, and manages product details and cart UI.",
  "frontend/src/pages/Terms.tsx": "Static Terms of Service page displaying legal sections within a styled layout.",
  "frontend/src/pages/Testimonies.tsx": "Empty placeholder page component with no implemented content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, animations, fonts, and plugin settings.",
  "project_state.json": "Project state file describing current build phase, architecture notes, and implemented features for admin and shop controls."
}