{
  "backend/main.mo": "Motoko canister defining feature specs, domain types, storage maps, and role management skeleton via access control mixin.",
  "feature_evidence.json": "JSON report mapping feature requirements to impacted frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of short summaries for numerous frontend components, hooks, pages, and docs.",
  "frontend/docs/data-architecture.md": "Documentation of auth flow, role model, and how frontend queries backend for user roles and persisted data.",
  "frontend/docs/design-direction.md": "Design guide describing the dark‑fantasy theme, colors, typography, spacing, and interaction styles.",
  "frontend/docs/local-storage-strategy.md": "Documentation of localStorage schema, canister-backed data, React Query invalidation, and offline mutation handling.",
  "frontend/docs/phase1-features-by-page.md": "Lists Phase 1 and future features for each site page, outlining required components and planned enhancements.",
  "frontend/docs/phase1-planning.md": "Defines project architecture, sitemap, access levels, and Phase 1 feature scope for the application.",
  "frontend/index.css": "Configures Tailwind base styles and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry file setting up metadata and loading the React application root.",
  "frontend/src/App.tsx": "Sets up routing, lazy-loaded pages, React Query config, and global layout for the app.",
  "frontend/src/components/about/TeamSection.tsx": "Displays a grid of team member flip cards showing profiles and bios.",
  "frontend/src/components/about/TimelineSection.tsx": "Renders a vertical milestone timeline with themed styling and year-based entries.",
  "frontend/src/components/admin/AdminOrdersTab.tsx": "Provides an admin view for listing and filtering orders with loading states and search inputs.",
  "frontend/src/components/admin/AdminProductsTab.tsx": "UI for admins to create, edit, and update product stock using queued mutations with validation and dialogs.",
  "frontend/src/components/admin/AdminUsersTab.tsx": "Provides forms for granting and revoking admin roles via queued mutations with principal validation and error handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with session clearing and status handling.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Profile setup modal allowing users to submit name and email via a mutation before continuing.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Route guard that checks authentication and admin role, showing appropriate access or error screens.",
  "frontend/src/components/auth/RequireAuth.tsx": "Simple auth gate that requires user login before rendering children.",
  "frontend/src/components/contact/ContactPageFAQ.tsx": "FAQ section rendering a list of collapsible question‑answer items.",
  "frontend/src/components/dashboard/GuildOrdersPanel.tsx": "Displays guild orders with loading, error, empty, and populated states using data from a query.",
  "frontend/src/components/dashboard/InventoryPanel.tsx": "Manages cart display and checkout flow, combining cart items with product data and handling order creation.",
  "frontend/src/components/effects/FadeInSection.tsx": "Wraps content in a fade‑in effect triggered on scroll, respecting reduced‑motion settings.",
  "frontend/src/components/effects/FlipCard.tsx": "Provides an accessible flip‑card UI component with motion reduction support.",
  "frontend/src/components/effects/ParallaxLayer.tsx": "Applies a scroll‑based parallax transform to wrapped content unless reduced motion is preferred.",
  "frontend/src/components/home/Announcements.tsx": "Renders a static list of announcement cards with titles, dates, and descriptions.",
  "frontend/src/components/home/FeaturedCarousel.tsx": "Implements a simple carousel showcasing featured items with navigation controls.",
  "frontend/src/components/home/QuickLinksGrid.tsx": "Displays a grid of navigational cards linking to major site sections.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the global app layout with header, footer, background layers, and offline sync indicator.",
  "frontend/src/components/layout/Footer.tsx": "Renders site footer with quick links, legal info, branding, and external attribution.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides responsive site navigation with mobile menu, role‑based links, and login handling.",
  "frontend/src/components/layout/PageLayout.tsx": "Layout wrapper that renders optional title/description and child content with styling classes.",
  "frontend/src/components/services/ServiceDetailsAccordion.tsx": "Accordion component listing predefined service items with icons, summaries, details, and feature lists.",
  "frontend/src/components/shop/ProductDetailsModal.tsx": "Dialog modal displaying product details with actions to save items, add to cart, and show stock status.",
  "frontend/src/components/shop/useShopFilters.ts": "Hook that filters products by a search query using name and description matching.",
  "frontend/src/components/system/ErrorState.tsx": "Component showing an error or offline state with retry support and contextual messaging.",
  "frontend/src/components/system/OfflineSyncQueueDialog.tsx": "Dialog for viewing, retrying, and managing offline mutation queue entries with status indicators.",
  "frontend/src/components/system/OfflineSyncStatus.tsx": "Floating status UI showing real-time offline sync progress, errors, and queue access.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to identity changes and invalidates related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and status using Dfinity AuthClient.",
  "frontend/src/hooks/useInView.ts": "Hook using IntersectionObserver to track when an element enters the viewport, optionally only once.",
  "frontend/src/hooks/useLocalCart.ts": "Manages a local cart stored in localStorage with add, remove, update, and utility helpers.",
  "frontend/src/hooks/useOfflineDrafts.ts": "Stores and retrieves expiring offline form drafts in localStorage by form ID.",
  "frontend/src/hooks/useOfflineMutationReplay.ts": "Replays queued offline mutations when online, retrying certain errors and invalidating related queries.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects user preference for reduced motion via matchMedia.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, products, orders, and related actor calls.",
  "frontend/src/hooks/useQueuedMutations.ts": "Wraps mutations to enqueue them for offline execution when no actor is available, updating relevant queries on success.",
  "frontend/src/hooks/useRecentlyViewed.ts": "Manages a recently viewed products list in localStorage with add and clear functions.",
  "frontend/src/hooks/useSessionState.ts": "Custom React hook that persists state to localStorage with session IDs and 24‑hour expiry.",
  "frontend/src/index.css": "Global Tailwind-based theme and utility styles defining colors, typography, animations, and layout helpers.",
  "frontend/src/lib/localStorage.ts": "Utility for versioned, expiring, and safely-handled localStorage reads and writes.",
  "frontend/src/lib/offlineMutationQueue.ts": "Manages a versioned localStorage-backed queue for offline mutations with retry and failure tracking.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, InternetIdentity, and global styles.",
  "frontend/src/pages/About.tsx": "About page displaying mission, values, and team sections with animated cards and layout components.",
  "frontend/src/pages/Admin.tsx": "Admin panel page with tabbed navigation for managing products, orders, and users behind admin auth.",
  "frontend/src/pages/BlogLore.tsx": "Blog listing page rendering lore-themed posts with cards, metadata, and fade-in effects.",
  "frontend/src/pages/Contact.tsx": "Implements a contact form with local state, simulated submission, and UI components for sending messages. Includes layout, animations, and a FAQ section.",
  "frontend/src/pages/Dashboard.tsx": "Builds a user dashboard with tabs for profile, orders, saved items, cart, and quests, using various data-fetching hooks and conditional UI states. Handles identity checks, loading, errors, and product mapping.",
  "frontend/src/pages/FAQ.tsx": "Displays a searchable FAQ list using an accordion UI, filtering questions across categories. Uses layout and animation wrappers for presentation.",
  "frontend/src/pages/Homepage.tsx": "Renders the main landing page with a hero section, featured carousel, quick links, and feature highlights. Incorporates parallax effects and multiple custom components.",
  "frontend/src/pages/Privacy.tsx": "Shows a detailed privacy policy divided into sections with headings and separators. Presented within a card layout and fade-in animation.",
  "frontend/src/pages/Services.tsx": "Provides a services overview with an accordion for service details and a call‑to‑action for custom service inquiries. Uses structured layout and animations.",
  "frontend/src/pages/Shop.tsx": "Renders the shop page with product listing, filters, view modes, saved-state checks, and a modal for product details using data from queries.",
  "frontend/src/pages/Terms.tsx": "Displays static Terms of Service content inside a styled layout with sectioned text and separators.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, store, retrieve, and clear URL and session-based parameters, including hash-route support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, animations, colors, and plugins for the project's styling system.",
  "project_state.json": "Describes the project's phase, architecture plans, known issues, and existing feature definitions for ongoing development."
}