{
  "backend/main.mo": "Main Motoko canister defining admin access logic, data stores for users and artifacts, and type definitions for artifact search and metadata.",
  "feature_evidence.json": "Feature evidence report mapping features to frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries mapping numerous frontend source files to brief descriptions of their functionality.",
  "frontend/docs/data-architecture.md": "Documentation explaining frontend-visible auth, role model, first-admin bootstrap flow, and React Query–based data persistence.",
  "frontend/docs/design-direction.md": "Design guidelines detailing the application's dark fantasy theme, colors, typography, layout, and interaction styles.",
  "frontend/docs/local-storage-strategy.md": "Documentation of local storage categories, offline drafts, mutation queue behavior, and React Query invalidation strategy.",
  "frontend/docs/phase1-features-by-page.md": "Lists phase‑1 skeleton features and future enhancements for each site page including homepage, shop, dashboard, admin, and more.",
  "frontend/docs/phase1-planning.md": "Outlines overall project architecture, sitemap, navigation, access levels, and phase‑1 scope for the application.",
  "frontend/docs/phase6-qa-test-plan.md": "Provides manual QA test cases covering authentication, access control, and core user flows across devices and browsers.",
  "frontend/docs/phase7-iteration-playbook.md": "Describes the iteration workflow, offline‑first feedback system, admin review flow, and update checklist for feature development.",
  "frontend/docs/production-deployment.md": "Explains how to deploy the frontend and backend to production on IC or static hosts, including commands and environment variables.",
  "frontend/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes used throughout the frontend.",
  "frontend/index.html": "HTML entry point setting metadata, root container, and script loader for the React application.",
  "frontend/src/App.tsx": "Sets up the main React app with TanStack Router routes and React Query, loading many pages lazily.",
  "frontend/src/components/about/TeamSection.tsx": "Renders a team showcase with flip cards displaying member bios and expertise.",
  "frontend/src/components/about/TimelineSection.tsx": "Displays chronological company milestones using styled cards and a vertical timeline.",
  "frontend/src/components/admin/AdminAccessCodeSettingsSection.tsx": "Shows a placeholder card indicating admin access code settings are not yet implemented.",
  "frontend/src/components/admin/AdminAnalyticsTab.tsx": "Wraps and displays the analytics snapshot section for the admin panel.",
  "frontend/src/components/admin/AdminCouponsTab.tsx": "Implements full coupon management including creation, toggling, sending, and validation.",
  "frontend/src/components/admin/AdminFeedbackTab.tsx": "Displays a placeholder indicating feedback management is pending backend support.",
  "frontend/src/components/admin/AdminMessagingTab.tsx": "Allows admins to send messages to customers and view inbox items with validation and error handling.",
  "frontend/src/components/admin/AdminOrdersTab.tsx": "Shows a placeholder for order management features not yet implemented.",
  "frontend/src/components/admin/AdminOrderTrackingDetailModal.tsx": "Modal placeholder for order tracking management, awaiting backend implementation.",
  "frontend/src/components/admin/AdminPermissionGate.tsx": "Checks caller permissions and displays children or an access‑denied alert depending on permission state.",
  "frontend/src/components/admin/AdminProductsTab.tsx": "Placeholder product admin tab showing a notice that backend features are not yet implemented.",
  "frontend/src/components/admin/AdminRequestDetailModal.tsx": "Modal for viewing request details, currently showing a backend‑not‑implemented message.",
  "frontend/src/components/admin/AdminRequestsTab.tsx": "Displays a placeholder requests management section pending backend support.",
  "frontend/src/components/admin/AdminSystemSettingsTab.tsx": "Full system settings panel fetching various system logs, health data, and owner state with refresh actions.",
  "frontend/src/components/admin/AdminTestimoniesTab.tsx": "Placeholder testimonies management tab awaiting backend implementation.",
  "frontend/src/components/admin/AdminUsersTab.tsx": "Placeholder user management tab pending backend support.",
  "frontend/src/components/admin/BackupRecoverySection.tsx": "Backup and recovery UI allowing backup creation, restoration, metadata viewing, and refresh operations.",
  "frontend/src/components/admin/MessageAttachmentPicker.tsx": "Handles file selection, size validation, upload progress, and attachment management for messages.",
  "frontend/src/components/adminDashboard/AdminDashboardShell.tsx": "Layout shell containing top bar, sidebar, and main content area with mobile sidebar state handling.",
  "frontend/src/components/adminDashboard/AdminSidebarNav.tsx": "Admin dashboard sidebar with navigation items, mobile behavior, and logout handling.",
  "frontend/src/components/adminDashboard/AdminTopBar.tsx": "Top bar with mobile toggle, quick-create menu, notifications badge, and profile button.",
  "frontend/src/components/adminDashboard/views/AdminLoreKnowledgeView.tsx": "Admin view for managing lore and knowledge content with static info and a link to the public page.",
  "frontend/src/components/adminDashboard/views/DashboardHomeView.tsx": "Dashboard home showing basic stats, pending testimonies, and quick navigation actions.",
  "frontend/src/components/adminDashboard/views/PortfolioManagerView.tsx": "UI for uploading large portfolio files with title and description, pending backend integration.",
  "frontend/src/components/adminDashboard/views/SecuritySettingsView.tsx": "Placeholder security settings view noting required backend implementation.",
  "frontend/src/components/adminplus/AdminPasswordResetSection.tsx": "Placeholder section for admin password reset awaiting backend support.",
  "frontend/src/components/adminplus/AdminRegistrySection.tsx": "Placeholder admin registry section pending backend implementation.",
  "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx": "Placeholder for advanced shop controls requiring backend functionality.",
  "frontend/src/components/adminplus/AnalyticsSnapshotSection.tsx": "Placeholder analytics snapshot section with no backend yet.",
  "frontend/src/components/adminplus/CouponManagerSection.tsx": "Placeholder coupon manager section awaiting backend support.",
  "frontend/src/components/adminplus/PortfolioManagerSection.tsx": "Empty placeholder file for future portfolio manager section.",
  "frontend/src/components/adminplus/QuoteRequestManagerSection.tsx": "Empty placeholder file for future quote request manager section.",
  "frontend/src/components/adminplus/TestimonyManagerSection.tsx": "Empty placeholder file for future testimony manager section.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling authentication, session clearing, and error recovery.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Modal for collecting and saving user name and email during profile setup.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Protects admin routes by checking identity and user role, showing loading, login prompt, or access denied screens before rendering children.",
  "frontend/src/components/auth/RequireAdminAccessGate.tsx": "Validates a session-based admin access code and backend admin status, redirecting to the admin-access page when checks fail.",
  "frontend/src/components/auth/RequireAuth.tsx": "Blocks access until the user logs in with Internet Identity, showing a loading or login prompt when needed.",
  "frontend/src/components/auth/RequireOwner.tsx": "Restricts content to owner-level users by checking identity and ownership, displaying login or access-denied screens when necessary.",
  "frontend/src/components/contact/ContactPageFAQ.tsx": "Renders a styled accordion list of frequently asked questions about artifacts and services.",
  "frontend/src/components/dashboard/GuildOrdersPanel.tsx": "Empty placeholder file for a future guild orders dashboard panel.",
  "frontend/src/components/dashboard/InventoryPanel.tsx": "Empty placeholder file for a future inventory dashboard panel.",
  "frontend/src/components/dashboard/OrderTrackingPanel.tsx": "Displays detailed order tracking information including status, notes, location updates, and next steps in a styled card layout.",
  "frontend/src/components/effects/FadeInSection.tsx": "Applies a fade‑in animation when the section enters the viewport, respecting reduced‑motion preferences.",
  "frontend/src/components/effects/FlipCard.tsx": "Interactive flip card component toggling front/back content with click or keyboard input, supporting reduced‑motion mode.",
  "frontend/src/components/effects/ParallaxLayer.tsx": "Provides a parallax scrolling layer using requestAnimationFrame and reduced‑motion handling.",
  "frontend/src/components/feedback/FeedbackDialog.tsx": "Empty placeholder file for a feedback dialog component.",
  "frontend/src/components/feedback/FeedbackLauncher.tsx": "Empty placeholder file for a feedback launcher component.",
  "frontend/src/components/home/Announcements.tsx": "Shows a list of announcement cards with dates, badges, and descriptions for recent updates.",
  "frontend/src/components/home/FeaturedCarousel.tsx": "Carousel component cycling through featured items with navigation buttons and detail links.",
  "frontend/src/components/home/QuickLinksGrid.tsx": "Grid of quick navigation cards linking to main site sections with icons.",
  "frontend/src/components/intro/AboutIntro.tsx": "Intro section with title and description for the About page wrapped in a styled border.",
  "frontend/src/components/intro/AdminAccessIntro.tsx": "Simple intro block for the Admin Access page using a MysticalBorder wrapper.",
  "frontend/src/components/intro/ContactIntro.tsx": "Contact page intro with header and descriptive text inside a styled border.",
  "frontend/src/components/intro/FAQIntro.tsx": "Intro component presenting the FAQ page title and summary.",
  "frontend/src/components/intro/LoreKnowledgeIntro.tsx": "Intro section for the Lore and Knowledge page with themed description.",
  "frontend/src/components/intro/PortfolioIntro.tsx": "Portfolio page intro displaying a title and short description.",
  "frontend/src/components/intro/ServicesIntro.tsx": "Services page intro outlining available expert services.",
  "frontend/src/components/intro/ShopIntro.tsx": "Shop page intro inviting users to browse the collection.",
  "frontend/src/components/intro/SubmitRequestIntro.tsx": "Intro block for submitting custom project requests.",
  "frontend/src/components/intro/TestimoniesIntro.tsx": "Intro for the customer testimonies page with brief description.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with background, header, footer, quotes, and routed content.",
  "frontend/src/components/layout/Footer.tsx": "Footer with site description, navigation links, legal links, and attribution.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header navigation with links, cart indicator, identity checks, and admin access logic.",
  "frontend/src/components/layout/PageLayout.tsx": "Generic page wrapper providing optional title and description sections.",
  "frontend/src/components/MysticalBorder.tsx": "Provides a decorative container with animated glints and reduced‑motion support.",
  "frontend/src/components/portfolio/PortfolioDetailsModal.tsx": "Empty file placeholder for a portfolio details modal component.",
  "frontend/src/components/portfolio/PortfolioWidgetSection.tsx": "Empty file placeholder for a portfolio widget section component.",
  "frontend/src/components/quotes/RandomQuotes.tsx": "Displays 2–3 random quotes on each page using a card layout.",
  "frontend/src/components/requests/RequestMediaPicker.tsx": "Handles file selection, validation, preview creation, and upload progress tracking for images and videos in requests.",
  "frontend/src/components/services/ServiceDetailsAccordion.tsx": "Renders an accordion listing service offerings with icons, summaries, details, and feature lists.",
  "frontend/src/components/shop/ProductDetailsModal.tsx": "Displays a modal with full product details, pricing, availability, and add‑to‑cart controls.",
  "frontend/src/components/shop/ProductFlipCard.tsx": "Shows a flippable product card with image, price, availability, and a back side containing details and a view button.",
  "frontend/src/components/shop/ShopCartDrawer.tsx": "Placeholder shopping cart drawer displaying a notice that backend functionality is not yet implemented.",
  "frontend/src/components/shop/useShopFilters.ts": "Provides search, stock filtering, and sorting logic for product lists using React state and memoization.",
  "frontend/src/components/system/AnalyticsProvider.tsx": "Tracks initial and subsequent page views by subscribing to router navigation events.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "A top-level error boundary that logs errors and shows a recovery UI with reload and troubleshooting options.",
  "frontend/src/components/system/ErrorState.tsx": "Displays a styled error message with offline detection and an optional retry button.",
  "frontend/src/components/system/OfflineSyncQueueDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/system/OfflineSyncStatus.tsx": "Empty placeholder file.",
  "frontend/src/components/system/TroubleshootingDialog.tsx": "Displays and manages a local error log with options to view details and clear entries.",
  "frontend/src/components/testimonies/CreateTestimonyDialog.tsx": "Shows a simple dialog indicating that testimony submission is not yet implemented.",
  "frontend/src/components/testimonies/HalfStarRatingInput.tsx": "Provides an interactive star rating input supporting half-star precision with hover and click handling.",
  "frontend/src/components/testimonies/StarRating.tsx": "Renders a read‑only star rating display with support for half stars.",
  "frontend/src/components/testimonies/TestimoniesWidgetSection.tsx": "Empty component file with no implementation.",
  "frontend/src/components/testimonies/TestimonyMediaCard.tsx": "Shows an image or autoplaying video that flips to reveal a text description.",
  "frontend/src/components/testimonies/TestimonyMediaPicker.tsx": "Handles selecting, validating, previewing, and uploading photo/video media items for testimonies.",
  "frontend/src/components/testimonies/useHoverVideoPreview.ts": "Custom hook that plays or pauses a video when hovered, depending on flip state.",
  "frontend/src/data/quotes.ts": "Exports a list of predefined quotes used across the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to user identity and refreshes dependent queries.",
  "frontend/src/hooks/useAdminCoupons.ts": "Provides admin coupon CRUD hooks with placeholder backend calls and query invalidation.",
  "frontend/src/hooks/useAdminMessaging.ts": "Supplies hooks for fetching the admin inbox and sending admin messages using the actor.",
  "frontend/src/hooks/useAdminNotifications.ts": "Fetches admin notification counts from the backend with safe fallbacks on error.",
  "frontend/src/hooks/useBackupRecovery.ts": "Provides hooks to get backup metadata and trigger create or restore backup actions, invalidating related queries on success.",
  "frontend/src/hooks/useGlobalErrorCapture.ts": "Registers global listeners for runtime errors and unhandled promise rejections and logs sanitized error data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login flow and stored identities.",
  "frontend/src/hooks/useInView.ts": "Implements an IntersectionObserver-based hook to track when an element enters the viewport.",
  "frontend/src/hooks/useLocalCart.ts": "Manages a localStorage-backed shopping cart with add, remove, update, clear, and lookup utilities.",
  "frontend/src/hooks/useOfflineDrafts.ts": "Stores, loads, and expires form drafts in localStorage for offline persistence.",
  "frontend/src/hooks/useOfflineMutationReplay.ts": "Empty placeholder file for future offline mutation replay logic.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced-motion preference with compatibility for older browsers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, roles, permissions, admin checks, and various backend interactions.",
  "frontend/src/hooks/useQueuedMutations.ts": "Empty placeholder file for queued mutation handling.",
  "frontend/src/hooks/useRandomQuotes.ts": "Returns a stable set of random quotes per route, regenerating on navigation.",
  "frontend/src/hooks/useRecentlyViewed.ts": "Tracks and stores recently viewed products with expiration and max-length handling.",
  "frontend/src/hooks/useSearchArtifacts.ts": "Search hook returning placeholder empty results until backend search is implemented.",
  "frontend/src/hooks/useSessionState.ts": "React hook that persists component state to localStorage with a session ID and expiry.",
  "frontend/src/hooks/useSystemSettings.ts": "React Query hooks wrapping backend actor calls for health checks, logs, and system events.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining OKLCH-based themes, fonts, utilities, and animations.",
  "frontend/src/lib/adminAccessCode.ts": "Utilities for normalizing and validating admin access code format on the client.",
  "frontend/src/lib/adminAccessSession.ts": "Manages session-scoped admin access state using sessionStorage.",
  "frontend/src/lib/adminEntryLockout.ts": "Handles persistent admin lockout flags per principal using versioned localStorage entries.",
  "frontend/src/lib/analytics.ts": "Lightweight analytics supporting backend logging or Google Analytics with page and event tracking.",
  "frontend/src/lib/authorizationErrors.ts": "Maps backend authorization errors to user-friendly messages and identifies auth errors.",
  "frontend/src/lib/clientDetails.ts": "Collects browser user agent info and derives device type for logging and security.",
  "frontend/src/lib/errorLogging.ts": "Local error log storage with sanitization, size limits, and basic route capture.",
  "frontend/src/lib/localStorage.ts": "Centralized localStorage wrapper providing versioning, expiry, safe read/write, and cleanup utilities.",
  "frontend/src/lib/offlineMutationQueue.ts": "Implements a localStorage-backed queue for offline mutations with functions to add, update, and remove queued items.",
  "frontend/src/lib/randomQuotes.ts": "Provides a helper to randomly select 2–3 non-repeating quotes from a predefined list.",
  "frontend/src/lib/routePaths.ts": "Defines centralized route path constants and a union type for valid routes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/About.tsx": "Renders the About page with an intro and creator biography using styled layout and animated sections.",
  "frontend/src/pages/Admin.tsx": "Provides the admin dashboard with section navigation, access-granted messaging, and gated access control.",
  "frontend/src/pages/AdminAccess.tsx": "Handles admin access code submission, lockout logic, and redirects on successful authentication.",
  "frontend/src/pages/AdminPlus.tsx": "Owner-only Admin+ panel with advanced tools for analytics, shop controls, coupon management, admin registry, and password resets.",
  "frontend/src/pages/BlogLore.tsx": "Displays a lore-themed blog listing with categories, metadata, and intro section.",
  "frontend/src/pages/Contact.tsx": "Renders a contact page with a form, intro section, and FAQ, including simulated form submission and toast notifications.",
  "frontend/src/pages/Dashboard.tsx": "Displays a user dashboard with profile greeting and a placeholder for future order data.",
  "frontend/src/pages/FAQ.tsx": "Shows a searchable FAQ page with categorized questions, intro section, and accordion UI.",
  "frontend/src/pages/Homepage.tsx": "Implements the homepage with hero content, featured carousel, quick links, and promotional sections.",
  "frontend/src/pages/Inbox.tsx": "Provides an inbox page layout with a placeholder for future message functionality.",
  "frontend/src/pages/Portfolio.tsx": "Displays a portfolio page with category filters and placeholders for portfolio items.",
  "frontend/src/pages/Privacy.tsx": "Contains the privacy policy page with structured sections outlining data practices and user rights.",
  "frontend/src/pages/SearchArtifacts.tsx": "Implements a searchable and filterable artifact results page with query controls and result rendering hooks.",
  "frontend/src/pages/Services.tsx": "Displays an extensive services overview with themed sections describing available custom and magical item offerings.",
  "frontend/src/pages/Shop.tsx": "Provides a shop interface with search, view toggles, and an empty-state notice indicating products are not yet available.",
  "frontend/src/pages/SubmitRequest.tsx": "Shows a placeholder custom request form noting backend support is not yet implemented.",
  "frontend/src/pages/Terms.tsx": "Renders the Terms of Service page with multiple sections outlining usage, liability, and policies.",
  "frontend/src/pages/Testimonies.tsx": "Displays testimony introduction and a placeholder card indicating the feature awaits backend implementation.",
  "frontend/src/types/adminMessaging.ts": "Empty file reserved for future admin messaging type definitions.",
  "frontend/src/types/common.ts": "Defines common product-related types including visibility, availability, and product structure.",
  "frontend/src/types/orderTracking.ts": "Provides order tracking types, labels, helper functions, and structures for status history and fulfillment info.",
  "frontend/src/types/phase5a.ts": "Defines request and testimony types for Phase 5A, including media structures and pricing preferences.",
  "frontend/src/types/phase5b.ts": "Defines Phase 5B request, inbox, and attachment TypeScript interfaces and tagged union types.",
  "frontend/src/utils/mediaValidation.ts": "Provides file, description, and video validation utilities plus helper functions for formatting and type checks.",
  "frontend/src/utils/urlParams.ts": "Implements helpers to read, store, and clear URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, fonts, and plugins for the frontend.",
  "project_state.json": "Stores project state, scope notes, existing features, and new feature requests for navigation, shop, and admin updates."
}