{
  "backend/main.mo": "Main Motoko canister defining admin access control, storage mixins, and numerous domain maps and counters for users, products, orders, artifacts, and logs.",
  "feature_evidence.json": "Feature evidence report linking a Shop page announcement update to related files, components, and test requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries mapping various frontend source files to short descriptions of their functionality and purpose.",
  "frontend/docs/data-architecture.md": "Documentation explaining frontend-visible auth, role model, first-admin bootstrap, and React Query–based data persistence patterns.",
  "frontend/docs/design-direction.md": "Design guidelines detailing the dark fantasy theme, color palette, typography, spacing, UI components, and interaction styles.",
  "frontend/docs/local-storage-strategy.md": "Documentation outlining local storage categories, canister-backed data, offline queue behavior, and React Query invalidation strategy.",
  "frontend/docs/phase1-features-by-page.md": "Feature specification listing Phase 1 and future features for each site page, covering structure and planned functionality.",
  "frontend/docs/phase1-planning.md": "Defines the site's full page map, navigation, access levels, and phase‑1 architecture scope for the dark‑fantasy web app.",
  "frontend/docs/phase6-qa-test-plan.md": "Provides manual QA test cases covering authentication, role-based access, product browsing, and core flows across devices and browsers.",
  "frontend/docs/phase7-iteration-playbook.md": "Outlines the iteration workflow, offline-first feedback system, admin review flow, and technical hooks for queued mutations and drafts.",
  "frontend/docs/production-deployment.md": "Describes deployment steps for IC backend and frontend hosting, including environment variables, canister upgrades, and hosting options.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes used across the application.",
  "frontend/index.html": "HTML entry file setting up the SPA root and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Configures the React app router, lazy-loaded pages, query client, and route tree for all main site sections.",
  "frontend/src/components/about/TeamSection.tsx": "Renders a team section with flip cards showing member info on front and detailed bios on back.",
  "frontend/src/components/about/TimelineSection.tsx": "Displays a vertical timeline of company milestones using styled cards and icons.",
  "frontend/src/components/admin/AdminAccessCodeSettingsSection.tsx": "Provides a form to view the masked admin access code and update it with validation and mutation handling.",
  "frontend/src/components/admin/AdminAnalyticsTab.tsx": "Wraps and displays the analytics snapshot section for the admin dashboard.",
  "frontend/src/components/admin/AdminCouponsTab.tsx": "Manages coupons with create, toggle validity, send to customer, and refresh functionality using multiple mutations.",
  "frontend/src/components/admin/AdminFeedbackTab.tsx": "Shows user feedback with search and category filtering, handling loading and error states.",
  "frontend/src/components/admin/AdminMessagingTab.tsx": "Allows admins to send messages to customers and view inbox items with validation and refresh controls.",
  "frontend/src/components/admin/AdminOrdersTab.tsx": "Displays all orders with filtering and opens a tracking detail modal for selected orders.",
  "frontend/src/components/admin/AdminOrderTrackingDetailModal.tsx": "Modal for viewing and updating order tracking, including status changes, location updates, and pop-up notes using mutation hooks.",
  "frontend/src/components/admin/AdminPermissionGate.tsx": "Wraps admin content and checks caller permissions, showing loading or access-denied states when appropriate.",
  "frontend/src/components/admin/AdminProductsTab.tsx": "Shows product list with search filtering, stock/status badges, and an option to add products, handling loading and error states.",
  "frontend/src/components/admin/AdminRequestDetailModal.tsx": "Modal for reviewing and acting on a customer request, including approve, decline, messaging, coupon sending, and order conversion.",
  "frontend/src/components/admin/AdminRequestsTab.tsx": "Displays and filters custom requests, loads request details, and opens a modal for admin actions.",
  "frontend/src/components/admin/AdminSystemSettingsTab.tsx": "Renders the system settings admin page, fetching health, logs, events, and providing refresh controls and related admin sections.",
  "frontend/src/components/admin/AdminTestimoniesTab.tsx": "Displays, filters, and approves user testimonies with search and status indicators.",
  "frontend/src/components/admin/AdminUsersTab.tsx": "Lists and filters admin users, showing owner/permission badges and handling load/error states.",
  "frontend/src/components/admin/BackupRecoverySection.tsx": "Handles viewing backup metadata and creating or restoring system backups with confirmation flows.",
  "frontend/src/components/admin/MessageAttachmentPicker.tsx": "Manages file attachment uploads with progress tracking, validation, and removal for admin messages.",
  "frontend/src/components/adminDashboard/AdminDashboardShell.tsx": "Layout wrapper providing sidebar, top bar, and main content area for the admin dashboard.",
  "frontend/src/components/adminDashboard/AdminSidebarNav.tsx": "Sidebar navigation component listing admin dashboard sections with active state handling and logout logic.",
  "frontend/src/components/adminDashboard/AdminTopBar.tsx": "Top bar showing quick-create actions, notifications count, and profile button, using admin notification data.",
  "frontend/src/components/adminDashboard/views/DashboardHomeView.tsx": "Dashboard home displaying quick actions, product and testimony stats, and recent data with loading and error states.",
  "frontend/src/components/adminDashboard/views/PortfolioManagerView.tsx": "Portfolio uploader allowing image/video selection, validation, metadata entry, and mock upload workflow.",
  "frontend/src/components/adminDashboard/views/SecuritySettingsView.tsx": "Security settings UI for viewing masked access code, updating the admin access code, and reviewing access logs.",
  "frontend/src/components/adminplus/AdminPasswordResetSection.tsx": "Admin password reset tool validating principal IDs and submitting new passwords via mutation.",
  "frontend/src/components/adminplus/AdminRegistrySection.tsx": "Displays and manages admin accounts, including promotion, demotion, and permission toggles, with loading and error states.",
  "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx": "Provides controls for toggling shop availability, overriding product prices, and changing product visibility with related mutations.",
  "frontend/src/components/adminplus/AnalyticsSnapshotSection.tsx": "Fetches and displays analytics metrics such as orders and revenue with refresh functionality and loading states.",
  "frontend/src/components/adminplus/CouponManagerSection.tsx": "Allows enabling or disabling the global coupon system and shows status messages and explanations.",
  "frontend/src/components/adminplus/PortfolioManagerSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/adminplus/QuoteRequestManagerSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/adminplus/TestimonyManagerSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity with session clearing and login-state handling.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Profile setup modal allowing users to submit name and email before proceeding.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Gatekeeper component that checks authentication and admin role, showing appropriate access, loading, or denial states.",
  "frontend/src/components/auth/RequireAdminAccessGate.tsx": "Checks if admin access is unlocked and redirects to /admin-access if not.",
  "frontend/src/components/auth/RequireAuth.tsx": "Ensures the user is authenticated via Internet Identity, showing loading or login UI if needed.",
  "frontend/src/components/auth/RequireOwner.tsx": "Verifies the user is authenticated and is the system owner; otherwise shows loading, login, or access‑denied states.",
  "frontend/src/components/contact/ContactPageFAQ.tsx": "Renders an accordion FAQ section with predefined questions and answers.",
  "frontend/src/components/dashboard/GuildOrdersPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/dashboard/InventoryPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/dashboard/OrderTrackingPanel.tsx": "Displays detailed tracking info for an order, including status, notes, and location updates.",
  "frontend/src/components/effects/FadeInSection.tsx": "Applies a fade‑in animation when the section enters the viewport, respecting reduced‑motion settings.",
  "frontend/src/components/effects/FlipCard.tsx": "Interactive flip card component that toggles between front and back views with motion preferences.",
  "frontend/src/components/effects/ParallaxLayer.tsx": "Implements a scroll‑based parallax effect using requestAnimationFrame and reduced‑motion support.",
  "frontend/src/components/feedback/FeedbackDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/feedback/FeedbackLauncher.tsx": "Empty placeholder component file.",
  "frontend/src/components/home/Announcements.tsx": "Shows a list of recent announcements with badges, dates, and descriptions.",
  "frontend/src/components/home/FeaturedCarousel.tsx": "Carousel showcasing featured items with navigation and detail links.",
  "frontend/src/components/home/QuickLinksGrid.tsx": "Grid of quick‑access navigation cards linking to major site sections.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with background layers, header, footer, random quotes, routed content, and analytics provider.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with navigation links, branding, legal info, and a dynamic year and referral link.",
  "frontend/src/components/layout/HeaderNav.tsx": "Implements the responsive header navigation with authentication checks, admin lockout logic, and mobile menu handling.",
  "frontend/src/components/layout/PageLayout.tsx": "Provides a simple page wrapper that renders an optional title and description around page content.",
  "frontend/src/components/portfolio/PortfolioDetailsModal.tsx": "Empty file placeholder for a portfolio details modal component.",
  "frontend/src/components/portfolio/PortfolioWidgetSection.tsx": "Empty file placeholder for a portfolio widget section component.",
  "frontend/src/components/quotes/RandomQuotes.tsx": "Displays up to three random quotes using a custom hook and styled cards.",
  "frontend/src/components/requests/RequestMediaPicker.tsx": "Manages image/video uploads with validation, previews, progress tracking, and removal for request submissions.",
  "frontend/src/components/services/ServiceDetailsAccordion.tsx": "Renders an accordion listing predefined services with icons, summaries, and detailed feature descriptions.",
  "frontend/src/components/shop/ProductDetailsModal.tsx": "Shows a modal with product details, images, availability, pricing, and cart‑addition functionality.",
  "frontend/src/components/shop/ProductFlipCard.tsx": "Displays a front/back flip card for a product with image, pricing, availability, and a details button.",
  "frontend/src/components/shop/ShopCartDrawer.tsx": "Implements a sliding cart drawer with product listing, quantity updates, coupon validation, and checkout handling.",
  "frontend/src/components/shop/useShopFilters.ts": "Provides search, stock filtering, and sorting logic for a product list using React state and memoization.",
  "frontend/src/components/system/AnalyticsProvider.tsx": "Tracks page views on initial load and route changes using an analytics helper.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "Error boundary that logs errors locally and shows a recovery UI with reload and troubleshooting options.",
  "frontend/src/components/system/ErrorState.tsx": "Reusable error display component that detects offline errors and offers a retry action.",
  "frontend/src/components/system/OfflineSyncQueueDialog.tsx": "Empty placeholder file for an offline sync queue dialog.",
  "frontend/src/components/system/OfflineSyncStatus.tsx": "Empty placeholder file for an offline sync status component.",
  "frontend/src/components/system/TroubleshootingDialog.tsx": "Dialog that displays and clears locally stored error logs for debugging.",
  "frontend/src/components/testimonies/CreateTestimonyDialog.tsx": "Form dialog for submitting a testimony with rating, text, photos, and videos.",
  "frontend/src/components/testimonies/HalfStarRatingInput.tsx": "Interactive half-star rating input supporting hover previews and click-based half/full star selection.",
  "frontend/src/components/testimonies/StarRating.tsx": "Displays a static star rating with full and half-star rendering.",
  "frontend/src/components/testimonies/TestimoniesWidgetSection.tsx": "Empty file placeholder for a testimonies widget section component.",
  "frontend/src/components/testimonies/TestimonyMediaCard.tsx": "Flip card showing image/video on the front and description on the back, with hover video autoplay support.",
  "frontend/src/components/testimonies/TestimonyMediaPicker.tsx": "UI for selecting, validating, previewing, and uploading testimony photos and videos with progress tracking.",
  "frontend/src/components/testimonies/useHoverVideoPreview.ts": "Hook that auto-plays or pauses a video on hover based on state and feature flags.",
  "frontend/src/data/quotes.ts": "Exports a list of predefined creative quotes for random display across pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminCoupons.ts": "React Query hooks for listing, creating, toggling, and sending admin coupons using the backend actor.",
  "frontend/src/hooks/useAdminMessaging.ts": "React Query hooks for fetching admin inbox items and sending admin messages via the backend actor.",
  "frontend/src/hooks/useAdminNotifications.ts": "Fetches admin notification counts from the backend with periodic refetching and error fallback.",
  "frontend/src/hooks/useBackupRecovery.ts": "Hooks to fetch backup metadata and trigger backup creation or restoration using backend APIs.",
  "frontend/src/hooks/useGlobalErrorCapture.ts": "Registers global handlers to log runtime errors and unhandled promise rejections.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status states using Dfinity AuthClient.",
  "frontend/src/hooks/useInView.ts": "IntersectionObserver hook that reports when an element enters the viewport, with configurable options.",
  "frontend/src/hooks/useLocalCart.ts": "Implements a localStorage-backed shopping cart with item add, remove, update, and quantity helpers.",
  "frontend/src/hooks/useOfflineDrafts.ts": "Manages per-form offline drafts with expiration, supporting load, save, get, and clear operations in localStorage.",
  "frontend/src/hooks/useOfflineMutationReplay.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline state using window events and returns current connectivity status.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced-motion preference with cross-browser MediaQuery API support.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous React Query hooks for fetching and mutating user profiles, roles, permissions, admin access, and other backend-driven data.",
  "frontend/src/hooks/useQueuedMutations.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useRandomQuotes.ts": "Returns 2–3 random quotes that update when the route changes.",
  "frontend/src/hooks/useRecentlyViewed.ts": "Stores and retrieves recently viewed products in localStorage with expiration and list size limits.",
  "frontend/src/hooks/useSearchArtifacts.ts": "Provides a search hook for artifacts; currently calls an unimplemented backend search and returns an empty array.",
  "frontend/src/hooks/useSessionState.ts": "Maintains session-scoped state persisted in localStorage with auto-expiring session IDs.",
  "frontend/src/hooks/useSystemSettings.ts": "Fetches system-level admin data such as health checks, access logs, login attempts, events, and audit logs via React Query.",
  "frontend/src/index.css": "Defines global styles, theme variables, and utility classes using Tailwind and OKLCH colors.",
  "frontend/src/lib/adminAccessSession.ts": "Manages session-scoped admin access state using sessionStorage with helpers to check, set, and clear the flag.",
  "frontend/src/lib/adminEntryLockout.ts": "Implements persistent principal-based admin lockout using versioned localStorage utilities.",
  "frontend/src/lib/analytics.ts": "Provides analytics initialization and event tracking with support for first-party backend logging or Google Analytics.",
  "frontend/src/lib/authorizationErrors.ts": "Normalizes authorization-related errors into user-friendly messages and detects common authorization failures.",
  "frontend/src/lib/clientDetails.ts": "Extracts browser user-agent details and classifies device type for logging and security purposes.",
  "frontend/src/lib/errorLogging.ts": "Implements local error logging with sanitization, size limits, and utilities for reading, writing, and clearing logs.",
  "frontend/src/lib/localStorage.ts": "Provides safe, versioned localStorage access with expiry handling and cleanup utilities.",
  "frontend/src/lib/offlineMutationQueue.ts": "Manages a versioned queue of offline mutations with enqueueing, retry tracking, failure marking, and clearing.",
  "frontend/src/lib/randomQuotes.ts": "Selects 2–3 unique random quotes from a predefined list.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers, then renders the root component.",
  "frontend/src/pages/About.tsx": "Renders an About page with animated sections describing the creator's background, mission, and vision using PageLayout and card components.",
  "frontend/src/pages/Admin.tsx": "Implements the main admin dashboard with section switching and access gates for authorized admin users.",
  "frontend/src/pages/AdminAccess.tsx": "Handles admin access code entry, authentication state, lockout logic, and redirects to the admin dashboard on success.",
  "frontend/src/pages/AdminPlus.tsx": "Provides an owner-only advanced admin panel with analytics, shop controls, coupon management, admin registry, and password reset sections.",
  "frontend/src/pages/BlogLore.tsx": "Displays a list of lore-themed blog posts in card format with category badges, dates, and read-time info.",
  "frontend/src/pages/Contact.tsx": "Offers a contact form with validation, simulated submission, and additional contact/FAQ info within a two-column layout.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page that loads user profile, orders, and products, handles profile setup, and displays order tracking.",
  "frontend/src/pages/FAQ.tsx": "FAQ page with searchable accordion-based questions grouped by category.",
  "frontend/src/pages/Homepage.tsx": "Homepage with hero section, featured carousel, quick links, and feature highlights.",
  "frontend/src/pages/Inbox.tsx": "Inbox page that lists customer messages, supports marking as read, refreshing, and error/loading states.",
  "frontend/src/pages/Portfolio.tsx": "Portfolio page with category filters and placeholder portfolio grid pending backend data integration.",
  "frontend/src/pages/Privacy.tsx": "Static privacy policy page outlining data collection, usage, security, and user rights.",
  "frontend/src/pages/SearchArtifacts.tsx": "Provides a searchable and filterable UI for artifacts, handling queries, categories, and rendering results with loading and error states.",
  "frontend/src/pages/Services.tsx": "Displays available services using an accordion and offers links to submit custom requests or contact the team.",
  "frontend/src/pages/Shop.tsx": "Renders the shop interface with product listing, filtering, cart handling, and shop availability states.",
  "frontend/src/pages/SubmitRequest.tsx": "Implements a form for authenticated users to submit custom project requests including text fields and media attachments.",
  "frontend/src/pages/Terms.tsx": "Shows the Terms of Service content within a styled layout with sectioned legal information.",
  "frontend/src/pages/Testimonies.tsx": "Displays customer testimonies with rating visuals and allows authenticated users to create new testimonies.",
  "frontend/src/types/adminMessaging.ts": "Empty placeholder file for admin messaging types.",
  "frontend/src/types/common.ts": "Defines shared frontend types for products, availability, visibility states, and external blob references.",
  "frontend/src/types/orderTracking.ts": "Defines order tracking types, status labels/order, fulfillment methods, and helper functions for next status and timestamp formatting.",
  "frontend/src/types/phase5a.ts": "Provides request and testimony types with media handling and pricing preferences for Phase 5A.",
  "frontend/src/types/phase5b.ts": "Defines request detail/summary, inbox item types, attachments, actions, and statuses for Phase 5B.",
  "frontend/src/utils/mediaValidation.ts": "Implements file size, description, and video duration validation plus helpers for formatting and media type checks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and utilities used across the frontend.",
  "project_state.json": "Describes current project state and requirements for adding a styled announcement to the Shop page."
}