{
  "backend/main.mo": "Main canister actor implementing health checks, access control mixins, event logging, and phase‑1 feature and data models.",
  "backend/migration.mo": "Migration module converting old product and testimony records into updated structures with new fields and defaults.",
  "feature_evidence.json": "Feature evidence report mapping features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of concise summaries for numerous frontend files used in the project.",
  "frontend/docs/data-architecture.md": "Documentation of authentication, role model, and frontend data persistence strategy including admin bootstrap and React Query usage.",
  "frontend/docs/design-direction.md": "Design specification detailing the dark fantasy theme, palettes, typography, spacing, and component styling.",
  "frontend/docs/local-storage-strategy.md": "Documentation of local storage categories, offline behavior, React Query caching, and data consistency rules.",
  "frontend/docs/phase1-features-by-page.md": "Lists Phase 1 skeleton features and future enhancements for each site page.",
  "frontend/docs/phase1-planning.md": "Outlines project architecture, sitemap, access levels, and Phase 1 scope.",
  "frontend/docs/phase6-qa-test-plan.md": "Provides manual QA test cases for authentication, access control, and shop flows.",
  "frontend/docs/phase7-iteration-playbook.md": "Describes the feedback workflow, offline-first mechanics, and iteration process.",
  "frontend/docs/production-deployment.md": "Explains deployment steps for backend and frontend on IC or external hosts.",
  "frontend/index.css": "Defines Tailwind CSS layers and theme variables for light/dark modes.",
  "frontend/index.html": "Base HTML template loading the SPA root and main script with metadata.",
  "frontend/src/App.tsx": "Sets up the main React app with routing, lazy‑loaded pages, analytics init, global providers, and a fallback skeleton for page loading.",
  "frontend/src/components/about/TeamSection.tsx": "Renders a team showcase using flip cards that display member profiles and expertise on hover.",
  "frontend/src/components/about/TimelineSection.tsx": "Displays a vertical timeline of company milestones with styled cards and decorative markers.",
  "frontend/src/components/admin/AdminFeedbackTab.tsx": "Fetches, filters, and displays user feedback with category detection, search tools, and status badges.",
  "frontend/src/components/admin/AdminOrdersTab.tsx": "Loads and filters orders by ID and principal, showing counts and conditional empty states.",
  "frontend/src/components/admin/AdminProductsTab.tsx": "Provides product management tools including creation, editing, stock updates, image handling, and form validation.",
  "frontend/src/components/admin/AdminTestimoniesTab.tsx": "Displays pending and approved testimonies with loading and error states, and allows admins to remove testimonies via a confirmation dialog.",
  "frontend/src/components/admin/AdminUsersTab.tsx": "Provides forms to grant or revoke admin roles using Principal IDs with validation, mutation handling, and feedback messages.",
  "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/adminplus/CouponManagerSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/adminplus/PortfolioManagerSection.tsx": "Manages creation and editing of portfolios with category selection, artwork ID input, and backend mutations.",
  "frontend/src/components/adminplus/QuoteRequestManagerSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/adminplus/TestimonyManagerSection.tsx": "Allows creating and editing approved testimonies, including author, content, rating, and approval status.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles login/logout with Internet Identity, clears cached data on logout, and shows status indicators.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Prompts new users to enter name and email, saving the profile before proceeding.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Gates admin-only content by checking authentication and user role, showing appropriate access or error screens.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and enforces user authentication, showing a login prompt or loading state if needed.",
  "frontend/src/components/auth/RequireOwner.tsx": "Restricts access to owner‑only areas by checking identity and ownership, showing loading, login, or denial states.",
  "frontend/src/components/contact/ContactPageFAQ.tsx": "Renders an accordion-based FAQ list for common customer questions.",
  "frontend/src/components/dashboard/GuildOrdersPanel.tsx": "Displays guild orders with loading, error, empty, and populated states, including order status and rewards.",
  "frontend/src/components/dashboard/InventoryPanel.tsx": "Manages and displays the shopping cart, including product mapping, totals, and checkout handling.",
  "frontend/src/components/effects/FadeInSection.tsx": "Applies a fade‑in animation when the section enters the viewport, respecting reduced‑motion preferences.",
  "frontend/src/components/effects/FlipCard.tsx": "Interactive flip card component toggling front/back content with accessibility and reduced‑motion support.",
  "frontend/src/components/effects/ParallaxLayer.tsx": "Creates a scroll‑based parallax effect using requestAnimationFrame with reduced‑motion handling.",
  "frontend/src/components/feedback/FeedbackDialog.tsx": "Feedback submission dialog with drafting, validation, identity checks, and offline‑queueing support.",
  "frontend/src/components/feedback/FeedbackLauncher.tsx": "A button that opens the feedback dialog for submitting user feedback.",
  "frontend/src/components/home/Announcements.tsx": "Renders a list of announcement cards with title, date, badge, and description.",
  "frontend/src/components/home/FeaturedCarousel.tsx": "Implements a carousel that cycles through featured items with navigation controls and detail links.",
  "frontend/src/components/home/QuickLinksGrid.tsx": "Displays a grid of quick‑access link cards with icons, titles, and descriptions.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with background, header, footer, quotes, outlet content, sync status, and analytics.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with info sections, navigation links, legal links, and a credits bar.",
  "frontend/src/components/layout/HeaderNav.tsx": "Creates the responsive header navigation with links, mobile menu, identity checks, and admin access.",
  "frontend/src/components/layout/PageLayout.tsx": "Provides a simple page wrapper that optionally displays a page title and description.",
  "frontend/src/components/portfolio/PortfolioDetailsModal.tsx": "Shows a modal with detailed portfolio info including category, description, and artwork list.",
  "frontend/src/components/portfolio/PortfolioWidgetSection.tsx": "Displays a preview grid of portfolios with category badges and a link to the full portfolio page.",
  "frontend/src/components/quotes/RandomQuotes.tsx": "Displays 2–3 randomly selected quotes using a custom hook and renders them in styled cards.",
  "frontend/src/components/services/ServiceDetailsAccordion.tsx": "Renders an accordion listing service offerings with icons, summaries, and detailed feature lists.",
  "frontend/src/components/shop/ProductDetailsModal.tsx": "Shows a modal with full product details, save/remove logic, add‑to‑cart actions, and availability info.",
  "frontend/src/components/shop/ProductFlipCard.tsx": "Provides a flip‑card UI for products, showing basic info on the front and availability plus actions on the back.",
  "frontend/src/components/shop/ShopCartDrawer.tsx": "Implements a cart sidebar with product syncing, coupon validation, quantity controls, and checkout handling.",
  "frontend/src/components/shop/useShopFilters.ts": "Custom hook that filters and sorts products based on search text, stock status, and sort options.",
  "frontend/src/components/system/AnalyticsProvider.tsx": "Tracks initial and subsequent page views by subscribing to router navigation events.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "A top-level error boundary that logs errors, displays a recovery UI, and allows reload or troubleshooting.",
  "frontend/src/components/system/ErrorState.tsx": "Renders an error alert that distinguishes offline vs generic errors and offers an optional retry button.",
  "frontend/src/components/system/OfflineSyncQueueDialog.tsx": "UI dialog for viewing, retrying, and managing queued offline mutations with status badges and confirmation prompts.",
  "frontend/src/components/system/OfflineSyncStatus.tsx": "Floating status widget showing sync progress, errors, and access to the offline queue dialog.",
  "frontend/src/components/system/TroubleshootingDialog.tsx": "Dialog that displays and clears locally stored error logs with timestamps and optional stack traces.",
  "frontend/src/components/testimonies/CreateTestimonyDialog.tsx": "Form dialog for submitting a testimony with rating, text, and optional photo/video upload.",
  "frontend/src/components/testimonies/StarRating.tsx": "Displays a star-based rating visualization with clamped values.",
  "frontend/src/components/testimonies/TestimoniesWidgetSection.tsx": "Home-page section showing a preview of approved testimonies with ratings and link to full list.",
  "frontend/src/data/quotes.ts": "Exports a static list of themed quotes used throughout the app.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor, updating when identity changes.",
  "frontend/src/hooks/useGlobalErrorCapture.ts": "Registers global handlers to log runtime errors and unhandled promise rejections locally.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity auth, managing identity loading, login, logout, and status handling.",
  "frontend/src/hooks/useInView.ts": "Hook using IntersectionObserver to detect when an element enters view, optionally triggering once.",
  "frontend/src/hooks/useLocalCart.ts": "Manages a shopping cart in localStorage with add, remove, update, clear, and summary utilities.",
  "frontend/src/hooks/useOfflineDrafts.ts": "Stores, retrieves, expires, and clears form drafts in localStorage keyed by form ID.",
  "frontend/src/hooks/useOfflineMutationReplay.ts": "Replays queued offline actor mutations when back online, updating status and retry counts.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status via window events.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced-motion preference with cross-browser media query handling.",
  "frontend/src/hooks/useQueries.ts": "Wraps actor calls in React Query for profiles, roles, products, orders, and related mutations.",
  "frontend/src/hooks/useQueuedMutations.ts": "Queues mutations for offline use and syncs them when the actor is available.",
  "frontend/src/hooks/useRandomQuotes.ts": "Returns stable random quotes per route, updating when the pathname changes.",
  "frontend/src/hooks/useRecentlyViewed.ts": "React hook managing a capped, expiring list of recently viewed products stored in localStorage with add and clear helpers.",
  "frontend/src/hooks/useSessionState.ts": "Hook persisting state per session in localStorage with automatic session ID generation and expiry.",
  "frontend/src/index.css": "Global Tailwind-based styles defining OKLCH color themes, fonts, animations, and utility rules for light/dark modes.",
  "frontend/src/lib/analytics.ts": "Lightweight analytics module supporting first‑party logging or Google Analytics injection and event/pageview tracking.",
  "frontend/src/lib/errorLogging.ts": "Local error logging utilities that read, write, sanitize, and clear error entries stored in localStorage.",
  "frontend/src/lib/localStorage.ts": "Safe localStorage wrapper with versioning, expiry handling, quota fallback, and helpers for clearing stored items.",
  "frontend/src/lib/offlineMutationQueue.ts": "Offline queue for pending backend mutations with enqueue, update, failure marking, and clearing operations in localStorage.",
  "frontend/src/lib/randomQuotes.ts": "Utility selecting 2–3 unique random quotes from a predefined list.",
  "frontend/src/main.tsx": "App entry point initializing React Query, Internet Identity, global CSS, and rendering the root App component.",
  "frontend/src/pages/About.tsx": "Renders an About page with animated sections describing the creator, including mission and vision cards.",
  "frontend/src/pages/Admin.tsx": "Provides an admin panel with tabs for managing products, orders, users, feedback, and testimonies.",
  "frontend/src/pages/AdminPlus.tsx": "Defines an owner‑restricted admin panel for managing portfolios and testimonies.",
  "frontend/src/pages/BlogLore.tsx": "Displays a grid of lore‑themed blog posts with category badges, dates, and excerpts.",
  "frontend/src/pages/Contact.tsx": "Implements a contact form with validation, submission handling, and an FAQ section.",
  "frontend/src/pages/Dashboard.tsx": "Shows a user dashboard with tabs for profile, orders, saved artifacts, cart, and quests using multiple data queries.",
  "frontend/src/pages/FAQ.tsx": "Provides a searchable FAQ page with categorized accordion questions and answers.",
  "frontend/src/pages/Homepage.tsx": "Renders the homepage with a hero section, featured carousel, quick links, portfolio and testimony widgets, and feature cards using animated sections.",
  "frontend/src/pages/Portfolio.tsx": "Displays filterable portfolio items with category buttons, loading states, error handling, and a modal for item details.",
  "frontend/src/pages/Privacy.tsx": "Shows the privacy policy content in a styled card with sectioned descriptions of data practices.",
  "frontend/src/pages/Services.tsx": "Presents service details via an accordion, followed by portfolio and testimony widgets and a call‑to‑action for custom services.",
  "frontend/src/pages/Shop.tsx": "Implements the shop page with search, filters, cart drawer, product listing, saved items, and product detail modal handling.",
  "frontend/src/pages/Terms.tsx": "Displays the terms of service in a structured card with multiple policy sections.",
  "frontend/src/pages/Testimonies.tsx": "Renders the testimonies page, loading approved testimonies, handling errors, and providing UI for creating and displaying testimony cards with media and ratings.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, fonts, and plugins for the frontend project.",
  "project_state.json": "Defines the project’s current phase, features, requirements, and state metadata for planning and tracking."
}