{
  "backend/main.mo": "Main actor defines admin code, authorization mixins, and extensive canister state maps for users, products, orders, artifacts, and related entities. It initializes counters, configuration, and types for artifact search, sorting, and visibility.",
  "backend/migration.mo": "Migration module adds the new adminAccessCode field with default value while preserving the remaining actor state. It transforms old actor state into the new schema.",
  "feature_evidence.json": "Feature evidence report linking a new admin access code settings feature to specific frontend components, dependencies, and test IDs. Confirms high-confidence implementation coverage.",
  "frontend-file-summaries.txt": "List of autogenerated summaries describing frontend components, hooks, pages, styles, and docs across the project. Provides quick reference for each file’s purpose and behavior.",
  "frontend/docs/data-architecture.md": "Documentation describing authentication, role model, first-admin bootstrap, and React Query–based data consistency. Explains how the frontend interacts with backend roles and persisted data.",
  "frontend/docs/design-direction.md": "Design specification outlining the dark fantasy visual theme, color palette, typography, spacing, interactions, and component styling. Serves as the aesthetic and UI guideline for the project.",
  "frontend/docs/local-storage-strategy.md": "Explains the browser storage strategy separating local-only caches from canister-backed data. Details offline drafts, mutation queue behavior, and React Query invalidation rules.",
  "frontend/docs/phase1-features-by-page.md": "Feature specification listing Phase 1 and future enhancements for each major page. Provides planned functionality and UI expectations for the initial release.",
  "frontend/docs/phase1-planning.md": "Outlines the overall site architecture, page list, navigation structure, and access-level features for Phase 1 of the project. Defines public, user, and admin pages plus high‑level goals for initial implementation.",
  "frontend/docs/phase6-qa-test-plan.md": "Provides comprehensive manual QA test cases for authentication, role-based access, and shop interactions across multiple devices and browsers. Details expected results and steps for guest, user, and admin scenarios.",
  "frontend/docs/phase7-iteration-playbook.md": "Describes the workflow for feedback collection, offline-first persistence, and iterative updates in Phase 7. Covers feedback components, queued mutations, admin review tools, and a checklist for feature iteration.",
  "frontend/docs/production-deployment.md": "Explains how to deploy the frontend and backend to production on the Internet Computer or static hosts. Includes build steps, environment variables, canister deployment, and upgrade instructions.",
  "frontend/index.css": "Defines Tailwind CSS layers and theme variables for light and dark modes. Sets global color tokens and base styles for the application.",
  "frontend/index.html": "Base HTML template for the React app with metadata, root mount element, and script loading the main client bundle.",
  "frontend/src/App.tsx": "Sets up the application's router, query client, layout, and lazy‑loaded page routes. Defines all primary routes including public, dashboard, admin, and utility pages.",
  "frontend/src/components/about/TeamSection.tsx": "Displays a grid of flip cards showing team members with names, roles, bios, and expertise.",
  "frontend/src/components/about/TimelineSection.tsx": "Renders a vertical timeline of company milestones with years, titles, and descriptions.",
  "frontend/src/components/admin/AdminAccessCodeSettingsSection.tsx": "Form for updating the master admin access code with validation, mutation handling, and success/error alerts.",
  "frontend/src/components/admin/AdminAnalyticsTab.tsx": "Simple wrapper that displays the analytics snapshot section.",
  "frontend/src/components/admin/AdminCouponsTab.tsx": "Manages coupon creation, validity toggling, and sending coupons to customers with validation and API mutations.",
  "frontend/src/components/admin/AdminFeedbackTab.tsx": "Displays user feedback with search and category filtering plus loading and error handling states.",
  "frontend/src/components/admin/AdminMessagingTab.tsx": "Allows admins to send messages to customers and view inbox items with validation and refresh support.",
  "frontend/src/components/admin/AdminOrdersTab.tsx": "Displays all orders with filtering and opens a tracking detail modal for selected orders.",
  "frontend/src/components/admin/AdminOrderTrackingDetailModal.tsx": "Modal for viewing and updating order tracking, allowing admins to change status, add location updates, and add notes.",
  "frontend/src/components/admin/AdminPermissionGate.tsx": "Checks caller permissions and conditionally renders children or an access‑denied alert.",
  "frontend/src/components/admin/AdminProductsTab.tsx": "Lists products with search filtering and supports viewing, adding, and basic product status display.",
  "frontend/src/components/admin/AdminRequestDetailModal.tsx": "Modal for reviewing a customer request and performing actions like approve, decline, messaging, coupons, or converting to an order.",
  "frontend/src/components/admin/AdminRequestsTab.tsx": "Shows all customer requests with search filtering and opens a detail modal to view individual request data.",
  "frontend/src/components/admin/AdminSystemSettingsTab.tsx": "Renders the main admin system settings tab, fetching and refreshing health checks, logs, events, and owner status while assembling multiple admin-related sections.",
  "frontend/src/components/admin/AdminTestimoniesTab.tsx": "Displays and filters user testimonies with approval actions and support for search, rating, media indicators, and mutation handling.",
  "frontend/src/components/admin/AdminUsersTab.tsx": "Shows registered admins with filtering by principal, owner/full-permission badges, and error/loading states.",
  "frontend/src/components/admin/BackupRecoverySection.tsx": "Handles viewing backup metadata and performing backup creation and restoration with confirmation dialogs and status feedback.",
  "frontend/src/components/admin/MessageAttachmentPicker.tsx": "Provides file attachment uploading with progress tracking, size validation, and integration into message attachment state.",
  "frontend/src/components/adminplus/AdminPasswordResetSection.tsx": "UI for validating a principal and submitting a new admin password via mutation with error handling and form validation.",
  "frontend/src/components/adminplus/AdminRegistrySection.tsx": "Admin list management UI enabling promotion, demotion, and permission toggling with loading and error states.",
  "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx": "Provides controls for toggling shop availability, overriding product prices, and changing product visibility.",
  "frontend/src/components/adminplus/AnalyticsSnapshotSection.tsx": "Displays analytics snapshot including orders and revenue with refresh and loading/error handling.",
  "frontend/src/components/adminplus/CouponManagerSection.tsx": "Global switch to enable or disable coupons with status display and explanatory info.",
  "frontend/src/components/adminplus/PortfolioManagerSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/adminplus/QuoteRequestManagerSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/adminplus/TestimonyManagerSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication with session clearing and status handling.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Form component for entering and saving user name and email, then triggering completion.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Gatekeeper that checks login and admin role, showing appropriate messages or children.",
  "frontend/src/components/auth/RequireAdminAccessGate.tsx": "Redirects admins without an unlocked access session to the admin-access page.",
  "frontend/src/components/auth/RequireAuth.tsx": "Checks for authenticated identity and prompts login if missing.",
  "frontend/src/components/auth/RequireOwner.tsx": "Validates caller ownership and renders children or access-denied/login prompts.",
  "frontend/src/components/contact/ContactPageFAQ.tsx": "Renders a FAQ accordion with common customer questions and answers.",
  "frontend/src/components/dashboard/GuildOrdersPanel.tsx": "Empty file placeholder for guild orders panel.",
  "frontend/src/components/dashboard/InventoryPanel.tsx": "Empty file placeholder for inventory panel.",
  "frontend/src/components/dashboard/OrderTrackingPanel.tsx": "Displays order tracking details including status, notes, and location updates.",
  "frontend/src/components/effects/FadeInSection.tsx": "Wrapper that fades in children when scrolled into view with reduced-motion support.",
  "frontend/src/components/effects/FlipCard.tsx": "Interactive flip card component with accessibility and reduced-motion handling.",
  "frontend/src/components/effects/ParallaxLayer.tsx": "Applies a parallax scroll effect to wrapped content with reduced-motion fallback.",
  "frontend/src/components/feedback/FeedbackDialog.tsx": "Empty file placeholder for feedback dialog.",
  "frontend/src/components/feedback/FeedbackLauncher.tsx": "Empty file placeholder for feedback launcher.",
  "frontend/src/components/home/Announcements.tsx": "Renders a list of announcement cards with titles, descriptions, and badges.",
  "frontend/src/components/home/FeaturedCarousel.tsx": "Carousel component cycling through featured items with navigation buttons and indicators.",
  "frontend/src/components/home/QuickLinksGrid.tsx": "Grid of cards linking to key site pages, each with an icon, title, and description.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout including background layers, header, footer, quotes, routed content, and analytics.",
  "frontend/src/components/layout/Footer.tsx": "Footer with site summary, link sections, legal links, and a credits bar.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive navigation bar with links, authentication-aware actions, and a mobile menu.",
  "frontend/src/components/layout/PageLayout.tsx": "Simple wrapper providing page-level title, description, and layout structure.",
  "frontend/src/components/portfolio/PortfolioDetailsModal.tsx": "Empty placeholder file for portfolio details modal.",
  "frontend/src/components/portfolio/PortfolioWidgetSection.tsx": "Empty placeholder file for portfolio widget section.",
  "frontend/src/components/quotes/RandomQuotes.tsx": "Displays a small set of random quotes in styled cards on each page load.",
  "frontend/src/components/requests/RequestMediaPicker.tsx": "Media picker allowing image/video uploads with validation, previews, removal, and upload progress.",
  "frontend/src/components/services/ServiceDetailsAccordion.tsx": "Renders an accordion listing service offerings with icons, summaries, and detailed feature lists.",
  "frontend/src/components/shop/ProductDetailsModal.tsx": "Displays a modal with product information, pricing, stock status, availability, and add‑to‑cart functionality.",
  "frontend/src/components/shop/ProductFlipCard.tsx": "Shows a flip-card product preview with pricing, stock status, availability, and a button to view details.",
  "frontend/src/components/shop/ShopCartDrawer.tsx": "Implements a slide-out cart drawer with product listing, quantity controls, coupon validation, and checkout handling.",
  "frontend/src/components/shop/useShopFilters.ts": "Provides filtering and sorting logic for product lists based on search, stock, and sort settings.",
  "frontend/src/components/system/AnalyticsProvider.tsx": "Tracks initial and subsequent page views using router navigation events and an analytics utility.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "Top-level error boundary that logs errors and displays a recovery UI with reload and troubleshooting options.",
  "frontend/src/components/system/ErrorState.tsx": "Shows a standardized error alert with offline detection and optional retry handling.",
  "frontend/src/components/system/OfflineSyncQueueDialog.tsx": "Empty file with no implemented content.",
  "frontend/src/components/system/OfflineSyncStatus.tsx": "Empty file with no implemented content.",
  "frontend/src/components/system/TroubleshootingDialog.tsx": "Displays a dialog showing locally stored error logs with stack traces and lets users clear the log.",
  "frontend/src/components/testimonies/CreateTestimonyDialog.tsx": "Dialog for submitting a testimony with rating, description, photos, and videos, including validation and form reset.",
  "frontend/src/components/testimonies/HalfStarRatingInput.tsx": "Interactive half‑star rating input component supporting hover and click selection.",
  "frontend/src/components/testimonies/StarRating.tsx": "Read‑only star rating display supporting half stars.",
  "frontend/src/components/testimonies/TestimoniesWidgetSection.tsx": "Empty file placeholder for testimonies widget section.",
  "frontend/src/components/testimonies/TestimonyMediaCard.tsx": "Flippable media card that previews images or auto‑plays videos and shows a description on flip.",
  "frontend/src/components/testimonies/TestimonyMediaPicker.tsx": "Media picker allowing photo and video uploads with validation, previews, and upload progress tracking.",
  "frontend/src/components/testimonies/useHoverVideoPreview.ts": "Hook that auto‑plays or pauses a video element based on hover and flip state.",
  "frontend/src/data/quotes.ts": "Exports a list of predefined quotes displayed randomly across pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminCoupons.ts": "Provides React Query hooks for fetching, creating, toggling, and sending coupons, with fallbacks when backend methods are missing.",
  "frontend/src/hooks/useAdminMessaging.ts": "Implements admin inbox fetching and sending messages to customers, with query invalidation on success.",
  "frontend/src/hooks/useAdminNotifications.ts": "Fetches admin notification counts from the backend with error fallback and periodic refetching.",
  "frontend/src/hooks/useBackupRecovery.ts": "Handles backup metadata retrieval, backup creation, and restore operations with query invalidation.",
  "frontend/src/hooks/useGlobalErrorCapture.ts": "Registers global error and promise rejection handlers to log sanitized error data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication using AuthClient.",
  "frontend/src/hooks/useInView.ts": "Uses IntersectionObserver to detect when an element enters the viewport and optionally triggers only once.",
  "frontend/src/hooks/useLocalCart.ts": "Manages a persistent local cart with add, remove, update, and summary utilities stored in localStorage.",
  "frontend/src/hooks/useOfflineDrafts.ts": "Stores, retrieves, and expires offline form drafts in localStorage per form ID.",
  "frontend/src/hooks/useOfflineMutationReplay.ts": "Empty placeholder file for future offline mutation replay logic.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks online/offline status using browser events.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced‑motion preference with cross‑browser media query handling.",
  "frontend/src/hooks/useQueries.ts": "Provides many React Query hooks for user profiles, roles, admin access, and system checks, calling backend actor methods and invalidating caches on mutations.",
  "frontend/src/hooks/useQueuedMutations.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useRandomQuotes.ts": "Generates 2–3 stable random quotes per route using useMemo and route changes.",
  "frontend/src/hooks/useRecentlyViewed.ts": "Manages a recently viewed products list stored in localStorage with add and clear helpers.",
  "frontend/src/hooks/useSearchArtifacts.ts": "Defines artifact search result type and a search hook returning empty results until backend search is implemented.",
  "frontend/src/hooks/useSessionState.ts": "Persists component state across a browser session with localStorage and auto‑generates a session ID.",
  "frontend/src/hooks/useSystemSettings.ts": "Fetches system‑level backend data such as health checks, logs, events, and audit entries via React Query.",
  "frontend/src/index.css": "Global Tailwind and OKLCH theme styles, fonts, dark mode variables, and animation utilities.",
  "frontend/src/lib/adminAccessSession.ts": "Stores and manages a session‑scoped admin access flag using sessionStorage.",
  "frontend/src/lib/analytics.ts": "Lightweight analytics supporting first‑party backend logging or Google Analytics with functions for page and event tracking.",
  "frontend/src/lib/authorizationErrors.ts": "Normalizes authorization‑related errors to user‑friendly messages and detects auth errors.",
  "frontend/src/lib/clientDetails.ts": "Captures browser user‑agent details and derives device type for logging and security use.",
  "frontend/src/lib/errorLogging.ts": "Implements local error logging with size‑limited storage, sanitization, and utilities for reading and clearing logs.",
  "frontend/src/lib/localStorage.ts": "Provides versioned, expiring, and error‑safe localStorage utilities including get, set, remove, and automatic cleanup functions.",
  "frontend/src/lib/offlineMutationQueue.ts": "Implements an offline mutation queue stored in localStorage with enqueue, dequeue, retry tracking, failure marking, and clearing functions.",
  "frontend/src/lib/randomQuotes.ts": "Selects 2–3 random non‑repeating quotes from a predefined list.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/About.tsx": "Renders an About page with animated sections describing the creator, mission, and vision.",
  "frontend/src/pages/Admin.tsx": "Displays an admin dashboard with tabs, notifications, and permission‑gated management tools.",
  "frontend/src/pages/AdminAccess.tsx": "Provides a secure access-code form for unlocking admin access with backend validation and redirect on success.",
  "frontend/src/pages/AdminPlus.tsx": "Renders owner‑only advanced admin tools including analytics, shop controls, coupons, admin registry, and password management.",
  "frontend/src/pages/BlogLore.tsx": "Displays a grid of lore-themed blog posts using cards with fade-in animations. Renders post metadata such as category, date, excerpt, and read time.",
  "frontend/src/pages/Contact.tsx": "Implements a contact form with validation and simulated submission, plus additional contact info and FAQ section. Uses UI components, state handling, and toast notifications.",
  "frontend/src/pages/Dashboard.tsx": "Renders a user dashboard with profile setup, order tracking, and product data, using hooks for queries and mutations. Includes forms, loading states, and refresh actions.",
  "frontend/src/pages/FAQ.tsx": "Provides a searchable FAQ page with categorized accordion items. Filters questions based on user input.",
  "frontend/src/pages/Homepage.tsx": "Builds the main landing page with hero section, featured carousel, quick links, and benefits grid. Uses parallax effects and fade-in animations.",
  "frontend/src/pages/Inbox.tsx": "Shows the user's inbox with messages, loading states, error handling, and actions to refresh or mark messages as read.",
  "frontend/src/pages/Portfolio.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/Privacy.tsx": "Renders the Privacy Policy page with sections describing data collection, usage, security, rights, cookies, and contact info.",
  "frontend/src/pages/SearchArtifacts.tsx": "Provides a searchable and filterable interface for artifacts using query input, category selection, and displaying results with loading and error states.",
  "frontend/src/pages/Services.tsx": "Displays available services via an accordion and offers links for submitting custom service requests or contacting support.",
  "frontend/src/pages/Shop.tsx": "Implements the shop interface with product listing, filtering, view modes, cart drawer management, and loading/error handling.",
  "frontend/src/pages/SubmitRequest.tsx": "Provides a form for authenticated users to submit custom service requests with text fields and media attachments, then sends the request to the backend.",
  "frontend/src/pages/Terms.tsx": "Renders the Terms of Service page outlining usage conditions, product info, payments, liability, and contact details.",
  "frontend/src/pages/Testimonies.tsx": "React page that lists customer testimonies, handles loading and empty states, and allows authenticated users to open a dialog to submit new testimonies.",
  "frontend/src/types/adminMessaging.ts": "Empty placeholder file for admin messaging types.",
  "frontend/src/types/common.ts": "Defines shared product-related types including visibility, availability, and product structure mirroring backend models.",
  "frontend/src/types/orderTracking.ts": "Provides types and helpers for order tracking, including statuses, history entries, fulfillment methods, and timestamp formatting.",
  "frontend/src/types/phase5a.ts": "Defines Phase 5A types for requests and testimonies, including media formats, pricing preferences, and testimony metadata.",
  "frontend/src/types/phase5b.ts": "Defines Phase 5B types for detailed and summary requests, inbox items, attachments, and request actions.",
  "frontend/src/utils/mediaValidation.ts": "Utility functions for validating media files, including file size, description length, video duration, and type detection.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and utilities for the project.",
  "project_state.json": "Project state file describing admin system requirements, pending features, and architectural notes for ongoing development."
}