{
  "backend/main.mo": "Main canister actor setting up access control, storage maps, ID counters, event logging, and feature-spec data structures.",
  "feature_evidence.json": "Feature evidence report mapping high‑level features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of concise summaries for many frontend files including pages, hooks, components, and docs.",
  "frontend/docs/data-architecture.md": "Documentation of authentication, role model, first‑admin bootstrap, and React Query–based data consistency.",
  "frontend/docs/design-direction.md": "Design spec describing the dark‑fantasy aesthetic, color system, typography, spacing, and interaction styles.",
  "frontend/docs/local-storage-strategy.md": "Documentation of local‑only and canister‑backed storage, offline drafts, mutation queue, and cache invalidation rules.",
  "frontend/docs/phase1-features-by-page.md": "Lists Phase 1 UI skeleton features and future enhancements for each site page, covering homepage through admin panel.",
  "frontend/docs/phase1-planning.md": "Outlines project architecture, site map, navigation, access levels, and Phase 1 implementation scope.",
  "frontend/docs/phase6-qa-test-plan.md": "Provides manual QA test cases for authentication, role access, shop flows, and multi-device/browser testing.",
  "frontend/docs/phase7-iteration-playbook.md": "Describes the feedback workflow, offline-first architecture, admin review flow, and update checklist for iterative development.",
  "frontend/docs/production-deployment.md": "Explains deployment steps for backend and frontend on IC or static hosts, including environment variables and build commands.",
  "frontend/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes and global styling.",
  "frontend/index.html": "Base HTML template setting metadata, root element, and loading the main frontend script.",
  "frontend/src/App.tsx": "Sets up React Router and React Query, lazy-loads pages, defines all application routes, and renders the app with a suspense loader.",
  "frontend/src/components/about/TeamSection.tsx": "Renders a team section with flip-card profiles of predefined team members including bios and expertise.",
  "frontend/src/components/about/TimelineSection.tsx": "Displays a vertical milestone timeline using card components for key historical events.",
  "frontend/src/components/admin/AdminFeedbackTab.tsx": "Empty placeholder file for an admin feedback tab component.",
  "frontend/src/components/admin/AdminOrdersTab.tsx": "Displays all orders with filtering options and opens a tracking detail modal for selected orders.",
  "frontend/src/components/admin/AdminOrderTrackingDetailModal.tsx": "Provides a modal for viewing and updating order tracking details, including status changes, location updates, and notes.",
  "frontend/src/components/admin/AdminProductsTab.tsx": "Empty placeholder file for an admin products tab component.",
  "frontend/src/components/admin/AdminRequestDetailModal.tsx": "Shows detailed request info and provides actions for approving, declining, messaging customers, sending coupons, and converting requests to orders.",
  "frontend/src/components/admin/AdminRequestsTab.tsx": "Lists all user requests with status, pricing, and attachments, and supports viewing request details in a modal.",
  "frontend/src/components/admin/AdminTestimoniesTab.tsx": "Displays submitted testimonies with approval status and previews of attached photos or videos.",
  "frontend/src/components/admin/AdminUsersTab.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/admin/MessageAttachmentPicker.tsx": "Manages file attachment selection and upload with size validation, progress tracking, and attachment removal.",
  "frontend/src/components/adminplus/AdminPasswordResetSection.tsx": "Allows admins to reset other admin passwords with principal validation and basic hashing before submission.",
  "frontend/src/components/adminplus/AdminRegistrySection.tsx": "Enables promoting or demoting admins and displays the current admin registry with principal validation.",
  "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx": "Provides controls for toggling shop availability, overriding product prices, and changing product visibility.",
  "frontend/src/components/adminplus/AnalyticsSnapshotSection.tsx": "Displays a snapshot of site analytics with loading states, error handling, refresh functionality, and metric cards.",
  "frontend/src/components/adminplus/CouponManagerSection.tsx": "Provides a global switch to enable or disable all coupons, showing status, alerts, and loading feedback.",
  "frontend/src/components/adminplus/PortfolioManagerSection.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/adminplus/QuoteRequestManagerSection.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/adminplus/TestimonyManagerSection.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity with loading states and logout cleanup logic.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Modal form for collecting and saving a user's name and email during initial profile setup.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Gatekeeper component that restricts access to admin-only areas based on identity and user role.",
  "frontend/src/components/auth/RequireAuth.tsx": "Protects routes by requiring user authentication and prompting login if identity is missing.",
  "frontend/src/components/auth/RequireOwner.tsx": "Restricts access to owner-only areas, verifying authentication and ownership before rendering children.",
  "frontend/src/components/contact/ContactPageFAQ.tsx": "Renders a FAQ accordion with predefined questions and answers about shipping, authenticity, returns, and care.",
  "frontend/src/components/dashboard/GuildOrdersPanel.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/dashboard/InventoryPanel.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/dashboard/OrderTrackingPanel.tsx": "Displays an order's tracking status, latest notes, and location updates using various UI components.",
  "frontend/src/components/effects/FadeInSection.tsx": "Wraps content in a fade‑in animation triggered on scroll, respecting reduced‑motion settings.",
  "frontend/src/components/effects/FlipCard.tsx": "Interactive flip card component that toggles between front and back views with accessibility and reduced‑motion support.",
  "frontend/src/components/effects/ParallaxLayer.tsx": "Provides a parallax scrolling effect using requestAnimationFrame, with reduced‑motion fallback.",
  "frontend/src/components/feedback/FeedbackDialog.tsx": "Empty placeholder for a feedback dialog component.",
  "frontend/src/components/feedback/FeedbackLauncher.tsx": "Empty placeholder for a feedback launcher component.",
  "frontend/src/components/home/Announcements.tsx": "Renders a list of static announcement cards with badges, dates, and descriptions.",
  "frontend/src/components/home/FeaturedCarousel.tsx": "Carousel displaying featured items with navigation controls and detail links.",
  "frontend/src/components/home/QuickLinksGrid.tsx": "Grid of navigational quick‑link cards leading to major site sections.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with background, header, footer, random quotes, and routed content outlet.",
  "frontend/src/components/layout/Footer.tsx": "Site footer containing branding, navigation links, legal links, and a credit section.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header navigation with desktop and mobile menus, authentication-based actions, and admin links.",
  "frontend/src/components/layout/PageLayout.tsx": "Wrapper component that provides optional page title and description around children content.",
  "frontend/src/components/portfolio/PortfolioDetailsModal.tsx": "Empty file placeholder for a portfolio details modal component.",
  "frontend/src/components/portfolio/PortfolioWidgetSection.tsx": "Empty file placeholder for a portfolio widget section component.",
  "frontend/src/components/quotes/RandomQuotes.tsx": "Displays 2–3 random quotes using a card layout, refreshed on navigation.",
  "frontend/src/components/requests/RequestMediaPicker.tsx": "Media picker allowing image/video uploads with validation, previews, progress tracking, and removal.",
  "frontend/src/components/services/ServiceDetailsAccordion.tsx": "Accordion listing service offerings with icons, summaries, detailed descriptions, and feature lists.",
  "frontend/src/components/shop/ProductDetailsModal.tsx": "Modal showing full product details, availability info, pricing, and add‑to‑cart functionality.",
  "frontend/src/components/shop/ProductFlipCard.tsx": "Flip-card product display with front image/price and back overview, availability info, and detail button.",
  "frontend/src/components/shop/ShopCartDrawer.tsx": "Drawer component for displaying and managing the shopping cart, including coupon validation and checkout handling.",
  "frontend/src/components/shop/useShopFilters.ts": "Custom hook providing search, stock filtering, and sorting logic for shop product lists.",
  "frontend/src/components/system/AnalyticsProvider.tsx": "Tracks page views on initial load and route changes using the app’s analytics system.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "Top-level error boundary that logs errors locally and displays a recovery UI with reload and troubleshooting options.",
  "frontend/src/components/system/ErrorState.tsx": "UI component for displaying error messages with special handling for offline or network-related issues.",
  "frontend/src/components/system/OfflineSyncQueueDialog.tsx": "Empty file.",
  "frontend/src/components/system/OfflineSyncStatus.tsx": "Empty file.",
  "frontend/src/components/system/TroubleshootingDialog.tsx": "Dialog that displays locally stored error logs with options to inspect details and clear the log.",
  "frontend/src/components/testimonies/CreateTestimonyDialog.tsx": "Dialog for submitting testimonies with photos and videos, including validation and backend submission.",
  "frontend/src/components/testimonies/StarRating.tsx": "Renders a star-based rating display with optional configurable maximum.",
  "frontend/src/components/testimonies/TestimoniesWidgetSection.tsx": "Empty file.",
  "frontend/src/components/testimonies/TestimonyMediaCard.tsx": "Flip-card component that shows testimony media on the front and its description on the back, supporting images and video playback.",
  "frontend/src/components/testimonies/TestimonyMediaPicker.tsx": "Component for selecting, validating, uploading, previewing, and managing photo/video testimony media with size and type checks.",
  "frontend/src/components/testimonies/useHoverVideoPreview.ts": "Hook that auto-plays a video on hover and pauses it otherwise using a ref.",
  "frontend/src/data/quotes.ts": "Exports a static list of themed quotes used throughout the app.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useGlobalErrorCapture.ts": "Registers global handlers for errors and unhandled promise rejections and logs them.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useInView.ts": "Hook that detects when an element enters the viewport using IntersectionObserver.",
  "frontend/src/hooks/useLocalCart.ts": "Manages a persistent shopping cart in localStorage with add, update, and remove helpers.",
  "frontend/src/hooks/useOfflineDrafts.ts": "Stores form drafts in localStorage with expiration and provides load, save, and clear operations.",
  "frontend/src/hooks/useOfflineMutationReplay.ts": "Empty placeholder file.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using navigator events.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced-motion preference with cross-browser support.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping canister actor calls for profiles, roles, admin management, and registry operations with caching and invalidation.",
  "frontend/src/hooks/useQueuedMutations.ts": "Empty placeholder file for queued mutation-related hooks.",
  "frontend/src/hooks/useRandomQuotes.ts": "Hook that returns 2–3 stable random quotes per route, regenerating on pathname change.",
  "frontend/src/hooks/useRecentlyViewed.ts": "Manages a recently viewed products list using localStorage with add, load, and clear helpers.",
  "frontend/src/hooks/useSessionState.ts": "Persists component state across sessions via localStorage with session IDs and expiry handling.",
  "frontend/src/index.css": "Global Tailwind-based stylesheet defining OKLCH color themes, dark mode, fonts, animations, and layout utilities.",
  "frontend/src/lib/analytics.ts": "Lightweight analytics module supporting first‑party logging or Google Analytics with pageview and event tracking.",
  "frontend/src/lib/errorLogging.ts": "Local client-side error logging utilities with storage, sanitization, and retrieval helpers.",
  "frontend/src/lib/localStorage.ts": "Versioned, expiry-aware localStorage wrapper with safe read/write, cleanup, and quota handling.",
  "frontend/src/lib/offlineMutationQueue.ts": "Implements a persistent offline mutation queue with enqueue, retry, fail marking, and cleanup operations.",
  "frontend/src/lib/randomQuotes.ts": "Utility that randomly selects 2–3 unique quotes from the quotes array.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider wrappers.",
  "frontend/src/pages/About.tsx": "Renders an About page with creator background, mission, and vision sections using animated components.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard with tabs for managing orders, requests, and testimonies, gated by admin auth.",
  "frontend/src/pages/AdminPlus.tsx": "Owner-only Admin+ panel providing analytics, shop controls, coupon management, admin registry, and password tools.",
  "frontend/src/pages/BlogLore.tsx": "Displays a grid of lore-themed blog posts with categories, dates, and read-time metadata.",
  "frontend/src/pages/Contact.tsx": "Contact page with a message form, submission handling, and supplemental FAQ section.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard showing profile setup, orders, and tracking data with hooks for fetching and saving user info.",
  "frontend/src/pages/FAQ.tsx": "Renders a searchable FAQ page with categorized accordion items inside a PageLayout.",
  "frontend/src/pages/Homepage.tsx": "Displays the main landing page with hero content, featured carousel, quick links, and feature cards.",
  "frontend/src/pages/Inbox.tsx": "Shows user inbox items with loading/error states, message and coupon rendering, and refresh support.",
  "frontend/src/pages/Portfolio.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/Privacy.tsx": "Presents the site's privacy policy as a series of sections within a styled card layout.",
  "frontend/src/pages/Services.tsx": "Displays service offerings using an accordion and provides links for custom service requests or contacting support.",
  "frontend/src/pages/Shop.tsx": "Implements the shop page with product fetching, search/filter controls, grid/list views, cart drawer, and loading/error states.",
  "frontend/src/pages/SubmitRequest.tsx": "Form page for submitting custom requests, handling user profile prefills, media uploads, validation, and request creation.",
  "frontend/src/pages/Terms.tsx": "Static Terms of Service page displaying sections of legal text within a styled layout.",
  "frontend/src/pages/Testimonies.tsx": "Page that lists approved customer testimonies, shows loading/error states, and allows logged‑in users to submit new testimonies.",
  "frontend/src/types/common.ts": "Defines shared product-related types including visibility, availability, and product structure.",
  "frontend/src/types/orderTracking.ts": "Defines order tracking types, status labels, history entries, and helpers for status progression and timestamp formatting.",
  "frontend/src/types/phase5a.ts": "Phase 5A types for requests and testimonies, including media, pricing preferences, and submission metadata.",
  "frontend/src/types/phase5b.ts": "Phase 5B types for detailed request handling, inbox items, statuses, and action history.",
  "frontend/src/utils/mediaValidation.ts": "Utility functions for validating media files, descriptions, video duration, and formatting sizes and durations.",
  "frontend/src/utils/urlParams.ts": "Helper utilities for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, fonts, shadows, and container settings, plus plugins for animations and typography.",
  "project_state.json": "Defines the project’s current state and feature requests, focused on implementing an admin‑driven customer order‑tracking system with statuses, notes, and manual location updates."
}