{
  "backend/main.mo": "Main canister actor defining admin access handling, access control mixins, storage mixins, and numerous domain maps and counters for users, products, orders, artifacts, and related entities.",
  "feature_evidence.json": "Feature evidence report listing two Services‑page features, their associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose of various frontend pages, components, hooks, styles, and documentation files.",
  "frontend/docs/data-architecture.md": "Documentation explaining authentication, role handling, first‑admin bootstrap, and React Query–based data access patterns.",
  "frontend/docs/design-direction.md": "Design specification describing the dark‑fantasy theme, colors, typography, spacing, borders, shadows, and interaction patterns.",
  "frontend/docs/local-storage-strategy.md": "Documentation detailing local‑only storage categories, canister‑backed data, offline mutation handling, and logout behavior.",
  "frontend/docs/phase1-features-by-page.md": "Specification of Phase 1 feature requirements for each site page with future enhancements noted for later phases.",
  "frontend/docs/phase1-planning.md": "Outlines the project's architecture, page structure, navigation, and access levels for the initial development phase.",
  "frontend/docs/phase6-qa-test-plan.md": "Provides manual QA test cases for authentication, access control, and shop functionality across devices and browsers.",
  "frontend/docs/phase7-iteration-playbook.md": "Describes the workflow for collecting feedback, offline-first handling, and admin review plus iteration steps per page.",
  "frontend/docs/production-deployment.md": "Explains how to deploy the frontend and backend to the Internet Computer or external hosts with required environment setup.",
  "frontend/index.css": "Defines Tailwind base layers and extensive CSS variables for light and dark themes across the UI.",
  "frontend/index.html": "Base HTML template that loads the React app with metadata and root mounting point.",
  "frontend/src/App.tsx": "Configures React Router with lazy‑loaded pages and sets up React Query for app-wide data fetching.",
  "frontend/src/components/about/TeamSection.tsx": "Renders a grid of flip cards showcasing team members with front-facing profiles and back-facing bios and expertise.",
  "frontend/src/components/about/TimelineSection.tsx": "Displays a vertical timeline of company milestones using cards and decorative timeline markers.",
  "frontend/src/components/admin/AdminAccessCodeSettingsSection.tsx": "Provides a form to view the masked admin access code and update it with validation and mutation handling.",
  "frontend/src/components/admin/AdminAnalyticsTab.tsx": "Wraps and displays the AnalyticsSnapshotSection component within a simple layout.",
  "frontend/src/components/admin/AdminCouponsTab.tsx": "Manages coupon creation, validity toggling, sending coupons to users, and listing existing coupons with related validations.",
  "frontend/src/components/admin/AdminFeedbackTab.tsx": "Fetches and displays user feedback with search and category filtering, handling loading and error states.",
  "frontend/src/components/admin/AdminMessagingTab.tsx": "Allows admins to send messages to customers and view their inbox with validation and refresh controls.",
  "frontend/src/components/admin/AdminOrdersTab.tsx": "Displays all orders with filters and opens a detailed tracking modal for selected orders.",
  "frontend/src/components/admin/AdminOrderTrackingDetailModal.tsx": "Modal for viewing and updating an order’s tracking status, adding location updates, and posting customer-visible notes.",
  "frontend/src/components/admin/AdminPermissionGate.tsx": "Wraps admin content and only renders children if the user has required permissions, otherwise shows access denied.",
  "frontend/src/components/admin/AdminProductsTab.tsx": "Shows all products with search filtering, loading/error states, and an option to add products.",
  "frontend/src/components/admin/AdminRequestDetailModal.tsx": "Modal for viewing and acting on a custom request, including approve, decline, send message, send coupon, and convert to order.",
  "frontend/src/components/admin/AdminRequestsTab.tsx": "Lists custom requests with search filtering and loads full request details into a modal when selected.",
  "frontend/src/components/admin/AdminSystemSettingsTab.tsx": "Main admin system settings view that fetches health, logs, events, and owner status, and provides refresh controls plus linked sections for registry, password reset, shop controls, backup, and access code settings.",
  "frontend/src/components/admin/AdminTestimoniesTab.tsx": "Displays, filters, and approves user testimonies with search, rating display, media indicators, and mutation handling.",
  "frontend/src/components/admin/AdminUsersTab.tsx": "Lists and filters admin users by principal, showing ownership and permission badges with loading and error states.",
  "frontend/src/components/admin/BackupRecoverySection.tsx": "Handles viewing backup metadata, creating backups, and restoring from backups with confirmation dialogs and status feedback.",
  "frontend/src/components/admin/MessageAttachmentPicker.tsx": "File attachment picker that validates size, uploads with progress tracking, and manages added or removed message attachments.",
  "frontend/src/components/adminDashboard/AdminDashboardShell.tsx": "Layout wrapper for the admin dashboard including top bar, sidebar navigation, and main content area.",
  "frontend/src/components/adminDashboard/AdminSidebarNav.tsx": "Renders the admin sidebar navigation with selectable sections and a logout handler.",
  "frontend/src/components/adminDashboard/AdminTopBar.tsx": "Displays the top admin bar with quick-create actions, notifications, and profile controls.",
  "frontend/src/components/adminDashboard/views/DashboardHomeView.tsx": "Shows dashboard stats, quick actions, and recent product/testimony data with loading and error states.",
  "frontend/src/components/adminDashboard/views/PortfolioManagerView.tsx": "Provides UI for uploading and managing portfolio items with file validation and upload workflow.",
  "frontend/src/components/adminDashboard/views/SecuritySettingsView.tsx": "Manages admin access code updates and displays access logs with validation and mutation handling.",
  "frontend/src/components/adminplus/AdminPasswordResetSection.tsx": "Allows setting or resetting an admin's password using a principal ID with validation and mutation execution.",
  "frontend/src/components/adminplus/AdminRegistrySection.tsx": "Lists admins, allows promotion, demotion, and permission toggling with loading and error states.",
  "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx": "Provides controls to toggle shop availability, override product prices, and adjust product visibility.",
  "frontend/src/components/adminplus/AnalyticsSnapshotSection.tsx": "Fetches and displays snapshot analytics with refresh support and loading/error handling.",
  "frontend/src/components/adminplus/CouponManagerSection.tsx": "Toggles global coupon enablement and displays current coupon system status with alerts.",
  "frontend/src/components/adminplus/PortfolioManagerSection.tsx": "Empty placeholder component.",
  "frontend/src/components/adminplus/QuoteRequestManagerSection.tsx": "Empty placeholder component.",
  "frontend/src/components/adminplus/TestimonyManagerSection.tsx": "Empty placeholder component.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles login/logout using Internet Identity and updates client state accordingly.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Collects and saves a user's name and email during initial profile setup.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guards admin-only routes, handling loading, authentication, and role-based access.",
  "frontend/src/components/auth/RequireAdminAccessGate.tsx": "Checks if the admin access code is unlocked and redirects to /admin-access if not; otherwise renders children.",
  "frontend/src/components/auth/RequireAuth.tsx": "Ensures the user is authenticated via Internet Identity, showing loading or login prompts before rendering children.",
  "frontend/src/components/auth/RequireOwner.tsx": "Verifies the user is authenticated and is the system owner, showing appropriate loading, login, or access-denied screens.",
  "frontend/src/components/contact/ContactPageFAQ.tsx": "Renders a FAQ section using an accordion with predefined questions and answers.",
  "frontend/src/components/dashboard/GuildOrdersPanel.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/dashboard/InventoryPanel.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/dashboard/OrderTrackingPanel.tsx": "Displays detailed tracking info for an order, including status, notes, location updates, and next steps.",
  "frontend/src/components/effects/FadeInSection.tsx": "Fades in its children when scrolled into view, respecting reduced-motion preferences.",
  "frontend/src/components/effects/FlipCard.tsx": "Interactive card that flips between front and back content with keyboard and motion-accessible behavior.",
  "frontend/src/components/effects/ParallaxLayer.tsx": "Applies a scroll-based parallax effect to its children, using requestAnimationFrame and honoring reduced-motion settings.",
  "frontend/src/components/feedback/FeedbackDialog.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/feedback/FeedbackLauncher.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/home/Announcements.tsx": "Displays a list of recent announcements with badges, dates, and descriptions.",
  "frontend/src/components/home/FeaturedCarousel.tsx": "Carousel showcasing featured items with navigation controls and detail links.",
  "frontend/src/components/home/QuickLinksGrid.tsx": "Grid of shortcut navigation cards linking to major site sections.",
  "frontend/src/components/intro/AboutIntro.tsx": "Intro section for the About page wrapped in a decorative border with title and description.",
  "frontend/src/components/intro/AdminAccessIntro.tsx": "Renders an intro section for the Admin Access page using MysticalBorder with a title and short description.",
  "frontend/src/components/intro/ContactIntro.tsx": "Intro component for the Contact page showing a title and brief description within a styled border.",
  "frontend/src/components/intro/FAQIntro.tsx": "Displays the FAQ page header with a title and summary inside a MysticalBorder wrapper.",
  "frontend/src/components/intro/LoreKnowledgeIntro.tsx": "Shows the Lore & Knowledge section intro with a heading and descriptive text.",
  "frontend/src/components/intro/PortfolioIntro.tsx": "Provides the Portfolio page introduction with a title and brief explanatory text.",
  "frontend/src/components/intro/ServicesIntro.tsx": "Renders an intro for the Services page highlighting available expert services.",
  "frontend/src/components/intro/ShopIntro.tsx": "Displays a simple Shop page intro encouraging users to browse the collection.",
  "frontend/src/components/intro/SubmitRequestIntro.tsx": "Intro header for submitting custom requests with a short description.",
  "frontend/src/components/intro/TestimoniesIntro.tsx": "Intro section for customer testimonies with a title and summary text.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout including background layers, header, footer, random quotes, and routed content.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with site info, navigation links, legal links, and attribution.",
  "frontend/src/components/layout/HeaderNav.tsx": "Navigation header with responsive menu, auth-aware links, admin lockout logic, and action buttons.",
  "frontend/src/components/layout/PageLayout.tsx": "Simple wrapper layout providing optional page title and description before rendering children.",
  "frontend/src/components/MysticalBorder.tsx": "A decorative wrapper component providing animated mystical borders with reduced-motion support.",
  "frontend/src/components/portfolio/PortfolioDetailsModal.tsx": "Empty placeholder file for a portfolio details modal component.",
  "frontend/src/components/portfolio/PortfolioWidgetSection.tsx": "Empty placeholder for a portfolio widget section component.",
  "frontend/src/components/quotes/RandomQuotes.tsx": "Displays up to three random quotes using a custom hook and styled quote cards.",
  "frontend/src/components/requests/RequestMediaPicker.tsx": "Media picker for uploading images and videos with validation, preview, progress tracking, and removal.",
  "frontend/src/components/services/ServiceDetailsAccordion.tsx": "Accordion displaying detailed descriptions and features of various offered services with icons.",
  "frontend/src/components/shop/ProductDetailsModal.tsx": "Displays a modal with full product details, pricing, availability, and allows adding items to the local cart.",
  "frontend/src/components/shop/ProductFlipCard.tsx": "Renders a flippable product card showing image, price, stock, and availability, with a back side for brief details and a view-details trigger.",
  "frontend/src/components/shop/ShopCartDrawer.tsx": "Provides a slide-out cart drawer that displays cart items, applies coupons, calculates totals, and submits orders.",
  "frontend/src/components/shop/useShopFilters.ts": "Implements search, in‑stock filtering, and sorting logic for product lists.",
  "frontend/src/components/system/AnalyticsProvider.tsx": "Tracks page views on initial load and on route changes using a router subscription.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "A top-level error boundary that logs errors, shows a recovery UI, and allows reload or troubleshooting.",
  "frontend/src/components/system/ErrorState.tsx": "Displays an error message with online/offline detection and an optional retry button.",
  "frontend/src/components/system/OfflineSyncQueueDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/system/OfflineSyncStatus.tsx": "Empty placeholder file.",
  "frontend/src/components/system/TroubleshootingDialog.tsx": "Shows locally stored error logs with timestamps and stack traces, and allows clearing them.",
  "frontend/src/components/testimonies/CreateTestimonyDialog.tsx": "Dialog for creating a testimony with rating, description, media upload, validation, and submission handling.",
  "frontend/src/components/testimonies/HalfStarRatingInput.tsx": "Interactive half‑star rating input supporting hover preview and click-based selection.",
  "frontend/src/components/testimonies/StarRating.tsx": "Read-only star rating display supporting full and half-star rendering.",
  "frontend/src/components/testimonies/TestimoniesWidgetSection.tsx": "Empty file with no implemented content.",
  "frontend/src/components/testimonies/TestimonyMediaCard.tsx": "Flippable media card that shows an image/video on the front and description on the back with hover video preview.",
  "frontend/src/components/testimonies/TestimonyMediaPicker.tsx": "Media picker for photos and videos with validation, preview generation, and upload progress tracking.",
  "frontend/src/components/testimonies/useHoverVideoPreview.ts": "Hook providing video playback control based on hover and flip state.",
  "frontend/src/data/quotes.ts": "Exports a static list of quotes used throughout the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor instance and invalidates related queries on change.",
  "frontend/src/hooks/useAdminCoupons.ts": "React Query hooks for listing, creating, toggling, and sending coupons using the backend actor.",
  "frontend/src/hooks/useAdminMessaging.ts": "React Query hooks for fetching admin inbox messages and sending messages to customers.",
  "frontend/src/hooks/useAdminNotifications.ts": "Fetches admin notification counts from the backend with error fallback and periodic refetching.",
  "frontend/src/hooks/useBackupRecovery.ts": "Hooks for fetching backup metadata and triggering backup or restore actions, with react-query invalidations.",
  "frontend/src/hooks/useGlobalErrorCapture.ts": "Registers global error and unhandled rejection handlers to log sanitized error details.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useInView.ts": "Provides an IntersectionObserver-based hook to detect when an element enters the viewport.",
  "frontend/src/hooks/useLocalCart.ts": "Manages a localStorage-backed shopping cart with add, remove, update, and quantity helpers.",
  "frontend/src/hooks/useOfflineDrafts.ts": "Stores and retrieves expiring offline form drafts in localStorage keyed by form ID.",
  "frontend/src/hooks/useOfflineMutationReplay.ts": "Empty placeholder file for future offline mutation replay functionality.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status via window events.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced‑motion preference using matchMedia with cross-browser support.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for user profiles, roles, admin access, and various backend data operations.",
  "frontend/src/hooks/useQueuedMutations.ts": "Empty placeholder file for queued mutation handling.",
  "frontend/src/hooks/useRandomQuotes.ts": "Returns stable random quotes per route, regenerating on navigation.",
  "frontend/src/hooks/useRecentlyViewed.ts": "Manages a localStorage-backed list of recently viewed products with expiry and size limits.",
  "frontend/src/hooks/useSearchArtifacts.ts": "Runs artifact search queries via react-query, currently returning empty results pending backend support.",
  "frontend/src/hooks/useSessionState.ts": "Provides a React hook for session-scoped state persisted in localStorage with expiry and session ID tracking.",
  "frontend/src/hooks/useSystemSettings.ts": "Defines React Query hooks that fetch health, logs, events, and admin-related system data from an actor API.",
  "frontend/src/index.css": "Global Tailwind-based styles defining OKLCH color themes, typography, animations, and utility rules for light/dark modes.",
  "frontend/src/lib/adminAccessSession.ts": "Manages a sessionStorage flag indicating whether admin access has been unlocked for the current browser session.",
  "frontend/src/lib/adminEntryLockout.ts": "Tracks permanent admin lockout status per principal using localStorage with versioning.",
  "frontend/src/lib/analytics.ts": "Implements first-party and Google Analytics tracking, script injection, and event/pageview logging.",
  "frontend/src/lib/authorizationErrors.ts": "Normalizes authorization-related errors into user-friendly messages and detects auth error patterns.",
  "frontend/src/lib/clientDetails.ts": "Extracts browser user agent info and infers device type for logging and security usage.",
  "frontend/src/lib/errorLogging.ts": "Provides local error logging with size limits, sanitization, route capture, and safe localStorage handling.",
  "frontend/src/lib/localStorage.ts": "Wraps localStorage with versioning, expiry, safe reads/writes, and helper utilities for clearing stored data.",
  "frontend/src/lib/offlineMutationQueue.ts": "Implements a localStorage-backed queue for offline mutations, supporting enqueue, dequeue, retries, and failure handling.",
  "frontend/src/lib/randomQuotes.ts": "Provides a function to select 2–3 random non-repeating quotes from a predefined list.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/About.tsx": "Renders the About page with intro content and detailed biographical text using cards and animations.",
  "frontend/src/pages/Admin.tsx": "Implements the admin dashboard with section switching, access-granted notifications, and protected admin gating.",
  "frontend/src/pages/AdminAccess.tsx": "Handles admin access authentication, lockout logic, and access code submission with identity integration.",
  "frontend/src/pages/AdminPlus.tsx": "Renders the owner-only Admin+ panel containing advanced controls for analytics, shop settings, coupons, and admin management.",
  "frontend/src/pages/BlogLore.tsx": "Displays a lore-themed blog index page with introductory content and a grid of static post previews.",
  "frontend/src/pages/Contact.tsx": "Renders a contact page with a form, intro section, and simulated submission using toast notifications.",
  "frontend/src/pages/Dashboard.tsx": "Displays user dashboard with profile setup, orders, and product data, including profile saving and order refresh features.",
  "frontend/src/pages/FAQ.tsx": "Shows a searchable FAQ list grouped by categories with an intro section and accordion UI.",
  "frontend/src/pages/Homepage.tsx": "Homepage featuring hero section, featured items, quick links, and benefit highlights using various UI components.",
  "frontend/src/pages/Inbox.tsx": "Manages customer inbox with message listing, loading states, error handling, and mark‑as‑read functionality.",
  "frontend/src/pages/Portfolio.tsx": "Portfolio page with category filters and placeholder grid, displaying empty state until backend integration.",
  "frontend/src/pages/Privacy.tsx": "Renders the Privacy Policy page with sections detailing data collection, use, security, rights, cookies, and contact info. Uses layout, card components, and animated sections.",
  "frontend/src/pages/SearchArtifacts.tsx": "Provides a searchable interface for artifacts with keyword input, category filtering, and result display via a custom search hook. Includes loading, error handling, and UI controls.",
  "frontend/src/pages/Services.tsx": "Displays a themed services page showcasing categories of custom creations with descriptive sections and styled animated elements. Uses layout, borders, and navigation utilities.",
  "frontend/src/pages/Shop.tsx": "Implements a shop page with intro content, an announcement banner, search input, view toggle, and an empty-state message. Currently shows no products while the shop is being built.",
  "frontend/src/pages/SubmitRequest.tsx": "Provides a form for authenticated users to submit custom project requests with text fields, media uploads, validation, and API submission. Prefills user data when available and redirects after success.",
  "frontend/src/pages/Terms.tsx": "Renders the Terms of Service page with sectioned legal text inside animated and styled card components.",
  "frontend/src/pages/Testimonies.tsx": "Displays customer testimonies with ratings, media cards, loading states, and a dialog for authenticated users to submit new stories.",
  "frontend/src/types/adminMessaging.ts": "Empty type file placeholder for admin messaging definitions.",
  "frontend/src/types/common.ts": "Defines shared product-related types including visibility, availability, and product structure mirroring backend models.",
  "frontend/src/types/orderTracking.ts": "Provides types and helpers for order tracking statuses, history, fulfillment methods, and timestamp formatting.",
  "frontend/src/types/phase5a.ts": "Defines request and testimony types including media attachments, pricing preferences, and enum-based media types.",
  "frontend/src/types/phase5b.ts": "Defines request detail, inbox, and attachment types along with request status and pricing preference variants.",
  "frontend/src/utils/mediaValidation.ts": "Implements file, description, and video duration validation utilities with formatting helpers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, fonts, animations, and plugin settings for the frontend.",
  "project_state.json": "Defines current project state for updating the Services page with new content and consistent bordered styling, including existing features, new requests, and metadata."
}