{
  "kind": "build_request",
  "title": "Phase 6A: Secure Admin Access Page gateway with master code verification, audit logging, and responsive navigation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a protected Admin Access Page at route \"/admin-access\" that prompts for the five-character master access code \"7583A\" and, on correct entry, immediately grants access to the existing Admin Dashboard.\n\n- On success: unlock the existing admin access gate for the current browser session and route the user to \"/admin\".\n- On failure (including backend errors): deny access and display only the exact user-facing message \"Access Denied\" (no extra details).\n- Ensure the input enforces exactly 5 characters (UI maxLength=5, and UI copy must refer to a five-character code, not a digit-only PIN).\n- Do not display any security implementation details (e.g., do not mention multi-step verification, logging mechanics, principals, roles, etc.) on this page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Create a secure Admin Access Page... five-character master access code (7583A)",
          "If the code is incorrect, access is denied and a simple “Access Denied” message is shown without revealing any security details."
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin-access shows a form with a single code input limited to 5 characters.",
        "Submitting an incorrect code results in only the text \"Access Denied\" being shown; no other explanatory text is displayed.",
        "Submitting the correct code routes the user to /admin and the admin dashboard renders in the same session without re-entering the code.",
        "All user-facing text on the page is in English and does not disclose security/audit details (no mention of roles, principals, timestamps, logging, or multi-step verification)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the site header navigation so the Admin Access Page link placement matches the requested responsive behavior:\n\n- Mobile devices: ensure an \"Admin\" link appears in the top-right hamburger menu.\n- Desktop/computer/TV screens: ensure an \"Admin\" link appears in the main top navigation bar alongside the other website pages, labeled exactly \"Admin\".\n\nThe link must navigate to \"/admin-access\" and must extend existing navigation behavior rather than replacing it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Mobile devices: The Admin Page link must appear in the top-right hamburger menu.",
          "Desktop, computer, and TV screens: The Admin Page must appear in the main top navigation bar alongside the other website pages, labeled clearly as “Admin.”"
        ]
      },
      "acceptanceCriteria": [
        "On narrow viewports, opening the hamburger menu shows an \"Admin\" link that navigates to /admin-access.",
        "On large viewports, the top nav link row includes an \"Admin\" text link (not icon-only) that navigates to /admin-access.",
        "Existing navigation links and behavior remain intact."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the Admin Dashboard route \"/admin\" remains protected by the existing authentication and admin access gate systems, such that:\n\n- Users cannot access the Admin Dashboard unless they have successfully entered the master access code during the current browser session.\n- This gating behavior must extend existing mechanisms (e.g., the current gate/session approach) rather than replacing the admin dashboard implementation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "This Admin Access Page must integrate with the existing authentication and dashboard systems, extending current functionality rather than replacing any existing systems, and must act solely as the secure entry gateway to the Administrative Dashboard."
        ]
      },
      "acceptanceCriteria": [
        "Direct navigation to /admin without having unlocked the access gate during the current session redirects the user to /admin-access or otherwise prevents rendering of the dashboard content.",
        "After a successful unlock, navigating to /admin works for the remainder of the browser session (until session end or explicit logout/session clear).",
        "No existing Admin Dashboard tabs/features are removed or replaced."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the backend admin access verification so that every successful master-code verification is automatically timestamped and stored in a persistent Admin Access Log for auditing.\n\n- Store at least: unique log entry id, caller principal, and a real timestamp (do not use a placeholder value).\n- Only successful verifications must be recorded in this Admin Access Log.\n- Keep (or provide) an admin-only query endpoint to retrieve the Admin Access Log for auditing purposes (do not expose this log publicly).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Every successful login must be automatically timestamped and stored in an Admin Access Log for auditing purposes."
        ]
      },
      "acceptanceCriteria": [
        "Submitting the correct code causes the canister to persist a new Admin Access Log entry containing the caller principal and a non-zero timestamp.",
        "Submitting an incorrect code does not create a new Admin Access Log entry.",
        "Only authorized admins can query/retrieve the Admin Access Log; unauthorized callers are rejected.",
        "Existing verification behavior continues to work with the master code \"7583A\"."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure logging out clears any session-scoped \"admin access unlocked\" state so that, after logout, the browser session no longer has access-gate unlock privileges until the master code is re-entered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Create a secure Admin Access Page... protected gateway to the Administrative Dashboard."
        ]
      },
      "acceptanceCriteria": [
        "After successfully unlocking admin access, logging out and then logging back in requires re-entering the master code before /admin can be accessed in that session.",
        "No other session/local-storage state unrelated to the admin access gate is unintentionally cleared beyond current logout behavior."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths (compose instead).",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Do not implement third-party authentication or replace Internet Identity.",
    "Do not add multi-factor authentication beyond the specified five-character master access code.",
    "Do not build a full admin audit-log UI unless explicitly required; retrieving logs via existing admin-only endpoint is sufficient.",
    "Do not introduce external databases or off-canister logging/storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}