{
  "kind": "build_request",
  "title": "Update About page content for “The Creator of Side Quests” and enable randomized quotes on all pages (including About)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-53",
      "text": "Replace the existing About page content (/about) with the user-provided “The Creator of Side Quests” About page copy, ensuring the page is fully website-ready, multi-paragraph, polished, and keeps the provided narrative text verbatim while integrating it naturally into the page flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "Create a polished, website-ready About page and a collection of quotes for “The Creator of Side Quests.”",
          "Include the following About page content verbatim and integrated naturally into the page:"
        ]
      },
      "acceptanceCriteria": [
        "The /about route renders with a page title and description aligned to “The Creator of Side Quests” (no remaining “Arcane Artifacts” branding on the About page).",
        "The About page contains the provided narrative block exactly as written (including punctuation and emojis) and is presented as readable, multi-paragraph website copy.",
        "The Mission Statement and Vision Statement appear clearly labeled on the About page and match the user-provided wording exactly.",
        "All user-facing text added/changed for this requirement is in English."
      ]
    },
    {
      "id": "REQ-54",
      "text": "Update the centralized quotes data source to contain exactly the user-provided quotes (exact wording and punctuation), and ensure the random selection utility returns 2–3 non-repeating quotes per page render/load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Quotes to randomly appear across the website, 2–3 per page, including the About page:",
          "“Side quests accepted, main quests optional.”",
          "“Where chaotic creativity meets practical solutions.”",
          "“If you can dream it, we can create it.”",
          "“Hobbies turned into a chaotic dream job.”",
          "“Crafting magic from chaos, one idea at a time.”",
          "“ADHD energy, obsessive focus, infinite creativity.”",
          "“Chaos is a toolbox, not a problem.”",
          "“Every hyperfixation has a purpose, every obsession can become art.”",
          "“Neurodivergent thinking fuels innovation and wonder.”",
          "“Turning messy ideas into magical results.”"
        ]
      },
      "acceptanceCriteria": [
        "The quotes data source includes all 10 quotes exactly as provided and does not alter quote text.",
        "The random quote selection returns either 2 or 3 quotes (configurable or deterministic) and never repeats the same quote within the same page render.",
        "No runtime errors occur when quote selection is invoked across routes."
      ]
    },
    {
      "id": "REQ-55",
      "text": "Change the randomized quotes display behavior so that randomized quotes render on every page including the About page, and ensure the presentation is visually appealing (pull-quote/card style) and does not overwhelm the reader.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Quotes to randomly appear across the website, 2–3 per page, including the About page",
          "Quotes should appear naturally in the text or highlighted as small pull-quotes."
        ]
      },
      "acceptanceCriteria": [
        "Randomized quotes are visible on /about as well as all other existing routes (/, /services, /shop, /dashboard, /contact, /blog, /faq, /terms, /privacy, /admin).",
        "The quotes component styling remains consistent with the existing site theme and uses an unobtrusive pull-quote/card presentation.",
        "Quotes do not cause layout shift or overflow issues on mobile widths."
      ]
    },
    {
      "id": "REQ-56",
      "text": "Resolve the prior build/deploy failure by ensuring the project builds successfully (typecheck + production build) after the About and quotes changes, without modifying frontend immutable paths.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "Deployment encountered an error",
          "Can you try generating again it said deploy encountered an error",
          "making sure the quotes appear on all of the different pages and then redeploy"
        ]
      },
      "acceptanceCriteria": [
        "Frontend TypeScript build completes without errors.",
        "Canister build completes without errors.",
        "No changes are made to any paths listed in frontend.immutablePaths.",
        "After the changes, the app runs locally (or in preview) and /about renders without runtime exceptions."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any path listed in frontend.immutablePaths (compose existing components instead).",
    "Keep all backend logic within the single Motoko actor (backend/main.mo); create backend/migration.mo only if an upgrade-safe state migration is actually required.",
    "All user-provided quote strings must be stored and displayed with exact wording and punctuation.",
    "All user-facing text introduced/modified by this request must be in English."
  ],
  "nonGoals": [
    "Do not implement the full multi-page business-site revamp (homepage booking banner, portfolio gallery, testimonials, newsletter, services taxonomy, Hours & Policies page) unless explicitly requested in a separate task.",
    "Do not change authentication/authorization behavior, roles, or Admin access control as part of this request.",
    "Do not add third-party auth providers or external databases/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}