{
  "kind": "build_request",
  "title": "Phase 5F Unified Backend + Phase 6A Admin Access Code Gate with Audit Logging",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement Phase 6A Admin Access Page and gating so that entering the master access code \"7583A\" is required before an admin can enter the administrative dashboard, with incorrect entries denied.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "Create a secure Admin Access Page that requires a five-digit master access code (7583A) to enter the administrative dashboard. If the correct code is entered, full dashboard access is granted; incorrect entries deny access."
        ]
      },
      "acceptanceCriteria": [
        "A new route/page exists for Admin Access (e.g., \"/admin-access\") with an input for the master access code and a submit action.",
        "Attempting to open the admin dashboard route (currently \"/admin\") without a successful master-code validation sends the user to the Admin Access page (or shows a blocking gate).",
        "Submitting any code other than \"7583A\" shows an explicit Access Denied state and does not unlock admin dashboard access.",
        "Submitting the correct code unlocks access and then allows the user to enter the existing Admin Dashboard UI at \"/admin\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a backend API to verify the master access code \"7583A\" for admin principals and record a successful-login audit log entry containing the caller principal and a timestamp, and expose an admin-only query to read these audit log entries.",
      "target": "backend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "Each successful login is timestamped and logged."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a shared method to verify the submitted master access code \"7583A\" and returns a success/failure result.",
        "Only authenticated admins can successfully verify/unlock via this method (non-admin callers are rejected).",
        "On each successful verification, the backend persists a log entry with (at minimum) caller principal and a timestamp value.",
        "Backend exposes an admin-only query to list the successful admin-access log entries.",
        "Successful verifications are also recorded via the existing event logging mechanism (or an equivalent persistent audit log) without requiring the frontend to call logEvent directly."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Wire the Admin Access Page to the backend verification API and persist the unlocked state on the client so that a page refresh does not immediately re-lock during the same session (while still allowing lockout on explicit logout).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ]
      },
      "acceptanceCriteria": [
        "Admin Access Page calls the backend verify method and only unlocks on a successful response.",
        "Unlocked state is stored in session-scoped browser storage (e.g., sessionStorage) and is checked by the admin-gating logic before rendering \"/admin\".",
        "Logging out of Internet Identity clears the unlocked state so the user must re-enter the master code after the next login to access \"/admin\"."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Complete Phase 5F Unified Backend by ensuring requests, testimonies, messages, coupons, and orders are handled in the single Motoko backend actor with consistent, end-to-end workflows that match the frontend’s existing React Query hooks and admin UI flows.",
      "target": "backend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "Requests, testimonies, messages, coupons, and orders all run in one backend for smooth admin and customer workflow."
        ]
      },
      "acceptanceCriteria": [
        "All canister methods currently invoked by the frontend hooks in `frontend/src/hooks/useQueries.ts` for requests/inbox messaging/coupons/testimonies/orders exist in `backend/main.mo` and return data in the shapes the frontend expects.",
        "Admin request workflow supports: list all requests, view request by id, approve/decline, convert an approved request into an order, and write request action history updates.",
        "Admin messaging workflow supports: sending a message with attachments to a customer and sending a coupon code to a customer, and these appear in the customer’s Inbox (`/inbox`) via a list-caller-inbox API.",
        "Testimonies workflow supports: submit testimony, list approved testimonies for the public page, and list/moderate testimonies for admins (approve/reject).",
        "All of the above live in the existing single actor (`backend/main.mo`) rather than introducing additional backend services/canisters."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the admin dashboard entry UX to clearly communicate the two-step security requirement (Internet Identity admin role + master access code) using English user-facing text, without modifying read-only/immutable frontend paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ]
      },
      "acceptanceCriteria": [
        "If a user is not logged in, they are prompted to log in via the existing authentication flow before they can use the Admin Access Page.",
        "If a user is logged in but not an admin, they see an Access Denied state (reusing the existing `RequireAdmin` behavior) and cannot proceed to code entry.",
        "If a user is an admin but has not entered the master code in the current session, the UI clearly instructs them to enter the master code to continue to the dashboard.",
        "No changes are requested to files listed in `SYSTEM_CONTEXT.frontend.immutablePaths` (any new gating is implemented via new components/pages and composition)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in `backend/main.mo` (no additional backend services).",
    "Do not edit frontend immutable paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "All user-facing text must be in English.",
    "Preserve the exact master access code value: \"7583A\"."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers (only Internet Identity).",
    "Do not implement real-time features (no WebSockets/chat).",
    "Do not add external databases or off-chain storage; use canister state only.",
    "Do not redesign the existing admin dashboard tabs beyond adding the new access gate flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}