{
  "kind": "build_request",
  "title": "Phase 5A: Logged-in Requests & Testimonies submissions with media, unique IDs, flippable cards, and Admin listing",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add backend data models and APIs for customer Requests and Testimonies, each generating a unique ID on creation and persisting submissions so they can be listed in the admin dashboard.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Logged-in customers can submit requests or testimonies... All submissions get a unique ID and appear in the admin dashboard."
        ]
      },
      "acceptanceCriteria": [
        "Calling the backend create-request method returns a newly created Request containing a unique, non-zero ID.",
        "Calling the backend create-testimony method returns a newly created Testimony containing a unique, non-zero ID.",
        "Admin-only list methods return all stored Requests and all stored Testimonies (including newly submitted ones) in a consistent order (e.g., newest-first or id-desc).",
        "Unauthorized callers (non-admin) cannot access admin list methods (backend traps or returns an authorization error)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement backend authorization rules so only logged-in users can submit Requests and Testimonies, and only admins can review/list submissions in the admin dashboard.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Logged-in customers can submit requests or testimonies."
        ]
      },
      "acceptanceCriteria": [
        "Submitting a Request/Testimony while unauthenticated fails with a clear authorization error from the backend.",
        "Submitting a Request/Testimony while authenticated succeeds and persists the submission.",
        "Admin-only endpoints (list/review actions) reject non-admin callers."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement media attachment support for Requests (optional media) and Testimonies (up to 5 photos and 3 videos) using the existing backend blob storage mixin, storing media metadata alongside submissions.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Requests include ... optional media... Testimonies allow up to 5 photos and 3 videos (≤800\u000fMB, videos ≤5\u000fmin) with descriptions ≤1,500 characters."
        ]
      },
      "acceptanceCriteria": [
        "Request submission supports zero or more media attachments and stores references/metadata for each attachment.",
        "Testimony submission enforces the maximum counts: ≤5 photos and ≤3 videos.",
        "Each testimony media item stores a per-item description that is limited to 1,500 characters.",
        "Frontend validates file size ≤800 MB per file before attempting upload.",
        "Frontend captures and submits video duration metadata and blocks videos longer than 5 minutes (client-side validation)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Create customer-facing UI routes and forms for (1) submitting a Request and (2) submitting a Testimony, and ensure these forms are only accessible/usable when the user is logged in.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Logged-in customers can submit requests or testimonies. Requests include name, email, description, optional media, and a price range or “Flexible.”"
        ]
      },
      "acceptanceCriteria": [
        "A dedicated Request submission page/route exists and presents fields: name, email, description, optional media, and pricing preference (either price range input or a “Flexible” selection).",
        "A dedicated Testimony submission page/route or dialog exists and supports uploading up to 5 photos and 3 videos, with a description per media item (≤1,500 chars).",
        "When unauthenticated, attempting to access submission UI shows the existing login prompt behavior (via RequireAuth) instead of the form.",
        "When authenticated, name and email are prefilled from the existing user profile when available, while still allowing the user to edit before submitting."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Expose the Request and Testimony submission entry points in the main navigation and on the Testimonies page (and add clear call-to-action links in relevant service/product areas without breaking existing flows).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The Quote / Custom Request form and the Testimonies form are accessible from the main navigation, testimonies page, and relevant product or service pages."
        ]
      },
      "acceptanceCriteria": [
        "Header navigation includes links to the Request submission page and the Testimonies page.",
        "The Testimonies page includes a prominent logged-in-only call-to-action to submit a new testimony.",
        "Services and Shop experiences include at least one non-intrusive call-to-action link/button that routes to the Request submission page (while preserving existing layouts and interactions)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement the Testimonies page to display testimony media as interactive flippable cards with hover and click effects: videos auto-preview on hover, click flips and pauses to show description; photos support hover zoom and click flips to show description.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Media appears as flippable cards with hover and click effects."
        ]
      },
      "acceptanceCriteria": [
        "Testimonies page is implemented (not empty) and renders a grid/list of media cards.",
        "Each card uses the existing FlipCard component behavior for click-to-flip and keyboard accessibility.",
        "Video cards: hovering starts playback preview (muted), clicking flips to the back and pauses playback; flipping back returns to the front state.",
        "Photo cards: hovering provides a zoom-in interaction, clicking flips to show the description on the back.",
        "Reduced-motion preference is respected (no forced animation beyond what FlipCard already supports)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add admin dashboard UI to list newly submitted Requests and Testimonies, showing their unique IDs and key metadata, and refresh the lists immediately after a new submission succeeds.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All submissions get a unique ID and appear in the admin dashboard."
        ]
      },
      "acceptanceCriteria": [
        "Admin page (existing /admin route) contains sections/tabs/panels for Requests and Testimonies listings (not just placeholders).",
        "Each Request row shows at minimum: Request ID, submitter name/email, pricing preference (range or Flexible), and a truncated description preview.",
        "Each Testimony row shows at minimum: Testimony ID, submitter identity label (from profile/name), counts of attached photos/videos, and approval status if present.",
        "After a successful submission, navigating to /admin shows the new item present without requiring a hard reload (React Query invalidation/refetch is sufficient)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add React Query hooks in the existing query layer for creating and listing Requests/Testimonies (and any required admin actions), following existing actor-based patterns.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "New hooks exist for: createRequest, createTestimony, listRequests (admin), listTestimonies (admin/public as needed).",
        "Hooks are wired to backend actor methods and use query keys consistent with the existing useQueries.ts patterns.",
        "Successful mutations invalidate the relevant list queries so the admin listings update predictably."
      ]
    },
    {
      "id": "REQ-9",
      "text": "If the backend schema for testimonies/quote requests must change to support multiple media items and per-media descriptions, add a conditional migration that preserves existing stored data and increments IDs safely.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "On upgrade, any existing stored testimonies/quote requests remain accessible and are mapped into the new structure without trapping.",
        "ID counters (nextTestimonyId / nextQuoteRequestId or equivalents) remain correct and do not reset or collide.",
        "A clean deploy with no prior state still initializes correctly and passes basic create/list operations."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo (no additional backend services).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui/* (compose instead).",
    "All user-facing UI text must be in English."
  ],
  "nonGoals": [
    "Admin-to-customer in-dashboard messaging/chat is out of scope for this phase.",
    "Automatic conversion of Requests into Shop Orders is out of scope unless it already exists elsewhere and can be triggered without new workflow design."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}