{
  "kind": "build_request",
  "title": "Phase 5 polishing: UX animations, robust error handling, performance, responsiveness, accessibility & SEO",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-34",
      "text": "Refine and standardize site-wide animations/interactions (flip cards, hover glows, scroll-based fade-ins) so they are consistent across all pages/components, do not cause layout shift, and fully respect reduced-motion preferences.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Animations & Interactions: Flip cards, hover glows, scroll-based fade-ins."
        ]
      },
      "acceptanceCriteria": [
        "Flip-card, hover-lift/glow, and fade-in-on-scroll behaviors look visually consistent across Homepage, About, Services, Shop, Dashboard, Contact, Blog/Lore, FAQ, Admin, Terms, and Privacy.",
        "When the OS/browser prefers-reduced-motion setting is enabled, flip/fade/parallax/hover motion effects are disabled or minimized without breaking layout or hiding content.",
        "Animations do not cause noticeable content reflow/layout shift during entry/hover/flip interactions."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Strengthen frontend error handling for offline mode and failed canister/API calls by providing clear, user-facing feedback and recovery actions (retry, continue offline where safe) across the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Error Handling: Handle offline errors, failed API calls, and syncing conflicts."
        ]
      },
      "acceptanceCriteria": [
        "All primary data-fetching views (e.g., Shop product list, Dashboard panels, Admin tabs) show a clear error state when a query fails, using English user-facing text.",
        "Mutations that are queued for offline sync provide clear feedback that the action was queued, and do not leave the UI in an ambiguous state.",
        "A user can manually retry failed actions (either by retrying the failed view or triggering a replay of queued actions) without refreshing the page."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Improve offline sync conflict handling UX for queued mutation replay by distinguishing transient failures (retryable) vs permanent failures (non-retryable), and by letting the user inspect and resolve remaining queued actions (retry or remove).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Error Handling: Handle offline errors, failed API calls, and syncing conflicts."
        ]
      },
      "acceptanceCriteria": [
        "When queued mutation replay fails, the UI indicates how many actions remain queued and presents an English explanation that includes whether the failure is retryable.",
        "Users have an in-app way to retry syncing queued actions and to clear/remove stuck actions from the queue (with a confirmation step).",
        "Queued actions that exceed the configured retry limit are surfaced as failed (not silently dropped) and can be cleared by the user."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Implement performance optimizations: lazy-load non-critical route code and heavy UI sections, lazy-load images where applicable, and reduce unnecessary re-renders to minimize bundle size and improve initial load performance.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Performance Optimization: Lazy loading images, caching, and minimizing bundle size."
        ]
      },
      "acceptanceCriteria": [
        "Non-initial routes are code-split so that navigating to secondary pages does not require loading all page code upfront.",
        "Any image elements added in the UI use lazy loading where appropriate and include explicit sizing to avoid layout shift.",
        "React Query caching settings remain effective (no regressions to current staleTime/refetch behavior), and obvious avoidable re-renders are reduced in frequently-used views (e.g., Shop list rendering)."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Complete responsive testing and fix layout issues across mobile, tablet, and desktop breakpoints, ensuring navigation, modals, grids, and dashboard tabs remain usable and visually consistent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Responsive Testing: Mobile, tablet, desktop layouts."
        ]
      },
      "acceptanceCriteria": [
        "Key pages (Homepage, Shop, Dashboard, Admin, Contact) render correctly at common breakpoints (mobile, tablet, desktop) with no horizontal scrolling caused by layout overflow.",
        "Header navigation and mobile menu remain usable on small screens and do not overlap main content.",
        "Modals (e.g., product details) are fully usable on mobile (content scrolls within viewport, controls remain reachable)."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Improve accessibility and SEO basics by adding/ensuring alt text, semantic HTML landmarks, keyboard accessibility, and appropriate meta tags (title/description) for the application and major routes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Accessibility & SEO: Add alt text, semantic HTML, meta tags. Build it."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/index.html` contains an appropriate app title and includes basic SEO meta tags (at minimum: title and meta description) in English.",
        "All interactive controls have accessible names (visible labels or aria-label) and are keyboard operable; focus states are visible.",
        "Any presentational images/icons that convey meaning have appropriate alt text (or are correctly marked decorative), and major page regions use semantic structure (e.g., main content area, headings in logical order)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the backend as a single Motoko actor; do not introduce additional backend services or external databases."
  ],
  "nonGoals": [
    "Adding new product features or new pages beyond the existing sitemap.",
    "Changing the authentication provider (must remain Internet Identity).",
    "Introducing third-party SEO services, analytics, or external monitoring integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}