{
  "kind": "build_request",
  "title": "Make 7583A a permanent master admin code that always grants access and redirects to Admin Dashboard",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the backend permanently recognizes the master admin access code \"7583A\" and always returns \"Access Granted\" when the caller submits exactly that code, regardless of any prior lockout state or configurable code changes.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The Admin Access system must permanently recognize 7583A as the correct five-character master access code... ensuring the code is always validated correctly and never returns an access-denied message when entered exactly as 7583A."
        ]
      },
      "acceptanceCriteria": [
        "Calling submitAdminAccessAttempt with \"7583A\" returns exactly \"Access Granted\" even if the caller is currently locked out.",
        "Calling verifyAdminAccess/adminLogin with \"7583A\" succeeds even if the caller is currently locked out.",
        "Any lockout/attempt counters for the caller are cleared/reset on successful use of the permanent master code."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Normalize admin access code validation on the backend so that the permanent master code check for \"7583A\" is robust to common user input variations (leading/trailing spaces and case differences), while still treating the code as exactly five characters after trimming.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "...correct five-character master access code... whenever this code is entered..."
        ]
      },
      "acceptanceCriteria": [
        "Submitting \" 7583a \" (or other case variants with surrounding whitespace) is treated as the permanent master code and grants access.",
        "Backend validation trims whitespace and performs a case-insensitive comparison for the permanent master code path.",
        "Non-matching codes still follow the existing lockout/attempt behavior."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Admin Access page so that when the user enters \"7583A\" it immediately shows the success message \"Access Granted\" and automatically redirects to \"/admin\" without ever displaying an access-denied state for that exact input.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Whenever this code is entered on the Administrative Access page, the system should immediately display “Access Granted” and automatically redirect the user to the full Admin Dashboard..."
        ]
      },
      "acceptanceCriteria": [
        "Entering 7583A on /admin-access shows \"Access Granted\" and navigates to /admin automatically.",
        "No \"Access Denied\" message is shown when the user enters 7583A (including case/whitespace variants that normalize to 7583A).",
        "Redirect happens automatically after success without requiring additional user interaction."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update admin settings UI copy so it does not imply that the permanent master code can be changed; clearly present 7583A as the permanent master code and treat the existing update form as changing only the configurable admin access code.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "...permanently recognize 7583A as the correct five-character master access code."
        ]
      },
      "acceptanceCriteria": [
        "Admin access code settings section labeling/descriptions clearly state that \"7583A\" is permanent and cannot be changed.",
        "The update form is described as changing a configurable/secondary admin access code (while 7583A always remains valid).",
        "All user-facing text remains in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing new admin features/tools beyond ensuring admin access is granted and the dashboard becomes reachable.",
    "Adding third-party authentication or any non-Internet-Identity auth mechanisms.",
    "Changing unrelated role/permission models outside what is required to ensure 7583A always grants access."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}