{
  "kind": "build_request",
  "title": "Phase 5B: Admin Requests Review, Messaging/Coupons Inbox, and Request-to-Order Conversion",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement canister-backed persistence and APIs for customer Requests, including: create a request with optional media attachments, list requests for admins, and fetch a single request with its attachments and status.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Admins see all requests, review attachments, approve/decline... attach files ≤800 MB... convert approved requests into orders."
        ]
      },
      "acceptanceCriteria": [
        "A logged-in user can create a Request via a new backend method (no frontend placeholder throws) and the Request is persisted across reloads.",
        "An admin can list all Requests via a new backend query method and receives a stable array of Request records with ids, submitter principal, status, and attachment metadata.",
        "An admin can fetch a single Request by id and receive the full Request including attachment references/metadata."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add request moderation actions for admins: approve and decline requests, each producing an immutable action record stored on the Request (including actor principal, action type, optional note, and a timestamp).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "approve/decline",
          "All actions are timestamped."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes admin-only methods to approve and decline a request by id.",
        "Each approve/decline call appends an action-history entry to the Request that includes: admin principal, action type, and a non-zero timestamp value (when supported).",
        "Non-admin callers are rejected for moderation methods."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement a customer inbox in the backend that supports (a) admin-to-customer messages, and (b) admin-to-customer coupon deliveries; both must be retrievable by the customer and scoped to the customer principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "send messages or coupons to the customer inbox (refresh to see)"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an authenticated user method to list the caller’s inbox items (messages and coupons).",
        "Backend exposes admin-only methods to send a message to a target customer principal and to send a coupon to a target customer principal.",
        "Inbox items are persisted and returned in reverse-chronological order (newest first) based on stored timestamps."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Support attachments up to 800 MB for admin-to-customer messaging (file attachments on messages), storing the attachment content using the existing blob storage mixin and linking the blob reference from the inbox item.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "attach files ≤800 MB"
        ]
      },
      "acceptanceCriteria": [
        "Admin UI allows selecting one or more files for a message and enforces a per-file max size of 800 MB before attempting upload.",
        "Uploaded message attachments are stored via the canister’s blob storage utilities and can be downloaded/opened by the customer from their inbox.",
        "If an admin attempts to attach a file > 800 MB, the UI blocks submission with a clear English validation error."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement request-to-order conversion: allow admins to convert an approved Request into an Order, linking the created Order to the originating Request and preventing conversion unless the Request is approved.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "convert approved requests into orders"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an admin-only method to convert a Request id into an Order.",
        "Conversion fails with a clear error if the Request is not in an approved state.",
        "After conversion, the Request record indicates it has been converted and includes the created Order id (or an equivalent link)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Upgrade the Admin Dashboard Requests tab to (a) actually load requests from the backend, (b) show a request detail view with attachment previews/links, (c) allow approve/decline, (d) allow sending a message and/or coupon to the request’s submitter, and (e) allow converting an approved request into an order.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Admins see all requests, review attachments, approve/decline, send messages or coupons... and convert approved requests into orders."
        ]
      },
      "acceptanceCriteria": [
        "The Requests tab no longer uses disabled placeholder hooks; it loads from backend and renders a non-empty list when requests exist.",
        "Selecting a request shows a detail panel/modal that includes description, submitter principal, and a list of attachments with open/download actions.",
        "Approve/Decline actions trigger backend mutations and the UI updates status after success (via React Query invalidation/refetch).",
        "The UI provides controls to send a message/coupon to the request’s customer and shows success/error feedback in English.",
        "The UI provides a Convert to Order action that is only enabled when the request is approved and shows the created Order id/link after success."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add a customer-facing Inbox UI (accessible to authenticated users) that lists received messages and coupons and includes a manual Refresh control to fetch new items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "customer inbox (refresh to see)"
        ]
      },
      "acceptanceCriteria": [
        "Authenticated users can navigate to an Inbox section/page and see a list of inbox items (messages and coupons) from the backend.",
        "The Inbox UI includes a Refresh button that triggers a React Query refetch and updates the list without a full page reload.",
        "Inbox items display at minimum: type (Message/Coupon), sender (admin principal or label), body/code, and timestamp (when available)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Ensure authorization and future multi-admin support: all admin-only operations (list all requests, request moderation, sending inbox items, converting requests to orders) must be guarded by the existing admin/owner role system and work for any principal in the admin registry (not only the owner).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Multiple admins possible in the future."
        ]
      },
      "acceptanceCriteria": [
        "All admin-only backend methods reject non-admin callers.",
        "All admin-only backend methods allow both the owner and any promoted admin in the admin registry to execute successfully.",
        "No logic relies on a single hard-coded admin principal."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit any files under frontend/src/components/ui or other immutable frontend paths specified by SYSTEM_CONTEXT.",
    "Use English for all user-facing text.",
    "Do not introduce external databases or third-party auth; use existing Internet Identity + canister storage patterns."
  ],
  "nonGoals": [
    "Real-time inbox updates (no websockets/push); manual refresh only as requested.",
    "Building a full coupon creation workflow in the admin dashboard beyond sending existing coupons (unless already required by current backend capabilities).",
    "Implementing a multi-canister architecture or external file hosting/CDN."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}