{
  "kind": "build_request",
  "title": "Fix admin access flow to bypass Internet Identity and unlock full admin dashboard via backend-verified code",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix backend admin-code verification so that a case-insensitive match that returns “Access Granted” also grants admin privileges for the same caller principal (so the user can actually enter the admin dashboard after a successful code entry).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Stored in the back end canister! ... The five digit code to get into the dashboard is this 7583A"
        ]
      },
      "acceptanceCriteria": [
        "Calling submitAdminAccessAttempt with accessCode=\"7583a\" (or any mixed/lowercase variant) returns exactly \"Access Granted\" and also results in the caller being granted admin privileges (i.e., subsequent admin-protected calls from the same caller principal succeed).",
        "Calling submitAdminAccessAttempt with an incorrect code returns exactly \"Access Denied\" and does not grant admin privileges.",
        "The master admin access code remains stored/verified in the backend canister as 7583A (no frontend hardcoding required for verification)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Admin Access page (/admin-access) so it does NOT require an Internet Identity login. Users should be able to type the 5-character access code, submit it, see “Access Granted,” and be automatically redirected into the full admin dashboard UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Administrative access should not require an Internet Identity login.",
          "...clicking the admin page button it should take you to where it says administrative access, it says five character access code you should be able to type in the code hit submit it's a access granted and it take you to the full UI admin dashboard with all of the features and the tools..."
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin-access shows the “Administrative Access” UI and a 5-character code input without any Internet Identity login prompt or login requirement.",
        "Submitting the correct code results in visible success text \"Access Granted\" and an automatic redirect to /admin (or equivalent admin dashboard route) without any additional authentication steps.",
        "Submitting an invalid code displays an English error message and does not redirect.",
        "The page continues to enforce that the access code must be exactly 5 characters before submission."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Admin Dashboard route (/admin) gating so that entering the correct admin access code is sufficient to render the full admin dashboard UI with all existing tools/features, without requiring Internet Identity login.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "...it should take you to the full UI admin dashboard with all of the features and the tools, and full access to the admin dashboard with all of those tools and features included... I just have never been able to get into the dashboard yet!"
        ]
      },
      "acceptanceCriteria": [
        "After a successful code entry on /admin-access, navigating to /admin renders the existing AdminDashboardShell and its sections (home/shop/coupons/portfolio/testimonies/requests/inbox/security) without requiring Internet Identity login.",
        "Directly visiting /admin while the session is not unlocked redirects the user to /admin-access.",
        "After successful entry, /admin shows the existing “Access Granted” toast/confirmation behavior (or equivalent) and the dashboard remains usable for the session."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Backend must remain single-actor; implement changes in backend/main.mo only. Create backend/migration.mo only if state schema changes are required (avoid if not needed).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing a new authentication provider or third-party auth (only code-based admin access change is in scope).",
    "Adding new admin dashboard tools/features beyond making the existing dashboard accessible.",
    "Changing the master admin code value (must remain 7583A)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}