{
  "kind": "build_request",
  "title": "Correct Lore and Knowledge tab label across admin dashboard and Lore page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update user-facing text so the site consistently uses the label \"Lore and Knowledge\" (with \"and\", not \"&\") wherever this page/tab is named (including the top navigation link, the Lore page title/heading, and any related intro text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-15"
        ],
        "quotes": [
          "That is supposed to say Lore and knowledge tab and build it cuz I fixed my typo!"
        ]
      },
      "acceptanceCriteria": [
        "Top navigation displays the link label exactly as \"Lore and Knowledge\".",
        "The Lore page (currently at route \"/lore\") renders page title and primary heading exactly as \"Lore and Knowledge\".",
        "No remaining user-facing occurrences of \"Lore & Knowledge\" remain for this page/tab label (excluding code identifiers/filenames)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Admin Dashboard left sidebar tab label is spelled \"Lore and Knowledge\" (correcting the previously-typed \"lure\" typo), and that the tab list includes a \"Lore and Knowledge\" entry (exact capitalization) in the admin navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13",
          "msg-15"
        ],
        "quotes": [
          "there should be a lure and knowledge tab which is the blog below the testimonies tab",
          "That is supposed to say Lore and knowledge tab and build it cuz I fixed my typo!"
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard sidebar includes a tab labeled exactly \"Lore and Knowledge\".",
        "There are no user-facing references to \"Lure and knowledge\" in the admin UI."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn UI sources).",
    "Do not modify files listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Implementing Stripe payments, flippable shop cards, or other previously discussed Phase One e-commerce features.",
    "Adding new blog CMS functionality (posts can remain static as currently implemented)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}