{
  "kind": "build_request",
  "title": "Phase 5D — Customer order tracking in Dashboard with admin-controlled status, timestamps, locations, and pop-up notes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the backend order data model to persist order-tracking information per order, including: (a) a tracking status with the allowed values pending, processing, ready for pickup, out for delivery, completed; (b) a status-change history with timestamps for each change; (c) a list of manual admin-entered location updates with timestamps (no GPS); (d) a list of admin-authored pop-up notes/messages with timestamps; and (e) a fulfillment method that can represent delivery vs pickup vs drop-off, with pickup/drop-off intended only for the Ashland/Westwood Kentucky area.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-7",
          "recent-10",
          "recent-12"
        ],
        "quotes": [
          "Status: pending, processing, ready for pickup, out for delivery, completed.",
          "Replace it with manual admin entered location updates instead!",
          "pick up and drop off is only available for the Ashland Westwood Kentucky area,  we should be pop up messages that admins custom make!"
        ]
      },
      "acceptanceCriteria": [
        "Backend can store and return tracking status, status-change history (with timestamps), location updates, and pop-up notes for every order.",
        "Tracking status is restricted to exactly the specified set of statuses.",
        "Location updates are purely manual text entries (no GPS, no external APIs).",
        "Fulfillment method supports delivery/pickup/drop-off; pickup/drop-off can be recorded for an order and is labeled as Ashland/Westwood Kentucky area-specific in returned data."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend admin-only methods to manage order tracking: admins can (a) set/update an order’s tracking status; (b) add a manual location update to an order; and (c) add a custom pop-up note/message to an order. Each mutation must append an entry with a timestamp to the appropriate history/log so customers can see when changes happened.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-7",
          "recent-10",
          "recent-12"
        ],
        "quotes": [
          "admins should be able to change these automatically whenever they want",
          "Replace it with manual admin entered location updates instead!",
          "we should be pop up messages that admins custom make!"
        ]
      },
      "acceptanceCriteria": [
        "Non-admin callers are rejected when attempting to update any order’s tracking status, location updates, or pop-up notes.",
        "Each admin change creates an immutable history entry with a timestamp (for status changes, location updates, and pop-up notes).",
        "A customer can only read tracking information for their own orders; admins can read tracking information for all orders."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update backend order read APIs used by the frontend so that the customer order list and admin order list include the tracking data needed for Phase 5D (current status, the computed/derived next status, timestamps/history, location updates, pop-up notes, and fulfillment method). Updates must appear for customers when they refresh (no real-time push).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-5",
          "recent-7"
        ],
        "quotes": [
          "Updates appear on refresh.",
          "Customers track orders via dashboard or link."
        ]
      },
      "acceptanceCriteria": [
        "Refreshing the Dashboard orders query after an admin update returns the updated tracking status and histories.",
        "No real-time mechanism is added (no websockets, no GPS, no push updates).",
        "Existing order listing queries remain functional and now return tracking information needed by the UI."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement a customer-facing order tracking view inside the existing customer Dashboard (dashboard-only access): for each order, show the current tracking status prominently, show the next status as locked/preview until the admin advances the order, and display timestamps for each status change. Also display the latest admin pop-up note(s) and the list of manual location updates (each with timestamp).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7",
          "recent-12"
        ],
        "quotes": [
          "Through the customer dashboard only",
          "Customers see the current status and then the next one only after admins update it. ... Timestamps will be recorded for each status change.",
          "we should be pop up messages that admins custom make!"
        ]
      },
      "acceptanceCriteria": [
        "Order tracking is accessible only via the existing Dashboard page (no public tracking link is added).",
        "For each order, the UI shows: current status; the next status (if any) as not-yet-active until the order is advanced by an admin; and a status history with timestamps.",
        "The UI shows admin-authored pop-up note messages for the order (at minimum the most recent one) and manual location updates with timestamps.",
        "Data updates are visible after manual refresh/refetch (consistent with current React Query patterns)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Enhance the Admin orders experience so admins can update order tracking from the admin dashboard: provide a per-order detail UI to (a) change the tracking status, (b) add a manual location update, and (c) add a custom pop-up note/message. Ensure the admin UI makes it clear that customers only see progression after admin updates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7",
          "recent-12"
        ],
        "quotes": [
          "admins should be able to change these automatically whenever they want",
          "we should be pop up messages that admins custom make!"
        ]
      },
      "acceptanceCriteria": [
        "From the Admin page orders tab, an admin can select an order and submit tracking updates (status, location update, pop-up note).",
        "After a successful admin mutation, relevant React Query caches are invalidated/refetched so both admin and customer views reflect the change on refresh.",
        "Admin inputs are validated client-side for empty strings where applicable (e.g., note body/location text)."
      ]
    }
  ],
  "constraints": [
    "Do not add GPS, geolocation, maps, or any real-time location tracking; location updates must be manual admin-entered text.",
    "Do not integrate any weather API; pickup/drop-off area handling must be represented without external services.",
    "Keep all Motoko logic in the single backend actor (backend/main.mo).",
    "Do not edit files under frontend immutablePaths (including frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui)."
  ],
  "nonGoals": [
    "Public order-tracking links outside the customer Dashboard.",
    "Real-time updates (WebSockets/push notifications/live driver tracking).",
    "Automatic status progression based on external delivery systems or GPS.",
    "Weather display or weather-based logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}