{
  "kind": "build_request",
  "title": "Phase 6B: Admin Dashboard Control Center (full tabs after login)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Expand the existing /admin dashboard so that after Internet Identity login + successful Admin Access unlock, admins can access a single control-center UI that includes sections for: Requests, Orders, Testimonies, Messaging, Coupons, Analytics, and System Settings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Phase 6B — Admin Dashboard Control Center After login, admins gain access to the complete dashboard including requests, orders, testimonies, messaging, coupons, analytics, and system settings. Build."
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin as a logged-in admin who has unlocked Admin Access (via /admin-access) shows a dashboard with navigation for all 7 sections: Requests, Orders, Testimonies, Messaging, Coupons, Analytics, System Settings.",
        "The existing sections (Orders, Requests, Testimonies) remain functional and unchanged in behavior.",
        "All user-facing labels for the new sections are in English and consistent with the existing admin UI tone."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement an Admin Messaging section in the admin dashboard that lets admins review customer inbox items and send new admin-to-customer messages (including attachments if supported by existing attachment components).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "...including ... messaging ..."
        ]
      },
      "acceptanceCriteria": [
        "Admins can open the Messaging section and see a list of message threads or inbox items that clearly identifies the customer (Principal) and message content/type/time (where available).",
        "Admins can send a message to a selected customer; successful send results in the new message appearing in the UI after refresh or automatic query invalidation.",
        "If attachments are enabled in the UI, invalid files are rejected using the existing validation behavior and the UI shows upload/progress states consistent with existing patterns (e.g., MessageAttachmentPicker)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement an Admin Coupons section in the admin dashboard that allows admins to view coupons and perform coupon management actions already supported by the backend (e.g., create coupon, toggle validity) and to send coupons to customers when supported by existing workflows.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "...including ... coupons ..."
        ]
      },
      "acceptanceCriteria": [
        "Admins can open the Coupons section and see a list of coupons with code, discount, and validity status.",
        "Admins can create a coupon and the coupons list updates after creation.",
        "Admins can toggle coupon validity and the UI reflects the updated status after the mutation completes.",
        "If sending coupons to customers is supported by existing backend/workflows, the Coupons section provides a way to select a customer and send a coupon, and the customer receives a corresponding inbox item visible on the customer Inbox page."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement an Admin Analytics section in the admin dashboard that displays an analytics snapshot using existing analytics query/mutation patterns, with clear loading/error states.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "...including ... analytics ..."
        ]
      },
      "acceptanceCriteria": [
        "Admins can open the Analytics section and see an analytics snapshot card/grid with key metrics returned by the backend.",
        "The section shows a non-blocking loading state while data is fetched and a recoverable error state if fetching fails.",
        "A manual refresh action is available and triggers a refetch (or React Query invalidation) for the analytics snapshot."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement a System Settings section in the admin dashboard that centralizes system-level tools (e.g., store configuration, health/status, audit logs) and enforces appropriate permissions for sensitive actions.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "...including ... system settings."
        ]
      },
      "acceptanceCriteria": [
        "Admins can open System Settings and view system status information (e.g., health check info) and admin audit data that is already collected (e.g., admin access log, login attempts, event logs) where supported by the backend.",
        "Sensitive mutations (e.g., changing global store configuration, admin registry changes, password resets) are either (a) available only to the owner, or (b) clearly blocked with an explicit English message indicating owner-only access, while still allowing admins to view non-sensitive settings.",
        "All settings/audit panels have consistent empty/loading/error states and do not crash if a particular endpoint is unavailable."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add/verify backend canister methods required by the new Admin dashboard sections (Messaging, Coupons, Analytics, System Settings), ensuring they are admin-gated and return stable, frontend-consumable types.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "...complete dashboard including ... messaging, coupons, analytics, and system settings."
        ]
      },
      "acceptanceCriteria": [
        "All admin-only query/mutation endpoints used by the new tabs enforce admin checks (and owner checks where required) and trap with clear unauthorized messages when violated.",
        "Messaging endpoints support listing relevant inbox items across customers (admin view) and sending an inbox item/message to a customer.",
        "Coupon endpoints support listing, creating, and toggling validity; if coupon-sending is supported, it creates a customer inbox item consistently.",
        "Analytics/system endpoints support returning a snapshot and basic system status/audit log data (e.g., healthCheck, getAdminAccessLog, getLoginAttempts, getEvents)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo; add backend/migration.mo only if existing stable state must be upgraded.",
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable frontend hook files listed in SYSTEM_CONTEXT (compose via new hooks/components instead)."
  ],
  "nonGoals": [
    "Implementing Phase 6C multi-admin adjustable permission levels (separate phase).",
    "Third-party auth providers (only Internet Identity).",
    "Real-time messaging via WebSockets or push notifications.",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}