{
  "kind": "build_request",
  "title": "Phase 4: Owner-only Admin+ controls (owner config, admin registry, shop disable UI+backend blocking, pricing/stock overrides, coupon master switch, analytics)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Implement owner identification via a dedicated owner record stored in backend configuration (manually set during initial deployment), and use this stored owner identity as the sole authority for accessing the Admin+ tab and owner-only backend methods.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Use a dedicated owner record stored in the backend configuration. The owner account should be manually set (or defined during initial deployment) rather than automatically assigning the first registered user. Only this stored owner identity can access the Admin+ tab."
        ]
      },
      "acceptanceCriteria": [
        "Backend stores a single owner Principal in persistent state (no auto-assignment of first user).",
        "`isCallerOwner()` returns true only when `caller` equals the stored owner Principal (not when caller is merely an admin).",
        "Owner-only backend methods trap for non-owner callers with a clear English error message.",
        "There is a backend method to read the configured owner Principal (owner-only) and a backend method to set/update the owner Principal (owner-only or explicitly restricted to an initial unconfigured bootstrap state)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Implement a dedicated admin registry in the backend that stores each user Principal with role flags (Admin / Owner), independent of normal user profile records, and use it for promotions/demotions and role checks.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Store admin accounts in a dedicated admin registry in the backend that contains each user identity along with role flags (Admin / Owner). This allows promotion and demotion without affecting normal user records."
        ]
      },
      "acceptanceCriteria": [
        "Backend maintains an admin registry keyed by Principal with at least: `isAdmin` and `isOwner` (or an equivalent role enum that can represent owner vs admin).",
        "Promoting/demoting admins updates the admin registry without changing user profile records.",
        "Existing admin role assignment/removal endpoints are updated or replaced so that only the owner can promote/demote admins (owner may also demote admins).",
        "Frontend role checks for Admin+ use the owner check (not generic admin).",
        "If backend state schema changes are required, add a conditional migration so upgrades do not trap and existing data remains readable."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Extend the Admin+ page to include an owner-only Admin+ tab set with controls for: Change Admin Passwords, Promote/Demote Admins, Override Product Pricing, Force Stock States (in-stock/out-of-stock/hidden), Enable/Disable Coupons Globally, Emergency Shop Disable Switch, and Site Analytics Snapshot.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Create a new Admin+ tab visible only to the site owner that provides master-level control over the entire platform.",
          "Create an Admin+ tab visible only to the owner that includes the following controls:",
          "Build it!"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/pages/AdminPlus.tsx` includes tabs/sections for all Phase 4 owner controls listed in the user request (not only portfolios/testimonies).",
        "Admin+ remains gated by the existing `RequireOwner` component and uses `useIsCallerOwner` for visibility/authorization decisions.",
        "All user-facing labels/messages in the new Admin+ UI are in English.",
        "The previously-empty Admin+ placeholder section components are implemented and rendered where appropriate (e.g., `frontend/src/components/adminplus/AdvancedShopControlsSection.tsx`, `frontend/src/components/adminplus/CouponManagerSection.tsx`)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Implement the Emergency Shop Disable Switch as a backend-enforced feature flag that (1) hides the entire storefront and checkout UI from customers and (2) blocks backend order-creation calls so purchases cannot be made even via direct API calls.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The Shop Disable Switch must do both:\n\n1. Hide the entire storefront and checkout UI from customers.\n2. Block backend order-creation calls so purchases cannot be made even through direct API or external requests."
        ]
      },
      "acceptanceCriteria": [
        "Backend stores a persistent `shopDisabled` (or equivalent) flag and exposes owner-only methods to get/set it.",
        "Backend `createOrder(...)` traps with a clear English message when the shop is disabled, regardless of caller or frontend behavior.",
        "Frontend Shop page (`frontend/src/pages/Shop.tsx`) does not render product listing, product details, cart drawer, or checkout entry points when the shop is disabled; instead it shows a clear maintenance/disabled message in English.",
        "Any frontend code path that initiates order creation is prevented when shop is disabled (in addition to the backend enforcement).",
        "Owner can toggle the shop disable switch from Admin+ and the Shop page reflects the change after refresh or query invalidation."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Add owner controls to override product pricing without editing the main product listing, and ensure public product queries return the effective price (base price plus any active override).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4"
        ],
        "quotes": [
          "Override Product Pricing: Allows the owner to temporarily or permanently adjust product prices without editing the main product listing."
        ]
      },
      "acceptanceCriteria": [
        "Backend persists price overrides separately from the core Product record (so base product listing remains unchanged).",
        "Backend provides owner-only methods to set, clear, and read price overrides per product.",
        "Public product query endpoints used by the Shop UI return the effective price (override if present; otherwise base price).",
        "Admin+ UI includes a per-product control to set/clear an override price and clearly indicates whether an override is active."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Add owner controls to force stock states (in-stock, out-of-stock, hidden) independently of normal inventory fields, and ensure hidden products are not displayed to customers.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4"
        ],
        "quotes": [
          "Force Stock States: Lets the owner manually set products to in-stock, out-of-stock, or hidden regardless of automated inventory settings."
        ]
      },
      "acceptanceCriteria": [
        "Backend persists a per-product forced stock state override distinct from the existing stock/isInStock fields.",
        "Public product queries used by customers reflect the effective availability: forced hidden products are excluded, and forced in/out-of-stock is reflected in the returned product data.",
        "Admin+ UI includes a per-product forced stock state selector with options: In stock, Out of stock, Hidden, and a way to clear the override (return to normal behavior).",
        "If a migration is required to support new fields/structures, add a conditional migration so upgrades do not trap."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Implement a global coupons enable/disable master switch controlled by the owner; when disabled, coupon validation and coupon application are blocked across the store.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4"
        ],
        "quotes": [
          "Enable / Disable Coupons Globally: Provides a master switch to turn all coupon usage on or off across the entire store."
        ]
      },
      "acceptanceCriteria": [
        "Backend stores a persistent `couponsEnabled` (or equivalent) flag and exposes owner-only methods to get/set it.",
        "When coupons are globally disabled, backend coupon validation returns an invalid result with an English message and `createOrder(...)` does not apply discounts even if a coupon code is supplied.",
        "Admin+ UI includes a clear toggle for enabling/disabling coupons globally and shows the current state.",
        "Shop/cart coupon UI (wherever coupon codes are entered/validated) reflects the disabled state (e.g., disables coupon input or shows an English message) while still relying on backend enforcement."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Implement Promote/Demote Admins as owner-only actions using the backend admin registry, including UI controls within Admin+ to manage admin principals.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4"
        ],
        "quotes": [
          "Promote / Demote Admins: Enables the owner to grant admin access to users or remove admin permissions instantly."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes owner-only methods to list admin registry entries, add/promote an admin principal, and demote/remove an admin principal.",
        "Admin+ UI provides a form to enter a Principal (text) to promote/demote, validates formatting client-side, and shows success/error feedback in English.",
        "After changes, relevant cached queries are invalidated so admin-only areas reflect updated permissions on next access.",
        "Non-owner callers cannot promote/demote admins (backend traps with clear English authorization errors)."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Implement Change Admin Passwords as an owner-only capability in Admin+ with backend storage and an admin-facing flow that uses the updated password to access admin-only functionality.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4"
        ],
        "quotes": [
          "Change Admin Passwords: Allows the owner to securely reset or update any admin login password at any time."
        ]
      },
      "acceptanceCriteria": [
        "Backend provides owner-only methods to set/reset an admin password for a given admin principal and to clear it (if supported).",
        "Passwords are not returned in plaintext by any backend method.",
        "Admin+ UI allows the owner to select/enter an admin principal and set/reset that admin’s password with English success/error feedback.",
        "There is an admin-facing UI step that requires the admin password for accessing admin-only capabilities (or a clearly defined subset), and the password check is enforced by the backend (not only frontend)."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Add a Site Analytics Snapshot section to Admin+ that shows a quick overview of total orders, recent activity, and sales summaries based on backend order data.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4"
        ],
        "quotes": [
          "Site Analytics Snapshot: Displays a quick overview of total orders, recent activity, sales summaries, and basic performance metrics for fast monitoring."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an owner-only query that returns an analytics snapshot derived from stored orders (e.g., total order count, total sales sum, last N orders summary).",
        "Admin+ UI displays the analytics snapshot in a readable summary card/table with English labels and handles loading/error states.",
        "Snapshot values update after new orders are created (after query invalidation or refresh)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in `backend/main.mo`); only add `backend/migration.mo` changes if required for state upgrades.",
    "Do not edit frontend files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding external databases or off-chain analytics services.",
    "Real-time updates via WebSockets/push notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}