{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Phase 6A Admin Access Code Gate (Frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an Admin Access page and gate the Admin Dashboard behind successful master-code entry (7583A).",
      "acceptanceCriteria": [
        "A new route/page exists for Admin Access (e.g., \"/admin-access\") with an input for the master access code and a submit action.",
        "Attempting to open the admin dashboard route (currently \"/admin\") without a successful master-code validation sends the user to the Admin Access page (or shows a blocking gate).",
        "Submitting any code other than \"7583A\" shows an explicit Access Denied state and does not unlock admin dashboard access.",
        "Submitting the correct code unlocks access and then allows the user to enter the existing Admin Dashboard UI at \"/admin\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminAccess.tsx",
          "operation": "create",
          "description": "Create the Admin Access Page UI at \"/admin-access\" with a master-code input and submit action. Use the authorization component’s existing role-based gating (e.g., existing RequireAdmin behavior) to ensure only Internet Identity admins can reach code entry; show an explicit Access Denied state on incorrect code. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/RequireAdminAccessGate.tsx",
          "operation": "create",
          "description": "Create a small gate component for \"/admin\" that checks session-scoped unlocked state; if not unlocked, redirect/navigate to \"/admin-access\" (blocking admin dashboard rendering until unlocked). Use the authorization component’s existing admin gating to ensure non-admins see Access Denied consistent with RequireAdmin. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Wrap the existing Admin dashboard content with the new RequireAdminAccessGate so direct navigation to \"/admin\" is blocked until the access code is validated for the session; preserve existing RequireAdmin behavior for admin role checks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new \"/admin-access\" route and lazy-load the new AdminAccess page; ensure routing wiring is complete and the new page is reachable. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Call backend admin-code verification and persist unlocked state in session storage; clear on logout.",
      "acceptanceCriteria": [
        "Admin Access Page calls the backend verify method and only unlocks on a successful response.",
        "Unlocked state is stored in session-scoped browser storage (e.g., sessionStorage) and is checked by the admin-gating logic before rendering \"/admin\".",
        "Logging out of Internet Identity clears the unlocked state so the user must re-enter the master code after the next login to access \"/admin\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/adminAccessSession.ts",
          "operation": "create",
          "description": "Add a tiny helper module to read/write/clear the admin unlocked flag using sessionStorage (session-scoped), to be shared by the Admin Access Page, the \"/admin\" gate, and logout cleanup. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminAccess.tsx",
          "operation": "modify",
          "description": "Wire the submit action to call the backend capability verifyAdminAccess(inputCode) via the existing actor (from useActor). On success, set the session unlocked flag and navigate to \"/admin\"; on failure, keep locked and show Access Denied. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/RequireAdminAccessGate.tsx",
          "operation": "modify",
          "description": "Use the shared adminAccessSession helper to check session unlocked state before rendering the Admin dashboard; if locked, redirect the user to \"/admin-access\". Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "On logout (existing Internet Identity clear flow), also clear the admin unlocked session flag (via the new adminAccessSession helper) so the master code must be re-entered after the next login. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Clarify the two-step admin entry UX (II admin role + master access code) in English without editing immutable paths.",
      "acceptanceCriteria": [
        "If a user is not logged in, they are prompted to log in via the existing authentication flow before they can use the Admin Access Page.",
        "If a user is logged in but not an admin, they see an Access Denied state (reusing the existing `RequireAdmin` behavior) and cannot proceed to code entry.",
        "If a user is an admin but has not entered the master code in the current session, the UI clearly instructs them to enter the master code to continue to the dashboard.",
        "No changes are requested to files listed in `SYSTEM_CONTEXT.frontend.immutablePaths` (any new gating is implemented via new components/pages and composition)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminAccess.tsx",
          "operation": "modify",
          "description": "Add English instructional copy that explains the two-step requirement (Internet Identity admin role + master access code) and what happens after successful verification; ensure unauthenticated/non-admin handling is achieved via composition with existing RequireAdmin. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/HeaderNav.tsx",
          "operation": "modify",
          "description": "Update the Admin navigation entry for admins to point to the Admin Access Page (\"/admin-access\") so the user sees the two-step security messaging before attempting to reach the dashboard. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}