{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Phase 6A (Frontend): Admin access gateway page, responsive Admin nav link, session gate protection, and logout gate reset",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Harden /admin-access UI to verify the five-character master code and set a session unlock flag, showing only \"Access Denied\" on any failure without disclosing security details.",
      "acceptanceCriteria": [
        "Visiting /admin-access shows a form with a single code input limited to 5 characters.",
        "Submitting an incorrect code results in only the text \"Access Denied\" being shown; no other explanatory text is displayed.",
        "Submitting the correct code routes the user to /admin and the admin dashboard renders in the same session without re-entering the code.",
        "All user-facing text on the page is in English and does not disclose security/audit details (no mention of roles, principals, timestamps, logging, or multi-step verification)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminAccess.tsx",
          "operation": "modify",
          "description": "Update the Admin Access Page UI copy and validation to enforce exactly 5 characters (maxLength=5 and submit disabled until length is 5). On any failure (invalid code, empty/short code submission, or verification error), render only the exact message \"Access Denied\" (no prefixes/suffixes, no extra help text). Remove any text that reveals security implementation/audit details (e.g., two-step verification, logging, principals, roles). Keep success behavior: call verifyAdminAccess, set the session unlock via setAdminAccessUnlocked(), then navigate to /admin. Use the authorization component’s existing frontend auth patterns via the existing RequireAdmin wrapper to ensure only authenticated admins can reach this page; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an \"Admin\" navigation link that routes to /admin-access in both desktop top nav and mobile hamburger menu without disrupting existing navigation.",
      "acceptanceCriteria": [
        "On narrow viewports, opening the hamburger menu shows an \"Admin\" link that navigates to /admin-access.",
        "On large viewports, the top nav link row includes an \"Admin\" text link (not icon-only) that navigates to /admin-access.",
        "Existing navigation links and behavior remain intact."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/HeaderNav.tsx",
          "operation": "modify",
          "description": "Extend (do not replace) existing navigation by adding a text link labeled exactly \"Admin\" pointing to /admin-access in (1) the desktop main navigation link row and (2) the mobile hamburger menu list. Ensure the desktop presentation is text (not icon-only). Keep existing links and behavior intact; if an admin-only icon button remains, it must not be the only desktop route to /admin-access. Verify the authorization component’s usage instructions before implementing any auth-aware visibility rules."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure /admin stays protected by the existing session-based admin access gate so the dashboard cannot render unless the gate is unlocked in the current browser session.",
      "acceptanceCriteria": [
        "Direct navigation to /admin without having unlocked the access gate during the current session redirects the user to /admin-access or otherwise prevents rendering of the dashboard content.",
        "After a successful unlock, navigating to /admin works for the remainder of the browser session (until session end or explicit logout/session clear).",
        "No existing Admin Dashboard tabs/features are removed or replaced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/RequireAdminAccessGate.tsx",
          "operation": "modify",
          "description": "Confirm and tighten the existing gate behavior so that when admin access is not unlocked it reliably prevents dashboard rendering and navigates to /admin-access, including on direct navigation/refresh. Keep the implementation as an extension of the existing session gate (isAdminAccessUnlocked) rather than replacing the Admin dashboard. Verify the authorization component’s usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Ensure the Admin Dashboard remains wrapped with the existing RequireAdmin and RequireAdminAccessGate wrappers so /admin cannot render without both admin role authorization and a session-unlocked access gate. Preserve all existing dashboard tabs/features. Verify the authorization component’s usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Clear session-scoped \"admin access unlocked\" state on logout so subsequent sessions require re-entering the master code.",
      "acceptanceCriteria": [
        "After successfully unlocking admin access, logging out and then logging back in requires re-entering the master code before /admin can be accessed in that session.",
        "No other session/local-storage state unrelated to the admin access gate is unintentionally cleared beyond current logout behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Verify logout behavior continues to clear the admin access gate state by calling clearAdminAccessUnlocked() as part of the existing logout flow (alongside existing cache/session clearing), without clearing unrelated storage beyond current behavior. Verify the authorization component’s usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/adminAccessSession.ts",
          "operation": "modify",
          "description": "Confirm the session gate utilities continue to use session-scoped browser storage and provide a reliable clear function used on logout. Ensure naming/behavior matches the existing gate mechanism and remains session-scoped. Verify the authorization component’s usage instructions before implementing."
        }
      ]
    }
  ]
}