{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Contact social bubble URLs and clickable bubble interactions",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Point each Contact page social-media bubble to the exact user-provided profile URL and open safely in a new tab.",
      "acceptanceCriteria": [
        "In frontend/src/pages/Contact.tsx, the Facebook bubble uses href=\"https://www.facebook.com/share/1NmZG6UTZQ/\".",
        "In frontend/src/pages/Contact.tsx, the YouTube bubble uses href=\"https://youtube.com/@thecreatorofsidequests?si=NDOq7CkgZu5Mxf_7\".",
        "In frontend/src/pages/Contact.tsx, the TikTok bubble uses href=\"https://www.tiktok.com/@thecreatorofsidequests?_r=1&_t=ZT-93pCF5bOGo1\".",
        "In frontend/src/pages/Contact.tsx, the Instagram bubble uses href=\"https://www.instagram.com/thecreatorofsidequests?igsh=Y2Y1OTE4ZWN1Y3I3\".",
        "All bubbles keep target=\"_blank\" and rel=\"noopener noreferrer\" so they open safely in a new tab."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Update the four social icon <a> tags in the Contact Information card to use the exact provided Facebook/YouTube/TikTok/Instagram profile URLs, while retaining target=\"_blank\" and rel=\"noopener noreferrer\"."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make Contact page social-media bubbles clearly clickable with circular hit areas plus theme-consistent hover and keyboard focus states.",
      "acceptanceCriteria": [
        "Each social icon link on the Contact page has a circular clickable area (e.g., equal height/width with rounded-full) that is comfortably tappable on mobile.",
        "Each bubble has a visible hover state and a visible keyboard focus style (e.g., focus-visible ring) without breaking existing layout.",
        "Icons remain accessible with appropriate aria-labels and do not trigger contact form submission."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Adjust the social icon links to render as true \"bubble\" buttons: apply circular sizing (equal width/height), rounded-full hit area, and add theme-consistent hover + focus-visible styling (including a visible focus ring) while preserving aria-label accessibility and ensuring the links remain non-submit controls (keep them as anchors outside the form)."
        }
      ]
    }
  ]
}