{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "About page rewrite for “The Creator of Side Quests” + randomized quotes on all routes",
  "requirements": [
    {
      "id": "REQ-53",
      "summary": "Replace /about with the user-provided “The Creator of Side Quests” About copy (verbatim narrative block, labeled Mission & Vision) and remove remaining “Arcane Artifacts” branding from the About page.",
      "acceptanceCriteria": [
        "The /about route renders with a page title and description aligned to “The Creator of Side Quests” (no remaining “Arcane Artifacts” branding on the About page).",
        "The About page contains the provided narrative block exactly as written (including punctuation and emojis) and is presented as readable, multi-paragraph website copy.",
        "The Mission Statement and Vision Statement appear clearly labeled on the About page and match the user-provided wording exactly.",
        "All user-facing text added/changed for this requirement is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/About.tsx",
          "operation": "modify",
          "description": "Rewrite the About page content to use the user-provided “The Creator of Side Quests” copy: update PageLayout title/description, render the narrative block verbatim as multi-paragraph readable website copy, and add clearly labeled Mission Statement and Vision Statement sections matching the provided wording exactly. Remove/replace any Arcane Artifacts-specific story/values/timeline/team content that conflicts with the new branding."
        },
        {
          "path": "frontend/src/components/layout/HeaderNav.tsx",
          "operation": "modify",
          "description": "Update the header’s visible branding text (currently “Arcane Artifacts”) to match “The Creator of Side Quests” where appropriate so navigation into /about aligns with the updated About page branding (keep routes/links unchanged)."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Centralize the 10 user-provided quotes verbatim and implement random selection that returns 2–3 non-repeating quotes per page load/render.",
      "acceptanceCriteria": [
        "The quotes data source includes all 10 quotes exactly as provided and does not alter quote text.",
        "The random quote selection returns either 2 or 3 quotes (configurable or deterministic) and never repeats the same quote within the same page render.",
        "No runtime errors occur when quote selection is invoked across routes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/quotes.ts",
          "operation": "create",
          "description": "Create a centralized quotes data module that exports the quotes array containing exactly the 10 user-provided strings (verbatim punctuation/quotes)."
        },
        {
          "path": "frontend/src/lib/randomQuotes.ts",
          "operation": "create",
          "description": "Add a small utility to select 2–3 quotes from the centralized quotes list without repeating within a single selection; expose a function suitable for use on route changes / page load."
        },
        {
          "path": "frontend/src/hooks/useRandomQuotes.ts",
          "operation": "create",
          "description": "Create a React hook that uses the random selection utility to produce 2–3 non-repeating quotes per route render/load (e.g., reseed on pathname change) and returns stable results during a single page view."
        }
      ]
    },
    {
      "id": "REQ-55",
      "summary": "Render randomized quotes (2–3) on every existing route including /about in an unobtrusive pull-quote/card style consistent with the site theme.",
      "acceptanceCriteria": [
        "Randomized quotes are visible on /about as well as all other existing routes (/, /services, /shop, /dashboard, /contact, /blog, /faq, /terms, /privacy, /admin).",
        "The quotes component styling remains consistent with the existing site theme and uses an unobtrusive pull-quote/card presentation.",
        "Quotes do not cause layout shift or overflow issues on mobile widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/quotes/RandomQuotes.tsx",
          "operation": "create",
          "description": "Create a quotes display component that renders 2–3 quotes using an unobtrusive pull-quote/card presentation (compose existing shadcn-ui Card/typography patterns; do not edit any files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire the randomized quotes to appear on every page by rendering the new RandomQuotes component within the global layout around the routed content (use current route location to trigger a new selection per page view). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal global utility classes (or extend existing utilities) to support the pull-quote/card layout spacing and responsive behavior (no overflow on mobile, reserved vertical space to prevent layout shift), without changing any immutable paths."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Ensure the frontend builds/typechecks successfully after About + quotes changes without changing immutable paths.",
      "acceptanceCriteria": [
        "Frontend TypeScript build completes without errors.",
        "Canister build completes without errors.",
        "No changes are made to any paths listed in frontend.immutablePaths.",
        "After the changes, the app runs locally (or in preview) and /about renders without runtime exceptions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify routing/lazy-loading still typechecks after About and global quotes wiring changes; adjust imports/types if needed to eliminate TypeScript and production-build errors (do not change route paths)."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Harden the global quotes rendering against runtime failures (e.g., empty quotes array) and confirm it does not interfere with existing layout structure across all routes."
        },
        {
          "path": "frontend/src/pages/About.tsx",
          "operation": "modify",
          "description": "Validate the updated About page content renders without runtime exceptions, maintains multi-paragraph readability, and does not rely on removed Arcane Artifacts sections/components."
        }
      ]
    }
  ]
}