{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Standardize \"Lore and Knowledge\" label across public navigation, Lore page, and admin dashboard sidebar",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace all user-facing occurrences of \"Lore & Knowledge\" with \"Lore and Knowledge\" across top navigation and the /lore page (including headings and intro text).",
      "acceptanceCriteria": [
        "Top navigation displays the link label exactly as \"Lore and Knowledge\".",
        "The Lore page (currently at route \"/lore\") renders page title and primary heading exactly as \"Lore and Knowledge\".",
        "No remaining user-facing occurrences of \"Lore & Knowledge\" remain for this page/tab label (excluding code identifiers/filenames)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/HeaderNav.tsx",
          "operation": "modify",
          "description": "Update the top navigation link label from \"Lore & Knowledge\" to \"Lore and Knowledge\" to match required wording everywhere this page/tab is named."
        },
        {
          "path": "frontend/src/pages/BlogLore.tsx",
          "operation": "modify",
          "description": "Update the PageLayout title from \"Lore & Knowledge\" to \"Lore and Knowledge\" and review/adjust the description/intro copy as needed to ensure related user-facing text consistently uses \"Lore and Knowledge\" wording."
        },
        {
          "path": "frontend/src/components/intro/LoreKnowledgeIntro.tsx",
          "operation": "modify",
          "description": "Update the primary heading text from \"Lore & Knowledge\" to \"Lore and Knowledge\" and ensure any related intro text remains English and consistent with the new label."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Update the footer quick link label for the lore page to \"Lore and Knowledge\" to keep site-wide naming consistent wherever this page is referenced."
        },
        {
          "path": "frontend/src/components/home/QuickLinksGrid.tsx",
          "operation": "modify",
          "description": "Update the homepage quick link title/description for the lore page to use \"Lore and Knowledge\" (and ensure the link continues to navigate to the lore content without introducing new routes)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add/rename the Admin Dashboard left sidebar entry so it includes a tab labeled exactly \"Lore and Knowledge\" and remove any \"lure\" typo from admin UI.",
      "acceptanceCriteria": [
        "Admin Dashboard sidebar includes a tab labeled exactly \"Lore and Knowledge\".",
        "There are no user-facing references to \"Lure and knowledge\" in the admin UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Extend the admin dashboard section type/section switch wiring to include a new section for Lore and Knowledge, and render a dedicated view when selected."
        },
        {
          "path": "frontend/src/components/adminDashboard/AdminSidebarNav.tsx",
          "operation": "modify",
          "description": "Add a new sidebar nav item labeled exactly \"Lore and Knowledge\" (correcting any prior \"lure\" typo) and wire it to the new admin dashboard section id so it appears in the left sidebar navigation."
        },
        {
          "path": "frontend/src/components/adminDashboard/views/AdminLoreKnowledgeView.tsx",
          "operation": "create",
          "description": "Create a lightweight admin dashboard view for \"Lore and Knowledge\" (read-only) that provides clear navigation context (e.g., link to the public /lore page) without adding CMS/blog management features (posts remain static as currently implemented)."
        }
      ]
    }
  ]
}