{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Phase 5D — Dashboard order tracking UI (customer view + admin controls)",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Add customer-facing order tracking UI inside the existing Dashboard orders tab (current status, locked next status preview, status timestamps/history, pop-up notes, and manual location updates).",
      "acceptanceCriteria": [
        "Order tracking is accessible only via the existing Dashboard page (no public tracking link is added).",
        "For each order, the UI shows: current status; the next status (if any) as not-yet-active until the order is advanced by an admin; and a status history with timestamps.",
        "The UI shows admin-authored pop-up note messages for the order (at minimum the most recent one) and manual location updates with timestamps.",
        "Data updates are visible after manual refresh/refetch (consistent with current React Query patterns)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the typed backend interface to include the order-tracking fields returned in order listings and any read methods the Dashboard relies on for: current tracking status, next/derived status preview, status-change history timestamps, manual location updates, and admin pop-up notes. Keep this aligned with backend return shapes so the UI can render tracking without `any`."
        },
        {
          "path": "frontend/src/types/orderTracking.ts",
          "operation": "create",
          "description": "Add frontend types/enums for the Phase 5D tracking domain (allowed statuses, history entry shape with timestamps, location update entry, pop-up note entry, fulfillment method label) to ensure the Dashboard UI can render consistently and restrict status labels client-side."
        },
        {
          "path": "frontend/src/components/dashboard/OrderTrackingPanel.tsx",
          "operation": "create",
          "description": "Create a Dashboard-only order tracking panel component that renders, per order: prominent current tracking status, a locked/preview next status indicator, a status history list with timestamps, the latest admin pop-up note(s), and manual location updates with timestamps. Use shadcn-ui components (e.g., Card, Badge, Alert, Accordion) for consistent presentation; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Wire the new OrderTrackingPanel into the existing Dashboard 'Orders' tab (no new route). Replace the static 'Completed' badge with tracking-driven rendering, add a manual Refresh/Refetch control that calls the existing `refetchOrders`, and ensure the next status is shown as locked/preview until backend advances it."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update `useGetMyOrders` consumption to use the new typed order tracking fields (while preserving existing query keys and refetch behavior). If helper selectors are needed for deriving the UI-friendly status/next-status display, add them in a frontend-safe way without introducing real-time behavior."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Enhance Admin orders UI with per-order detail controls to update tracking status, add manual location updates, and add pop-up notes, with client validation and React Query invalidation.",
      "acceptanceCriteria": [
        "From the Admin page orders tab, an admin can select an order and submit tracking updates (status, location update, pop-up note).",
        "After a successful admin mutation, relevant React Query caches are invalidated/refetched so both admin and customer views reflect the change on refresh.",
        "Admin inputs are validated client-side for empty strings where applicable (e.g., note body/location text)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Add typed backend function signatures needed by the admin UI for order tracking mutations (set/update tracking status, add manual location update, add pop-up note) so admin components can call these safely from React Query mutations."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query mutations for admin order tracking management (set status, add location update, add pop-up note). On success, invalidate/refetch `['allOrders']` and `['myOrders']` (and any order-detail keys introduced) so changes appear after refresh. Handle authorization failures gracefully in the UI by surfacing error messages."
        },
        {
          "path": "frontend/src/components/admin/AdminOrderTrackingDetailModal.tsx",
          "operation": "create",
          "description": "Implement a per-order detail modal that shows current tracking info and provides admin controls to: change tracking status (restricted to allowed values), add a manual location update (text + submit), and add a custom pop-up note/message (text + submit). Include copy that clarifies customers only see progression after admin updates. Use shadcn-ui components (Dialog, Select, Textarea, Button, Alert) to build the modal; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminOrdersTab.tsx",
          "operation": "modify",
          "description": "Wire the per-order detail UI into the Admin Orders tab by adding a 'View/Update Tracking' action per order that opens AdminOrderTrackingDetailModal, passing the selected order data. Ensure client-side validation blocks empty location/note submissions and disables submit while mutations are pending."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Ensure the enhanced orders experience remains within the existing admin dashboard (already gated by RequireAdmin). If any explanatory UI text is added at the page/tab level, keep it within the existing Admin Orders tab content (no new routes). Use the existing authorization/role gating approach (RequireAdmin) to keep admin-only controls restricted; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}