{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Testimony verification UI + Search Artifacts UI + controlled discoverability + responsive layout",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show newly submitted testimonies publicly immediately with a clear “Awaiting Admin Verification” status until approved, then reflect verified state in the UI.",
      "acceptanceCriteria": [
        "Submitting a testimony results in it appearing on the public Testimonies page with a visible \"Awaiting Admin Verification\" label/badge.",
        "After an admin approves a testimony, the public Testimonies page updates to show that testimony as verified/approved (no longer labeled \"Awaiting Admin Verification\").",
        "Admin approval action is available in the admin dashboard and persists in the backend so the status survives refresh/redeploy."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Testimonies.tsx",
          "operation": "modify",
          "description": "Stop filtering out unapproved testimonies for public display; render both approved and pending items and add a prominent English badge/label for pending items reading \"Awaiting Admin Verification\" while keeping approved items visually distinct."
        },
        {
          "path": "frontend/src/components/testimonies/CreateTestimonyDialog.tsx",
          "operation": "modify",
          "description": "Update English helper text and success toast to match the new behavior (appears immediately but marked as awaiting verification). Ensure messaging aligns with the public pending badge behavior."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Enable admins to review testimony status and approve pending testimonies from the Admin Testimonies UI with React Query invalidation and error handling.",
      "acceptanceCriteria": [
        "Admin testimonies tab shows each testimony’s current status.",
        "Pending testimonies have an \"Approve\" (or equivalent) control.",
        "Approving from the admin UI updates the item status without requiring a hard refresh (queries invalidate/refetch).",
        "Error states are handled using existing patterns (inline error + retry)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook for approving/verifying a testimony (calling the new backend capability), and invalidate/refetch relevant queries (admin list, public testimonies list, and any search-related queries that include testimonies)."
        },
        {
          "path": "frontend/src/components/admin/AdminTestimoniesTab.tsx",
          "operation": "modify",
          "description": "Add a clear status indicator (Pending vs Verified/Approved) and an \"Approve\" action for pending items. Use the new mutation hook and follow existing ErrorState/inline error + retry patterns; disable controls while pending; on success trigger query invalidation refresh."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a Search Artifacts UI with keyword search and category filtering (including “Testimonies”) that surfaces testimonies via backend indexing.",
      "acceptanceCriteria": [
        "A new Search Artifacts UI exists where users can enter a keyword query and see results.",
        "Search results support filtering by category, including \"Testimonies\".",
        "Newly submitted testimonies become searchable via Search Artifacts without manual re-entry.",
        "Search indexing includes testimony textual fields and per-media description text (photos/videos).",
        "The backend provides query methods needed for search and category filtering."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SearchArtifacts.tsx",
          "operation": "create",
          "description": "Create the Search Artifacts page UI with a keyword input, category filter (including \"Testimonies\"), loading/empty/error states, and a results list that can render testimony results. Use existing shadcn-ui components for inputs, selects, badges, cards, and skeletons. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useSearchArtifacts.ts",
          "operation": "create",
          "description": "Create React Query hooks for searching artifacts by keyword and category (including \"Testimonies\"), calling the backend-provided search capabilities and exposing typed loading/error state for the new page."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new route for the Search Artifacts page and ensure it is reachable via the router configuration (no orphan page)."
        },
        {
          "path": "frontend/src/components/layout/HeaderNav.tsx",
          "operation": "modify",
          "description": "Add a navigation link to the new Search Artifacts route in both desktop and mobile menus. Keep English labels and ensure the link is reachable without authentication for public search browsing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the testimony submission mutation to invalidate Search Artifacts queries so newly submitted testimonies can become discoverable through search as soon as backend indexing is updated."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure testimonies are discoverable publicly only on the Testimonies page and in Search Artifacts results (admin dashboard remains allowed).",
      "acceptanceCriteria": [
        "No other existing pages/components display testimony lists/cards/teasers by default.",
        "Only the Testimonies route and the Search Artifacts route surface testimonies to non-admin users.",
        "Admin dashboard may list testimonies for review, but public discovery outside Testimonies and Search Artifacts does not occur."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit and ensure there are no additional routes/pages wiring testimony lists outside of /testimonies and the new Search Artifacts route; keep testimonies surfaced only in those two public locations and the admin dashboard tab."
        },
        {
          "path": "frontend/src/pages/Homepage.tsx",
          "operation": "modify",
          "description": "Confirm homepage does not fetch or render testimonies; remove/avoid any testimony list/teaser wiring if present, keeping only navigation links (no public testimony surfacing outside the allowed pages)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Improve responsive layout across the site for navigation, pages, dashboards, forms, testimonies, and media grids so the UI works well on mobile/tablet/desktop/large screens.",
      "acceptanceCriteria": [
        "Key pages (Homepage, Shop, Submit Request, Admin, AdminPlus, Testimonies, Inbox, FAQ, Contact) render without horizontal overflow at common breakpoints.",
        "Header navigation works on touch devices (mobile menu opens/closes and is usable).",
        "Media grids (including testimony media) adapt columns appropriately and videos/images keep correct aspect ratios using responsive sizing classes.",
        "Forms and dialogs remain usable on small screens (no clipped content; scroll within dialogs where needed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/HeaderNav.tsx",
          "operation": "modify",
          "description": "Harden mobile navigation for touch: ensure tap targets are sufficiently large, menu content scrolls if needed, and prevent background scroll while the menu is open using the existing .body-scroll-lock utility class behavior."
        },
        {
          "path": "frontend/src/components/testimonies/TestimonyMediaCard.tsx",
          "operation": "modify",
          "description": "Make testimony media cards responsive: replace fixed heights with responsive sizing, maintain correct aspect ratios for images/videos, and ensure descriptions remain readable/scrollable on small screens."
        },
        {
          "path": "frontend/src/pages/Testimonies.tsx",
          "operation": "modify",
          "description": "Adjust testimonies layout for responsive breakpoints: ensure grids adapt cleanly, badges/status labels wrap correctly, and no horizontal overflow occurs on mobile while keeping media responsive."
        },
        {
          "path": "frontend/src/components/testimonies/CreateTestimonyDialog.tsx",
          "operation": "modify",
          "description": "Ensure the testimony submission dialog is fully usable on small screens (scroll within dialog, responsive spacing, touch-friendly buttons) and that all user-facing text remains in English."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust global responsive utilities where needed to prevent horizontal overflow and improve consistent spacing across breakpoints (without changing the overall theme beyond what’s necessary)."
        }
      ]
    }
  ]
}