{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend updates: permanent master admin code UX + admin settings copy",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "On /admin-access, treat 7583A (case/whitespace normalized) as an immediate success that redirects to /admin without showing access-denied.",
      "acceptanceCriteria": [
        "Entering 7583A on /admin-access shows \"Access Granted\" and navigates to /admin automatically.",
        "No \"Access Denied\" message is shown when the user enters 7583A (including case/whitespace variants that normalize to 7583A).",
        "Redirect happens automatically after success without requiring additional user interaction."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminAccess.tsx",
          "operation": "modify",
          "description": "Update admin access submission and UI gating so normalized input (trim + uppercase) equal to \"7583A\" short-circuits all lockout/denied paths: immediately set success UI state (showing exactly \"Access Granted\"), call setAdminAccessUnlocked(), and auto-navigate to \"/admin\". Ensure the lockout UI does not prevent entering the code (e.g., do not fully replace the form with a lockout-only screen), while keeping existing lockout behavior for all non-master codes."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Revise admin settings UI text to clearly state 7583A is a permanent master code and the editable form only changes a configurable secondary code.",
      "acceptanceCriteria": [
        "Admin access code settings section labeling/descriptions clearly state that \"7583A\" is permanent and cannot be changed.",
        "The update form is described as changing a configurable/secondary admin access code (while 7583A always remains valid).",
        "All user-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminAccessCodeSettingsSection.tsx",
          "operation": "modify",
          "description": "Update headings/descriptions/labels/button text and any success/error copy so the page explicitly states \"7583A\" is the permanent master admin code (cannot be changed) and the form updates only the configurable/secondary admin access code used for normal access. Ensure all user-facing text remains English and no copy implies 7583A is editable."
        },
        {
          "path": "frontend/src/components/adminDashboard/views/SecuritySettingsView.tsx",
          "operation": "modify",
          "description": "Update Security Settings copy (card title/description, labels, and toast messages where applicable) to present \"7583A\" as the permanent master admin code that cannot be changed, and clarify the form changes only the configurable/secondary admin access code while 7583A always remains valid. Keep all user-facing text in English."
        }
      ]
    }
  ]
}