{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Phase 4 Owner-only Admin+ controls (frontend-only)",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Expand Admin+ into an owner-only tabbed panel containing all Phase 4 owner controls and render implemented section components.",
      "acceptanceCriteria": [
        "`frontend/src/pages/AdminPlus.tsx` includes tabs/sections for all Phase 4 owner controls listed in the user request (not only portfolios/testimonies).",
        "Admin+ remains gated by the existing `RequireOwner` component and uses `useIsCallerOwner` for visibility/authorization decisions.",
        "All user-facing labels/messages in the new Admin+ UI are in English.",
        "The previously-empty Admin+ placeholder section components are implemented and rendered where appropriate (e.g., `frontend/src/components/adminplus/AdvancedShopControlsSection.tsx`, `frontend/src/components/adminplus/CouponManagerSection.tsx`)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPlus.tsx",
          "operation": "modify",
          "description": "Refactor Admin+ into a tab set that includes: Change Admin Passwords, Promote/Demote Admins, Override Product Pricing, Force Stock States/Hidden, Enable/Disable Coupons Globally, Emergency Shop Disable Switch, and Site Analytics Snapshot, while keeping existing Portfolios/Testimonies tabs. Ensure the page stays wrapped by RequireOwner and relies on useIsCallerOwner for owner-only gating. Use the authorization selected component patterns for owner gating and authorization-error handling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx",
          "operation": "modify",
          "description": "Implement the currently-empty placeholder as an owner-only Admin+ section UI that contains emergency shop disable toggle plus per-product controls for pricing overrides and forced visibility/availability states, using React Query hooks/mutations and English success/error messages. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/CouponManagerSection.tsx",
          "operation": "modify",
          "description": "Implement the currently-empty placeholder as an owner-only Admin+ section UI for the global coupons master switch (enabled/disabled), showing current state, mutation feedback, and English labels. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/AdminRegistrySection.tsx",
          "operation": "create",
          "description": "Create a new Admin+ section for Promote/Demote Admins with a Principal text input, client-side Principal format validation, and success/error feedback; wire to listAdmins/promote/demote hooks and invalidate relevant cached queries after changes. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/AdminPasswordResetSection.tsx",
          "operation": "create",
          "description": "Create a new Admin+ section for Change Admin Passwords with Principal input and password input, clear feedback, and safe handling so passwords are never displayed. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/AnalyticsSnapshotSection.tsx",
          "operation": "create",
          "description": "Create a new Admin+ section to fetch and display the site analytics snapshot (totals and summaries) with loading/error/empty states and English labels; ensure it can refresh/invalidate after order creation. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Hide storefront/checkout UI when shop is disabled and prevent order creation actions in the UI.",
      "acceptanceCriteria": [
        "Backend stores a persistent `shopDisabled` (or equivalent) flag and exposes owner-only methods to get/set it.",
        "Backend `createOrder(...)` traps with a clear English message when the shop is disabled, regardless of caller or frontend behavior.",
        "Frontend Shop page (`frontend/src/pages/Shop.tsx`) does not render product listing, product details, cart drawer, or checkout entry points when the shop is disabled; instead it shows a clear maintenance/disabled message in English.",
        "Any frontend code path that initiates order creation is prevented when shop is disabled (in addition to the backend enforcement).",
        "Owner can toggle the shop disable switch from Admin+ and the Shop page reflects the change after refresh or query invalidation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for reading and toggling the shop active/disabled state (using the backend's shop active state and store config capabilities). Ensure mutations invalidate any shop-state and product queries so the Shop page updates after toggles. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Shop.tsx",
          "operation": "modify",
          "description": "Query shop active/disabled state and, when disabled, render a clear English maintenance message and hide product list, product details modal, cart drawer, and any checkout entry points (including cart button). When enabled, keep existing behavior. Ensure state updates after refresh or query invalidation."
        },
        {
          "path": "frontend/src/components/shop/ShopCartDrawer.tsx",
          "operation": "modify",
          "description": "Add a shop-disabled guard: block checkout action and show an English message if the shop is disabled, even if the drawer is opened. Also ensure createOrder is never attempted from the UI when disabled."
        },
        {
          "path": "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx",
          "operation": "modify",
          "description": "Add an 'Emergency Shop Disable' owner toggle UI wired to the shop active/disabled state hooks, with clear English confirmation/status text and query invalidation so Shop reflects changes. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Provide owner UI to set/clear per-product price overrides and display override status in Admin+.",
      "acceptanceCriteria": [
        "Backend persists price overrides separately from the core Product record (so base product listing remains unchanged).",
        "Backend provides owner-only methods to set, clear, and read price overrides per product.",
        "Public product query endpoints used by the Shop UI return the effective price (override if present; otherwise base price).",
        "Admin+ UI includes a per-product control to set/clear an override price and clearly indicates whether an override is active."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/extend React Query mutations for setting and clearing per-product price overrides, and ensure the products list is invalidated after changes so effective prices refresh across Shop and any product UI. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx",
          "operation": "modify",
          "description": "Add per-product price override controls: show base price vs effective price, indicate whether an override is active, provide inputs to set an override price and a button to clear it, with English feedback and disabled states while saving. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Shop.tsx",
          "operation": "modify",
          "description": "Ensure all displayed product prices use the effective product price fields returned by public product queries (including list cards and any list-mode price display) so overrides are reflected to customers."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Provide owner UI to force per-product stock/visibility state and ensure hidden products do not appear in the customer Shop UI.",
      "acceptanceCriteria": [
        "Backend persists a per-product forced stock state override distinct from the existing stock/isInStock fields.",
        "Public product queries used by customers reflect the effective availability: forced hidden products are excluded, and forced in/out-of-stock is reflected in the returned product data.",
        "Admin+ UI includes a per-product forced stock state selector with options: In stock, Out of stock, Hidden, and a way to clear the override (return to normal behavior).",
        "If a migration is required to support new fields/structures, add a conditional migration so upgrades do not trap."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/extend React Query mutations for setting product visibility/availability states used by the Shop UI (e.g., visible/out-of-stock/hidden), and invalidate product queries after changes. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/AdvancedShopControlsSection.tsx",
          "operation": "modify",
          "description": "Add per-product forced stock/visibility selector UI with options In stock / Out of stock / Hidden plus a clear/reset action, showing current effective state and providing English feedback. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Shop.tsx",
          "operation": "modify",
          "description": "Ensure the customer-facing Shop UI does not display hidden products by relying on the effective product list returned from backend queries and adding a defensive client-side filter for hidden visibility if needed."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Add an owner-controlled global coupons enable/disable switch and reflect disabled state in coupon entry/validation UI.",
      "acceptanceCriteria": [
        "Backend stores a persistent `couponsEnabled` (or equivalent) flag and exposes owner-only methods to get/set it.",
        "When coupons are globally disabled, backend coupon validation returns an invalid result with an English message and `createOrder(...)` does not apply discounts even if a coupon code is supplied.",
        "Admin+ UI includes a clear toggle for enabling/disabling coupons globally and shows the current state.",
        "Shop/cart coupon UI (wherever coupon codes are entered/validated) reflects the disabled state (e.g., disables coupon input or shows an English message) while still relying on backend enforcement."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for reading and toggling the global coupons enabled/disabled state and invalidate coupon-related queries after toggle. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/CouponManagerSection.tsx",
          "operation": "modify",
          "description": "Implement the global coupons master toggle UI (current state + toggle) with English labels and clear success/error feedback, invalidating coupon state queries so Shop/cart reflects changes. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/shop/ShopCartDrawer.tsx",
          "operation": "modify",
          "description": "Query coupons enabled/disabled state and, when disabled, disable coupon input/apply button and show an English message explaining coupons are currently disabled; keep backend validation as the source of truth."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Provide owner-only Admin+ UI to promote/demote admins by Principal and keep permissions state consistent via query invalidation.",
      "acceptanceCriteria": [
        "Backend exposes owner-only methods to list admin registry entries, add/promote an admin principal, and demote/remove an admin principal.",
        "Admin+ UI provides a form to enter a Principal (text) to promote/demote, validates formatting client-side, and shows success/error feedback in English.",
        "After changes, relevant cached queries are invalidated so admin-only areas reflect updated permissions on next access.",
        "Non-owner callers cannot promote/demote admins (backend traps with clear English authorization errors)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add hooks for listing admin registry entries and for promote/demote admin actions using Principal.fromText parsing on the client. Ensure onSuccess invalidates owner/admin-related cached queries (e.g., isCallerOwner/currentUserRole/listAdmins) to keep UI consistent. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/AdminRegistrySection.tsx",
          "operation": "modify",
          "description": "Implement the promote/demote UI: Principal text input with client-side validation, buttons for promote/demote, list current admin entries, and show English success/error feedback including backend authorization errors. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPlus.tsx",
          "operation": "modify",
          "description": "Wire the AdminRegistrySection into the Admin+ tab set under a clearly labeled owner-only 'Promote/Demote Admins' tab/section, with English labels."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add owner UI to reset admin passwords and add an admin-facing password prompt step for admin-only capabilities.",
      "acceptanceCriteria": [
        "Backend provides owner-only methods to set/reset an admin password for a given admin principal and to clear it (if supported).",
        "Passwords are not returned in plaintext by any backend method.",
        "Admin+ UI allows the owner to select/enter an admin principal and set/reset that admin’s password with English success/error feedback.",
        "There is an admin-facing UI step that requires the admin password for accessing admin-only capabilities (or a clearly defined subset), and the password check is enforced by the backend (not only frontend)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a mutation hook for owner to set/reset an admin password (client supplies a password hash or the required string payload per backend interface) and invalidate any admin-registry-related queries after success. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/AdminPasswordResetSection.tsx",
          "operation": "modify",
          "description": "Implement owner UI for changing admin passwords: Principal input, password input (never displayed after submission), clear English feedback, and safe UX (e.g., confirm before overwrite). Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPlus.tsx",
          "operation": "modify",
          "description": "Wire the AdminPasswordResetSection into the Admin+ tab set under a clearly labeled 'Change Admin Passwords' tab/section with English labels."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Add an admin-facing password gate step before rendering clearly defined admin-only capabilities (or the whole Admin page), using a new password prompt component and handling backend authorization failures by showing English guidance (without exposing any password data). Use the authorization selected component patterns for auth UX; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminPasswordGate.tsx",
          "operation": "create",
          "description": "Create an admin password prompt + verification UI wrapper used by Admin page sections. It should store the password only in-memory for the session, show English error messages, and react gracefully to backend authorization traps. Use the authorization selected component patterns for authorization error handling; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Add an owner-only Site Analytics Snapshot section to Admin+ with loading/error states and refresh behavior.",
      "acceptanceCriteria": [
        "Backend exposes an owner-only query that returns an analytics snapshot derived from stored orders (e.g., total order count, total sales sum, last N orders summary).",
        "Admin+ UI displays the analytics snapshot in a readable summary card/table with English labels and handles loading/error states.",
        "Snapshot values update after new orders are created (after query invalidation or refresh)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook for fetching the analytics snapshot for the owner and ensure it can be invalidated/refetched after order creation and via a manual refresh action. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/adminplus/AnalyticsSnapshotSection.tsx",
          "operation": "modify",
          "description": "Implement a snapshot UI that displays totals in readable cards/table, includes loading and error states, and provides a refresh button. Use clear English labels and handle backend authorization errors gracefully. Use the authorization selected component patterns for handling backend authorization traps; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPlus.tsx",
          "operation": "modify",
          "description": "Wire the AnalyticsSnapshotSection into the Admin+ tab set under a clearly labeled 'Site Analytics Snapshot' tab/section with English labels."
        },
        {
          "path": "frontend/src/components/shop/ShopCartDrawer.tsx",
          "operation": "modify",
          "description": "After successful order creation, ensure analytics-related queries are invalidated/refetched (in addition to orders) so the Admin+ snapshot updates after new purchases."
        }
      ]
    }
  ]
}