{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin access without Internet Identity: code-only unlock and dashboard gating",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Remove Internet Identity login requirement from /admin-access; allow 5-character code submission, show “Access Granted”, and auto-redirect to the admin dashboard.",
      "acceptanceCriteria": [
        "Visiting /admin-access shows the “Administrative Access” UI and a 5-character code input without any Internet Identity login prompt or login requirement.",
        "Submitting the correct code results in visible success text \"Access Granted\" and an automatic redirect to /admin (or equivalent admin dashboard route) without any additional authentication steps.",
        "Submitting an invalid code displays an English error message and does not redirect.",
        "The page continues to enforce that the access code must be exactly 5 characters before submission."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminAccess.tsx",
          "operation": "modify",
          "description": "Remove Internet Identity login gating and related UI; always render the 5-character access code form, enforce exact length validation, call submitAdminAccessAttempt, show exact success text \"Access Granted\" on success, set session unlock state, and redirect to /admin automatically. Keep English error messaging and ensure invalid code does not redirect."
        },
        {
          "path": "frontend/src/lib/adminAccessCode.ts",
          "operation": "modify",
          "description": "Remove any frontend hardcoded master-code comparison utilities/constants (e.g., ADMIN_ACCESS_CODE / matchesExpectedCode) so verification is backend-authoritative; keep only normalization and format validation helpers used by the /admin-access form."
        },
        {
          "path": "frontend/src/components/layout/HeaderNav.tsx",
          "operation": "modify",
          "description": "Adjust Admin navigation link visibility logic so it does not depend on Internet Identity login state; keep any lockout-based hiding using backend-derived status only (English UI unchanged otherwise)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Gate /admin using the admin-access-code unlock session (and backend-confirmed admin status) rather than Internet Identity login; redirect locked sessions to /admin-access.",
      "acceptanceCriteria": [
        "After a successful code entry on /admin-access, navigating to /admin renders the existing AdminDashboardShell and its sections (home/shop/coupons/portfolio/testimonies/requests/inbox/security) without requiring Internet Identity login.",
        "Directly visiting /admin while the session is not unlocked redirects the user to /admin-access.",
        "After successful entry, /admin shows the existing “Access Granted” toast/confirmation behavior (or equivalent) and the dashboard remains usable for the session."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Remove the Internet Identity-based RequireAdmin wrapper from the /admin route and rely on the access-code session gate so that code entry alone is sufficient to render the existing AdminDashboardShell and sections; keep the existing \"Access Granted\" toast behavior based on the granted search param."
        },
        {
          "path": "frontend/src/components/auth/RequireAdminAccessGate.tsx",
          "operation": "modify",
          "description": "Enhance the gate to (1) redirect to /admin-access when the session is not unlocked and (2) when unlocked, additionally confirm admin status via a backend call (e.g., isCallerAdmin) before rendering; if backend-confirmation fails, clear the unlock state and redirect back to /admin-access."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook for checking backend-confirmed admin status for the current caller (e.g., wrapping isCallerAdmin), so /admin gating can verify privileges without requiring Internet Identity."
        }
      ]
    }
  ]
}