{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Phase 5B: Build an Admin Dashboard & Messaging system where admins can view all customer requests, review attachments, approve/decline requests, message customers and send coupons via customer inbox, upload attachments up to 800MB, and convert approved requests into orders. All actions are timestamped, with future support for multiple admins.",
  "architectural_notes": [
    "Support admin uploads/attachments up to 800MB per file.",
    "Audit trail: timestamp all admin actions (approve/decline/messages/coupons/order conversion).",
    "Design auth/roles with future multi-admin support in mind."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-support-attachments-up-to-800-mb-for-admin-to-customer-messaging-file-attachments-on-messages-storing-the-attachment-content-using-the-existing-blob-storage-mixin-and-linking-the-blob-reference-from-the-inbox-item",
      "title": "Support attachments up to 800 MB for admin-to-customer messaging (file attachments on messages), storing the attachment content using the existing blob storage mixin and linking the blob reference from the inbox item.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-upgrade-the-admin-dashboard-requests-tab-to-a-actually-load-requests-from-the-backend-b-show-a-request-detail-view-with-attachment-previews-links-c-allow-approve-decline-d-allow-sending-a-message-and-or-coupon-to-the-request-s-submitter-and-e-allow-converting-an-approved-request-into-an-order",
      "title": "Upgrade the Admin Dashboard Requests tab to (a) actually load requests from the backend, (b) show a request detail view with attachment previews/links, (c) allow approve/decline, (d) allow sending a message and/or coupon to the request’s submitter, and (e) allow converting an approved request into an order.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-customer-facing-inbox-ui-accessible-to-authenticated-users-that-lists-received-messages-and-coupons-and-includes-a-manual-refresh-control-to-fetch-new-items",
      "title": "Add a customer-facing Inbox UI (accessible to authenticated users) that lists received messages and coupons and includes a manual Refresh control to fetch new items.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Phase 5B Admin Dashboard & Messaging: view all requests, review/upload attachments (<=800MB), approve/decline, message customers/send coupons via inbox (manual refresh), convert approved requests to orders, and timestamp all actions; plan for multi-admin support.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Implement canister-backed persistence and APIs for customer Requests, including: create a request with optional media attachments, list requests for admins, and fetch a single request with its attachments and status.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add request moderation actions for admins: approve and decline requests, each producing an immutable action record stored on the Request (including actor principal, action type, optional note, and a timestamp).",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Implement a customer inbox in the backend that supports (a) admin-to-customer messages, and (b) admin-to-customer coupon deliveries; both must be retrievable by the customer and scoped to the customer principal.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Implement request-to-order conversion: allow admins to convert an approved Request into an Order, linking the created Order to the originating Request and preventing conversion unless the Request is approved.",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Ensure authorization and future multi-admin support: all admin-only operations (list all requests, request moderation, sending inbox items, converting requests to orders) must be guarded by the existing admin/owner role system and work for any principal in the admin registry (not only the owner).",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Phase 5B: Admin Requests Review, Messaging/Coupons Inbox, and Request-to-Order Conversion",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}