{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Phase 5A defined: logged-in users can submit Requests and Testimonies with media uploads, unique IDs, and instant Admin Dashboard visibility; testimonies media displays as interactive flippable cards with hover/click behaviors.",
  "architectural_notes": [
    "Require authentication to submit Requests and Testimonies.",
    "Persist unique identifiers for each submission (Request ID, Testimony ID) in backend.",
    "Enforce testimony media constraints: up to 5 photos + 3 videos; max 800MB per file; videos <= 5 minutes; media description text <= 1,500 characters.",
    "Admin Dashboard must receive new submissions instantly for review/moderation.",
    "Testimonies UI uses interactive flippable media cards with hover preview and click-to-flip behavior (video hover plays; click flips and pauses; photos click flips to description)."
  ],
  "known_issues": [
    "Automated build/implementation attempts for Phase 5/5A repeatedly failed; needs retry via smaller scoped steps or alternative implementation approach."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-implement-media-attachment-support-for-requests-optional-media-and-testimonies-up-to-5-photos-and-3-videos-using-the-existing-backend-blob-storage-mixin-storing-media-metadata-alongside-submissions",
      "title": "Implement media attachment support for Requests (optional media) and Testimonies (up to 5 photos and 3 videos) using the existing backend blob storage mixin, storing media metadata alongside submissions.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-create-customer-facing-ui-routes-and-forms-for-1-submitting-a-request-and-2-submitting-a-testimony-and-ensure-these-forms-are-only-accessible-usable-when-the-user-is-logged-in",
      "title": "Create customer-facing UI routes and forms for (1) submitting a Request and (2) submitting a Testimony, and ensure these forms are only accessible/usable when the user is logged in.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-expose-the-request-and-testimony-submission-entry-points-in-the-main-navigation-and-on-the-testimonies-page-and-add-clear-call-to-action-links-in-relevant-service-product-areas-without-breaking-existing-flows",
      "title": "Expose the Request and Testimony submission entry points in the main navigation and on the Testimonies page (and add clear call-to-action links in relevant service/product areas without breaking existing flows).",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-the-testimonies-page-to-display-testimony-media-as-interactive-flippable-cards-with-hover-and-click-effects-videos-auto-preview-on-hover-click-flips-and-pauses-to-show-description-photos-support-hover-zoom-and-click-flips-to-show-description",
      "title": "Implement the Testimonies page to display testimony media as interactive flippable cards with hover and click effects: videos auto-preview on hover, click flips and pauses to show description; photos support hover zoom and click flips to show description.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-add-admin-dashboard-ui-to-list-newly-submitted-requests-and-testimonies-showing-their-unique-ids-and-key-metadata-and-refresh-the-lists-immediately-after-a-new-submission-succeeds",
      "title": "Add admin dashboard UI to list newly submitted Requests and Testimonies, showing their unique IDs and key metadata, and refresh the lists immediately after a new submission succeeds.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "feature-add-react-query-hooks-in-the-existing-query-layer-for-creating-and-listing-requests-testimonies-and-any-required-admin-actions-following-existing-actor-based-patterns",
      "title": "Add React Query hooks in the existing query layer for creating and listing Requests/Testimonies (and any required admin actions), following existing actor-based patterns.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Phase 5A submission system: logged-in users submit Requests and Testimonies; Requests include contact + description + optional media + price range/Flexible; Testimonies allow up to 5 photos and 3 videos with per-file limits and media descriptions; generate unique IDs; instant Admin Dashboard listing; testimonies media shown as flippable cards with hover/click interactions.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add backend data models and APIs for customer Requests and Testimonies, each generating a unique ID on creation and persisting submissions so they can be listed in the admin dashboard.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Implement backend authorization rules so only logged-in users can submit Requests and Testimonies, and only admins can review/list submissions in the admin dashboard.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "If the backend schema for testimonies/quote requests must change to support multiple media items and per-media descriptions, add a conditional migration that preserves existing stored data and increments IDs safely.",
      "reqIds": [
        "REQ-9"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Phase 5A: Logged-in Requests & Testimonies submissions with media, unique IDs, flippable cards, and Admin listing",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}